Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_scan_n21t00
Knowledge graph 'test_scan_n21t00' created.
Switched to knowledge graph: test_scan_n21t00
> .kg use test_scan_n21t00
Switched to knowledge graph: test_scan_n21t00
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> +node[(1,10), (2,20), (3,30)]
Inserted 3 fact(s) into 'node'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> ?node(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 10 │
│ 2 │ 20 │
│ 3 │ 30 │
└───┴────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_scan_n21t00
Knowledge graph 'test_scan_n21t00' dropped.
