Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_scan
Knowledge graph 'test_scan' created.
Switched to knowledge graph: test_scan
> .kg use test_scan
Switched to knowledge graph: test_scan
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> +node[(1,10), (2,20), (3,30)].
Inserted 3 fact(s) into 'node'.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> ?- node(X, Y).
3 rows:
  (1, 10)
  (2, 20)
  (3, 30)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_scan
Knowledge graph 'test_scan' dropped.
