Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_distinct_n21t01
Knowledge graph 'test_distinct_n21t01' created.
Switched to knowledge graph: test_distinct_n21t01
> .kg use test_distinct_n21t01
Switched to knowledge graph: test_distinct_n21t01
> +edge[(1, 2), (2, 3), (1, 3), (3, 2)]
Inserted 4 fact(s) into 'edge'.
> +reachable(X, Y) <- edge(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- edge(X, Y), reachable(Y, Z)
Rule 'reachable' registered.
> ?reachable(1, Y)
┌───┬───┐
│ 1 │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
└───┴───┘
2 rows
> +data[(1, 10), (2, 10), (3, 10), (4, 20)]
Inserted 4 fact(s) into 'data'.
> +distinct_vals(V) <- data(_, V)
Rule 'distinct_vals' registered.
> ?distinct_vals(V)
┌────┐
│ V  │
├────┤
│ 10 │
│ 20 │
└────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_distinct_n21t01
Knowledge graph 'test_distinct_n21t01' dropped.
