Executing script: examples/datalog/21_query_features/01_distinct_results.dl

> .db create test_distinct
Database 'test_distinct' created.
Switched to database: test_distinct
> .db use test_distinct
Switched to database: test_distinct
> +edge[(1, 2), (2, 3), (1, 3), (3, 2)].
Inserted 4 facts into 'edge'.
> reachable(X, Y) := edge(X, Y).
View 'reachable' registered.
> reachable(X, Z) := edge(X, Y), reachable(Y, Z).
Rule added to view 'reachable' (2 rules total).
> ?- reachable(1, Y).
2 rows:
  (1, 2)
  (1, 3)
> +data[(1, 10), (2, 10), (3, 10), (4, 20)].
Inserted 4 facts into 'data'.
> distinct_vals(V) := data(_, V).
View 'distinct_vals' registered.
> ?- distinct_vals(V).
2 rows:
  (10)
  (20)
> .db use default
Switched to database: default
> .db drop test_distinct
Database 'test_distinct' dropped.
