Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_projection
Knowledge graph 'test_projection' created.
Switched to knowledge graph: test_projection
> .kg use test_projection
Switched to knowledge graph: test_projection
> +employees[(1, 50000, 10), (2, 60000, 20), (3, 55000, 10), (4, 70000, 30)].
Inserted 4 fact(s) into 'employees'.
> +departments(D) :- employees(_, _, D).
Rule 'departments' registered.
> ?- departments(D).
3 rows:
  (10)
  (20)
  (30)
> +id_salary(Id, Sal) :- employees(Id, Sal, _).
Rule 'id_salary' registered.
> ?- id_salary(X, Y).
4 rows:
  (1, 50000)
  (2, 60000)
  (3, 55000)
  (4, 70000)
> +id_dept(Id, D) :- employees(Id, _, D).
Rule 'id_dept' registered.
> ?- id_dept(X, Y).
4 rows:
  (1, 10)
  (2, 20)
  (3, 10)
  (4, 30)
> +high_earners(Emp, Pay) :- employees(Emp, Pay, _), Pay > 55000.
Rule 'high_earners' registered.
> ?- high_earners(X, Y).
2 rows:
  (2, 60000)
  (4, 70000)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_projection
Knowledge graph 'test_projection' dropped.
