Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_selection
Knowledge graph 'test_selection' created.
Switched to knowledge graph: test_selection
> .kg use test_selection
Switched to knowledge graph: test_selection
> +products[(1, 100, 10), (2, 200, 5), (3, 150, 15), (4, 300, 8), (5, 50, 20)].
Inserted 5 fact(s) into 'products'.
> +expensive(Id, P, Q) :- products(Id, P, Q), P > 100.
Rule 'expensive' registered.
> ?- expensive(X, Y, Z).
3 rows:
  (2, 200, 5)
  (3, 150, 15)
  (4, 300, 8)
> +low_stock(Id, P, Q) :- products(Id, P, Q), Q < 10.
Rule 'low_stock' registered.
> ?- low_stock(X, Y, Z).
2 rows:
  (2, 200, 5)
  (4, 300, 8)
> +expensive_low_stock(Id) :- products(Id, P, Q), P > 100, Q < 10.
Rule 'expensive_low_stock' registered.
> ?- expensive_low_stock(X).
2 rows:
  (2)
  (4)
> +mid_price(Id, P) :- products(Id, P, _), P >= 100, P <= 200.
Rule 'mid_price' registered.
> ?- mid_price(X, Y).
3 rows:
  (1, 100)
  (2, 200)
  (3, 150)
> +categories[(1, 100), (2, 200), (3, 100)].
Inserted 3 fact(s) into 'categories'.
> +category_100(Id) :- categories(Id, 100).
Rule 'category_100' registered.
> ?- category_100(X).
2 rows:
  (1)
  (3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_selection
Knowledge graph 'test_selection' dropped.
