Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_computed_n21t04
Knowledge graph 'test_computed_n21t04' created.
Switched to knowledge graph: test_computed_n21t04
> .kg use test_computed_n21t04
Switched to knowledge graph: test_computed_n21t04
> +items[(1, 100, 2), (2, 50, 5), (3, 200, 1)]
Inserted 3 fact(s) into 'items'.
> +item_value(Id, P*Q) <- items(Id, P, Q)
Rule 'item_value' registered.
> ?item_value(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 200 │
│ 2 │ 250 │
│ 3 │ 200 │
└───┴─────┘
3 rows
> +discounted(Id, P-P/10) <- items(Id, P, _)
Rule 'discounted' registered.
> ?discounted(X, Y)
┌───┬───────┐
│ X │ Y     │
├───┼───────┤
│ 1 │  90.0 │
│ 2 │  45.0 │
│ 3 │ 180.0 │
└───┴───────┘
3 rows
> +scores[(1, 80, 100), (2, 45, 50), (3, 90, 100)]
Inserted 3 fact(s) into 'scores'.
> +percentage(Id, Got*100/Max) <- scores(Id, Got, Max)
Rule 'percentage' registered.
> ?percentage(X, Y)
┌───┬──────┐
│ X │ Y    │
├───┼──────┤
│ 1 │ 80.0 │
│ 2 │ 90.0 │
│ 3 │ 90.0 │
└───┴──────┘
3 rows
> +summary(Id, P*2, P/2) <- items(Id, P, _)
Rule 'summary' registered.
> ?summary(X, Y, Z)
┌───┬─────┬───────┐
│ X │ Y   │ Z     │
├───┼─────┼───────┤
│ 1 │ 200 │  50.0 │
│ 2 │ 100 │  25.0 │
│ 3 │ 400 │ 100.0 │
└───┴─────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_computed_n21t04
Knowledge graph 'test_computed_n21t04' dropped.
