Executing script: examples/datalog/21_query_features/05_complex_queries.dl

> .db create test_complex_query
Database 'test_complex_query' created.
Switched to database: test_complex_query
> .db use test_complex_query
Switched to database: test_complex_query
> +orders[(1, 100, 10), (2, 100, 20), (3, 200, 15), (4, 200, 5)].
Inserted 4 facts into 'orders'.
> +customers[(100, 1000), (200, 2000)].
Inserted 2 facts into 'customers'.
> view large_orders(OrderId: int, CustCredit: int) :- orders(OrderId, CustId, Qty), customers(CustId, CustCredit), Qty > 10.
View 'large_orders' registered.
> ?- large_orders(X, Y).
2 rows:
  (2, 1000)
  (3, 2000)
> view customer_total(CustId: int, sum<Qty>: int) :- orders(_, CustId, Qty).
View 'customer_total' registered.
> ?- customer_total(X, Y).
2 rows:
  (100, 30)
  (200, 20)
> +employees[(1, 50000, 10), (2, 60000, 10), (3, 55000, 20)].
Inserted 3 facts into 'employees'.
> view dept_10(Id: int, Sal: int) :- employees(Id, Sal, 10).
View 'dept_10' registered.
> view high_paid_dept10(Id: int) :- dept_10(Id, Sal), Sal > 55000.
View 'high_paid_dept10' registered.
> ?- high_paid_dept10(X).
1 rows:
  (2)
> +pairs[(1, 2), (2, 3), (3, 4), (1, 3)].
Inserted 4 facts into 'pairs'.
> view two_hop(A: int, C: int) :- pairs(A, B), pairs(B, C).
View 'two_hop' registered.
> ?- two_hop(X, Y).
3 rows:
  (1, 3)
  (1, 4)
  (2, 4)
> view order_value(Oid: int, Qty*10: int) :- orders(Oid, _, Qty).
View 'order_value' registered.
> view total_value(sum<V>: int) :- order_value(_, V).
View 'total_value' registered.
> ?- total_value(T).
1 rows:
  (500)
> .db use default
Switched to database: default
> .db drop test_complex_query
Database 'test_complex_query' dropped.
