Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_wildcard_n21t06
Knowledge graph 'test_wildcard_n21t06' created.
Switched to knowledge graph: test_wildcard_n21t06
> .kg use test_wildcard_n21t06
Switched to knowledge graph: test_wildcard_n21t06
> +people[(1, "alice", 25), (2, "bob", 30), (3, "charlie", 25), (4, "diana", 35)]
Inserted 4 fact(s) into 'people'.
> ?people(Id, _, 25)
┌────┬───────────┬────┐
│ Id │ _         │ 25 │
├────┼───────────┼────┤
│  1 │ "alice"   │ 25 │
│  3 │ "charlie" │ 25 │
└────┴───────────┴────┘
2 rows
> ?people(Id, _, _)
┌────┬───────────┬────┐
│ Id │ _         │ _  │
├────┼───────────┼────┤
│  1 │ "alice"   │ 25 │
│  2 │ "bob"     │ 30 │
│  3 │ "charlie" │ 25 │
│  4 │ "diana"   │ 35 │
└────┴───────────┴────┘
4 rows
> ?people(_, Name, 30)
┌───┬───────┬────┐
│ _ │ Name  │ 30 │
├───┼───────┼────┤
│ 2 │ "bob" │ 30 │
└───┴───────┴────┘
1 rows
> +just_names(Name) <- people(_, Name, _)
Rule 'just_names' registered.
> ?just_names(N)
┌───────────┐
│ N         │
├───────────┤
│ "alice"   │
│ "bob"     │
│ "charlie" │
│ "diana"   │
└───────────┘
4 rows
> +departments[(1, "engineering"), (2, "sales"), (3, "marketing")]
Inserted 3 fact(s) into 'departments'.
> dept_for_person(Name, Dept) <- people(Id, Name, _), departments(Id, Dept)
┌───────────┬───────────────┐
│ X         │ Y             │
├───────────┼───────────────┤
│ "alice"   │ "engineering" │
│ "bob"     │ "sales"       │
│ "charlie" │ "marketing"   │
└───────────┴───────────────┘
3 rows
(session: 1 rule(s))
> ?dept_for_person(Name, Dept)
┌───────────┬───────────────┐
│ Name      │ Dept          │
├───────────┼───────────────┤
│ "alice"   │ "engineering" │
│ "bob"     │ "sales"       │
│ "charlie" │ "marketing"   │
└───────────┴───────────────┘
3 rows
> +matrix[(1, 1, 10), (1, 2, 20), (2, 1, 30), (2, 2, 40)]
Inserted 4 fact(s) into 'matrix'.
> row_values(Row, Val) <- matrix(Row, _, Val)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 10 │
│ 1 │ 20 │
│ 2 │ 30 │
│ 2 │ 40 │
└───┴────┘
4 rows
(session: 2 rule(s))
> ?row_values(1, V)
┌───┬────┐
│ 1 │ V  │
├───┼────┤
│ 1 │ 10 │
│ 1 │ 20 │
└───┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_wildcard_n21t06
Knowledge graph 'test_wildcard_n21t06' dropped.
