Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_comp_filt_n21t09
Knowledge graph 'test_comp_filt_n21t09' created.
Switched to knowledge graph: test_comp_filt_n21t09
> .kg use test_comp_filt_n21t09
Switched to knowledge graph: test_comp_filt_n21t09
> +items[(1, 10), (2, 20), (3, 30), (4, 40)]
Inserted 4 fact(s) into 'items'.
> doubled_above_50(Id, D) <- items(Id, Val), D = Val * 2, D > 50
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 3 │ 60 │
│ 4 │ 80 │
└───┴────┘
2 rows
(session: 1 rule(s))
> ?doubled_above_50(Id, D)
┌────┬────┐
│ Id │ D  │
├────┼────┤
│  3 │ 60 │
│  4 │ 80 │
└────┴────┘
2 rows
> compute_filter(Id, Val, D) <- items(Id, Val), D = Val * 2, Val > 15
┌───┬────┬────┐
│ X │ Y  │ Z  │
├───┼────┼────┤
│ 2 │ 20 │ 40 │
│ 3 │ 30 │ 60 │
│ 4 │ 40 │ 80 │
└───┴────┴────┘
3 rows
(session: 2 rule(s))
> ?compute_filter(Id, Val, D)
┌────┬─────┬────┐
│ Id │ Val │ D  │
├────┼─────┼────┤
│  2 │  20 │ 40 │
│  3 │  30 │ 60 │
│  4 │  40 │ 80 │
└────┴─────┴────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_comp_filt_n21t09
Knowledge graph 'test_comp_filt_n21t09' dropped.
