Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_reorder_n21t10
Knowledge graph 'test_reorder_n21t10' created.
Switched to knowledge graph: test_reorder_n21t10
> .kg use test_reorder_n21t10
Switched to knowledge graph: test_reorder_n21t10
> +records[(1, "Alice", 100), (2, "Bob", 200)]
Inserted 2 fact(s) into 'records'.
> ?records(Id, Name, Val)
┌────┬─────────┬─────┐
│ Id │ Name    │ Val │
├────┼─────────┼─────┤
│  1 │ "Alice" │ 100 │
│  2 │ "Bob"   │ 200 │
└────┴─────────┴─────┘
2 rows
> reordered(Name, Val, Id) <- records(Id, Name, Val)
┌─────────┬─────┬───┐
│ X       │ Y   │ Z │
├─────────┼─────┼───┤
│ "Alice" │ 100 │ 1 │
│ "Bob"   │ 200 │ 2 │
└─────────┴─────┴───┘
2 rows
(session: 1 rule(s))
> ?reordered(Name, Val, Id)
┌─────────┬─────┬────┐
│ Name    │ Val │ Id │
├─────────┼─────┼────┤
│ "Alice" │ 100 │  1 │
│ "Bob"   │ 200 │  2 │
└─────────┴─────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_reorder_n21t10
Knowledge graph 'test_reorder_n21t10' dropped.
