Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_dup_col_n21t11
Knowledge graph 'test_dup_col_n21t11' created.
Switched to knowledge graph: test_dup_col_n21t11
> .kg use test_dup_col_n21t11
Switched to knowledge graph: test_dup_col_n21t11
> +nums[(1, 10), (2, 20)]
Inserted 2 fact(s) into 'nums'.
> dup(X, X, Y) <- nums(X, Y)
┌───┬───┬────┐
│ X │ Y │ Z  │
├───┼───┼────┤
│ 1 │ 1 │ 10 │
│ 2 │ 2 │ 20 │
└───┴───┴────┘
2 rows
(session: 1 rule(s))
> ?dup(A, B, C)
┌───┬───┬────┐
│ A │ B │ C  │
├───┼───┼────┤
│ 1 │ 1 │ 10 │
│ 2 │ 2 │ 20 │
└───┴───┴────┘
2 rows
> same_val(X, Y, Y) <- nums(X, Y)
┌───┬────┬────┐
│ X │ Y  │ Z  │
├───┼────┼────┤
│ 1 │ 10 │ 10 │
│ 2 │ 20 │ 20 │
└───┴────┴────┘
2 rows
(session: 2 rule(s))
> ?same_val(A, B, C)
┌───┬────┬────┐
│ A │ B  │ C  │
├───┼────┼────┤
│ 1 │ 10 │ 10 │
│ 2 │ 20 │ 20 │
└───┴────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_dup_col_n21t11
Knowledge graph 'test_dup_col_n21t11' dropped.
