Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dup_col
Knowledge graph 'test_dup_col' created.
Switched to knowledge graph: test_dup_col
> .kg use test_dup_col
Switched to knowledge graph: test_dup_col
> +nums[(1, 10), (2, 20)].
Inserted 2 fact(s) into 'nums'.
> dup(X, X, Y) :- nums(X, Y).
2 rows:
  (1, 1, 10)
  (2, 2, 20)
(session: 1 rule(s))
> ?- dup(A, B, C).
2 rows:
  (1, 1, 10)
  (2, 2, 20)
> same_val(X, Y, Y) :- nums(X, Y).
2 rows:
  (1, 10, 10)
  (2, 20, 20)
(session: 2 rule(s))
> ?- same_val(A, B, C).
2 rows:
  (1, 10, 10)
  (2, 20, 20)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_dup_col
Knowledge graph 'test_dup_col' dropped.
