Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_inline_n21t15
Knowledge graph 'test_inline_n21t15' created.
Switched to knowledge graph: test_inline_n21t15
> .kg use test_inline_n21t15
Switched to knowledge graph: test_inline_n21t15
> +data[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'data'.
> with_computed(Id, Val, Double, Triple) <- data(Id, Val), Double = Val * 2, Triple = Val * 3
┌──────┬──────┬──────┬──────┐
│ col0 │ col1 │ col2 │ col3 │
├──────┼──────┼──────┼──────┤
│    1 │   10 │   20 │   30 │
│    2 │   20 │   40 │   60 │
│    3 │   30 │   60 │   90 │
└──────┴──────┴──────┴──────┘
3 rows
(session: 1 rule(s))
> ?with_computed(Id, Val, Double, Triple)
┌──────┬──────┬──────┬──────┐
│ col0 │ col1 │ col2 │ col3 │
├──────┼──────┼──────┼──────┤
│    1 │   10 │   20 │   30 │
│    2 │   20 │   40 │   60 │
│    3 │   30 │   60 │   90 │
└──────┴──────┴──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_inline_n21t15
Knowledge graph 'test_inline_n21t15' dropped.
