Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_chained_n21t16
Knowledge graph 'test_chained_n21t16' created.
Switched to knowledge graph: test_chained_n21t16
> .kg use test_chained_n21t16
Switched to knowledge graph: test_chained_n21t16
> +base[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'base'.
> +step1(X, Y) <- base(X), Y = X + 1
Rule 'step1' registered.
> +step2(X, Y) <- step1(X, Z), Y = Z + 1
Rule 'step2' registered.
> +step3(X, Y) <- step2(X, Z), Y = Z + 1
Rule 'step3' registered.
> ?step1(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
│    3 │    4 │
└──────┴──────┘
3 rows
> ?step2(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
│    2 │    4 │
│    3 │    5 │
└──────┴──────┘
3 rows
> ?step3(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    4 │
│    2 │    5 │
│    3 │    6 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_chained_n21t16
Knowledge graph 'test_chained_n21t16' dropped.
