Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_filter_head_n21t17
Knowledge graph 'test_filter_head_n21t17' created.
Switched to knowledge graph: test_filter_head_n21t17
> .kg use test_filter_head_n21t17
Switched to knowledge graph: test_filter_head_n21t17
> +vals[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'vals'.
> doubled_big(X, Y) :- vals(X), Y = X * 2, Y > 5.
3 rows:
  (3, 6)
  (4, 8)
  (5, 10)
(session: 1 rule(s))
> ?- doubled_big(X, Y).
3 rows:
  (3, 6)
  (4, 8)
  (5, 10)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_filter_head_n21t17
Knowledge graph 'test_filter_head_n21t17' dropped.
