Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_proj_reorder_n21t20
Knowledge graph 'test_proj_reorder_n21t20' created.
Switched to knowledge graph: test_proj_reorder_n21t20
> .kg use test_proj_reorder_n21t20
Switched to knowledge graph: test_proj_reorder_n21t20
> +data[(1, "Alice", 100), (2, "Bob", 200)]
Inserted 2 fact(s) into 'data'.
> reordered(Name, Val, Id) <- data(Id, Name, Val)
┌─────────┬─────┬───┐
│ X       │ Y   │ Z │
├─────────┼─────┼───┤
│ "Alice" │ 100 │ 1 │
│ "Bob"   │ 200 │ 2 │
└─────────┴─────┴───┘
2 rows
(session: 1 rule(s))
> ?reordered(Name, Val, Id)
┌─────────┬─────┬────┐
│ Name    │ Val │ Id │
├─────────┼─────┼────┤
│ "Alice" │ 100 │  1 │
│ "Bob"   │ 200 │  2 │
└─────────┴─────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_proj_reorder_n21t20
Knowledge graph 'test_proj_reorder_n21t20' dropped.
