Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_const_head_n21t21
Knowledge graph 'test_const_head_n21t21' created.
Switched to knowledge graph: test_const_head_n21t21
> .kg use test_const_head_n21t21
Switched to knowledge graph: test_const_head_n21t21
> +items[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'items'.
> with_label(X, "item") :- items(X).
3 rows:
  (1, "item")
  (2, "item")
  (3, "item")
(session: 1 rule(s))
> ?- with_label(X, Label).
3 rows:
  (1, "item")
  (2, "item")
  (3, "item")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_const_head_n21t21
Knowledge graph 'test_const_head_n21t21' dropped.
