Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_wildcard_n21t23
Knowledge graph 'test_wildcard_n21t23' created.
Switched to knowledge graph: test_wildcard_n21t23
> .kg use test_wildcard_n21t23
Switched to knowledge graph: test_wildcard_n21t23
> +data[(1, "a", 100), (2, "b", 200), (3, "a", 300)].
Inserted 3 fact(s) into 'data'.
> ids_only(Id) :- data(Id, _, _).
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> category_a(Id) :- data(Id, "a", _).
2 rows:
  (1)
  (3)
(session: 2 rule(s))
> ?- ids_only(Id).
3 rows:
  (1)
  (2)
  (3)
> ?- category_a(Id).
2 rows:
  (1)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_wildcard_n21t23
Knowledge graph 'test_wildcard_n21t23' dropped.
