Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_wildcard_n21t23
Knowledge graph 'test_wildcard_n21t23' created.
Switched to knowledge graph: test_wildcard_n21t23
> .kg use test_wildcard_n21t23
Switched to knowledge graph: test_wildcard_n21t23
> +data[(1, "a", 100), (2, "b", 200), (3, "a", 300)]
Inserted 3 fact(s) into 'data'.
> ids_only(Id) <- data(Id, _, _)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
(session: 1 rule(s))
> category_a(Id) <- data(Id, "a", _)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
(session: 2 rule(s))
> ?ids_only(Id)
┌────┐
│ Id │
├────┤
│  1 │
│  2 │
│  3 │
└────┘
3 rows
> ?category_a(Id)
┌────┐
│ Id │
├────┤
│  1 │
│  3 │
└────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_wildcard_n21t23
Knowledge graph 'test_wildcard_n21t23' dropped.
