Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_chain_comp_n21t25
Knowledge graph 'test_chain_comp_n21t25' created.
Switched to knowledge graph: test_chain_comp_n21t25
> .kg use test_chain_comp_n21t25
Switched to knowledge graph: test_chain_comp_n21t25
> +base[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'base'.
> chained(X, A, B, C) :- base(X), A = X + 1, B = A * 2, C = B + 10.
3 rows:
  (1, 2, 4, 14)
  (2, 3, 6, 16)
  (3, 4, 8, 18)
(session: 1 rule(s))
> ?- chained(X, A, B, C).
3 rows:
  (1, 2, 4, 14)
  (2, 3, 6, 16)
  (3, 4, 8, 18)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_chain_comp_n21t25
Knowledge graph 'test_chain_comp_n21t25' dropped.
