Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_chain_comp_n21t25
Knowledge graph 'test_chain_comp_n21t25' created.
Switched to knowledge graph: test_chain_comp_n21t25
> .kg use test_chain_comp_n21t25
Switched to knowledge graph: test_chain_comp_n21t25
> +base[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'base'.
> chained(X, A, B, C) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> base(X),
Parse error: Expected parentheses: (X),
> A = X + 1,
Parse error: Unrecognized statement: A = X + 1,
> B = A * 2,
Parse error: Unrecognized statement: B = A * 2,
> C = B + 10
Parse error: Unrecognized statement: C = B + 10
> ?chained(X, A, B, C)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_chain_comp_n21t25
Knowledge graph 'test_chain_comp_n21t25' dropped.
