Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_proj_filter
Knowledge graph 'test_proj_filter' created.
Switched to knowledge graph: test_proj_filter
> .kg use test_proj_filter
Switched to knowledge graph: test_proj_filter
> +data[(1, "A", 100), (2, "B", 200), (3, "A", 300)].
Inserted 3 fact(s) into 'data'.
> filtered(Name, Val) :- data(_, Name, Val), Val > 150.
2 rows:
  ("A", 300)
  ("B", 200)
(session: 1 rule(s))
> ?- filtered(Name, Val).
2 rows:
  ("A", 300)
  ("B", 200)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_proj_filter
Knowledge graph 'test_proj_filter' dropped.
