Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_multi_col_n21t32
Knowledge graph 'test_multi_col_n21t32' created.
Switched to knowledge graph: test_multi_col_n21t32
> .kg use test_multi_col_n21t32
Switched to knowledge graph: test_multi_col_n21t32
> +inventory[(1, "A", 100), (1, "B", 200), (2, "A", 150), (2, "B", 250)]
Inserted 4 fact(s) into 'inventory'.
> ?inventory(1, "A", Qty)
┌───┬─────┬─────┐
│ 1 │ A   │ Qty │
├───┼─────┼─────┤
│ 1 │ "A" │ 100 │
└───┴─────┴─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_col_n21t32
Knowledge graph 'test_multi_col_n21t32' dropped.
