Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_order_filter_n21t33
Knowledge graph 'test_order_filter_n21t33' created.
Switched to knowledge graph: test_order_filter_n21t33
> .kg use test_order_filter_n21t33
Switched to knowledge graph: test_order_filter_n21t33
> +scores[("alice", 85), ("bob", 92), ("carol", 78), ("dave", 95), ("eve", 88)]
Inserted 5 fact(s) into 'scores'.
> ?scores(Name, Score:desc), Score > 80
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "dave"  │   95 │
│ "bob"   │   92 │
│ "eve"   │   88 │
│ "alice" │   85 │
└─────────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_order_filter_n21t33
Knowledge graph 'test_order_filter_n21t33' dropped.
