Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_const_filter
Knowledge graph 'test_const_filter' created.
Switched to knowledge graph: test_const_filter
> .kg use test_const_filter
Switched to knowledge graph: test_const_filter
> +data[(1, "A", 100), (2, "B", 200), (3, "A", 150)].
Inserted 3 fact(s) into 'data'.
> ?- data(Id, "A", Val).
2 rows:
  (1, "A", 100)
  (3, "A", 150)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_const_filter
Knowledge graph 'test_const_filter' dropped.
