Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_limit_offset_n21t36
Knowledge graph 'test_limit_offset_n21t36' created.
Switched to knowledge graph: test_limit_offset_n21t36
> .kg use test_limit_offset_n21t36
Switched to knowledge graph: test_limit_offset_n21t36
> +data[("a", 1), ("b", 2), ("c", 3), ("d", 4), ("e", 5)]
Inserted 5 fact(s) into 'data'.
> ?data(X, Y:asc), limit(3, 2)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│ "c"  │    3 │
│ "d"  │    4 │
│ "e"  │    5 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_limit_offset_n21t36
Knowledge graph 'test_limit_offset_n21t36' dropped.
