Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_query_comp_n21t37
Knowledge graph 'test_query_comp_n21t37' created.
Switched to knowledge graph: test_query_comp_n21t37
> .kg use test_query_comp_n21t37
Switched to knowledge graph: test_query_comp_n21t37
> +nums[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'nums'.
> doubled(X, Y) :- nums(X), Y = X * 2.
3 rows:
  (1, 2)
  (2, 4)
  (3, 6)
(session: 1 rule(s))
> ?- doubled(X, Y).
3 rows:
  (1, 2)
  (2, 4)
  (3, 6)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_query_comp_n21t37
Knowledge graph 'test_query_comp_n21t37' dropped.
