Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_limit_exceeds_n21t38
Knowledge graph 'test_limit_exceeds_n21t38' created.
Switched to knowledge graph: test_limit_exceeds_n21t38
> .kg use test_limit_exceeds_n21t38
Switched to knowledge graph: test_limit_exceeds_n21t38
> +data[("a", 1), ("b", 2), ("c", 3)]
Inserted 3 fact(s) into 'data'.
> ?data(X, Y), limit(10)
┌─────┬───┐
│ X   │ Y │
├─────┼───┤
│ "a" │ 1 │
│ "b" │ 2 │
│ "c" │ 3 │
└─────┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_limit_exceeds_n21t38
Knowledge graph 'test_limit_exceeds_n21t38' dropped.
