Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_inline_lit_n21t41
Knowledge graph 'test_inline_lit_n21t41' created.
Switched to knowledge graph: test_inline_lit_n21t41
> .kg use test_inline_lit_n21t41
Switched to knowledge graph: test_inline_lit_n21t41
> +base[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'base'.
> with_const(X, "constant") :- base(X).
3 rows:
  (1, "constant")
  (2, "constant")
  (3, "constant")
(session: 1 rule(s))
> ?- with_const(X, C).
3 rows:
  (1, "constant")
  (2, "constant")
  (3, "constant")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_inline_lit_n21t41
Knowledge graph 'test_inline_lit_n21t41' dropped.
