Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_expr_assign_n21t42
Knowledge graph 'test_expr_assign_n21t42' created.
Switched to knowledge graph: test_expr_assign_n21t42
> .kg use test_expr_assign_n21t42
Switched to knowledge graph: test_expr_assign_n21t42
> +vals[(10,), (20,), (30,)]
Inserted 3 fact(s) into 'vals'.
> computed(X, Plus10, Times2, Squared) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> vals(X),
Parse error: Expected parentheses: (X),
> Plus10 = X + 10,
Parse error: Unrecognized statement: Plus10 = X + 10,
> Times2 = X * 2,
Parse error: Unrecognized statement: Times2 = X * 2,
> Squared = X * X
Parse error: Unrecognized statement: Squared = X * X
> ?computed(X, Plus10, Times2, Squared)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_expr_assign_n21t42
Knowledge graph 'test_expr_assign_n21t42' dropped.
