Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_expr_assign_n21t42
Knowledge graph 'test_expr_assign_n21t42' created.
Switched to knowledge graph: test_expr_assign_n21t42
> .kg use test_expr_assign_n21t42
Switched to knowledge graph: test_expr_assign_n21t42
> +vals[(10,), (20,), (30,)].
Inserted 3 fact(s) into 'vals'.
> computed(X, Plus10, Times2, Squared) :- vals(X), Plus10 = X + 10, Times2 = X * 2, Squared = X * X.
3 rows:
  (10, 20, 20, 100)
  (20, 30, 40, 400)
  (30, 40, 60, 900)
(session: 1 rule(s))
> ?- computed(X, Plus10, Times2, Squared).
3 rows:
  (10, 20, 20, 100)
  (20, 30, 40, 400)
  (30, 40, 60, 900)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_expr_assign_n21t42
Knowledge graph 'test_expr_assign_n21t42' dropped.
