Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_reorder
Knowledge graph 'test_reorder' created.
Switched to knowledge graph: test_reorder
> .kg use test_reorder
Switched to knowledge graph: test_reorder
> +records[(1, "Alice", 100), (2, "Bob", 200), (3, "Carol", 150)].
Inserted 3 fact(s) into 'records'.
> reordered(Amount, Name, Id) :- records(Id, Name, Amount).
3 rows:
  (100, "Alice", 1)
  (150, "Carol", 3)
  (200, "Bob", 2)
(session: 1 rule(s))
> ?- reordered(A, N, I).
3 rows:
  (100, "Alice", 1)
  (150, "Carol", 3)
  (200, "Bob", 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_reorder
Knowledge graph 'test_reorder' dropped.
