Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_reorder_n21t45
Knowledge graph 'test_reorder_n21t45' created.
Switched to knowledge graph: test_reorder_n21t45
> .kg use test_reorder_n21t45
Switched to knowledge graph: test_reorder_n21t45
> +records[(1, "Alice", 100), (2, "Bob", 200), (3, "Carol", 150)]
Inserted 3 fact(s) into 'records'.
> reordered(Amount, Name, Id) <- records(Id, Name, Amount)
┌─────┬─────────┬───┐
│ X   │ Y       │ Z │
├─────┼─────────┼───┤
│ 100 │ "Alice" │ 1 │
│ 150 │ "Carol" │ 3 │
│ 200 │ "Bob"   │ 2 │
└─────┴─────────┴───┘
3 rows
(session: 1 rule(s))
> ?reordered(A, N, I)
┌─────┬─────────┬───┐
│ A   │ N       │ I │
├─────┼─────────┼───┤
│ 100 │ "Alice" │ 1 │
│ 150 │ "Carol" │ 3 │
│ 200 │ "Bob"   │ 2 │
└─────┴─────────┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_reorder_n21t45
Knowledge graph 'test_reorder_n21t45' dropped.
