Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_underscore_n21t46
Knowledge graph 'test_underscore_n21t46' created.
Switched to knowledge graph: test_underscore_n21t46
> .kg use test_underscore_n21t46
Switched to knowledge graph: test_underscore_n21t46
> +records[(1, "Alice", 100, "active"), (2, "Bob", 200, "inactive"), (3, "Carol", 150, "active")]
Inserted 3 fact(s) into 'records'.
> id_status(Id, Status) <- records(Id, _, _, Status)
┌───┬────────────┐
│ X │ Y          │
├───┼────────────┤
│ 1 │ "active"   │
│ 2 │ "inactive" │
│ 3 │ "active"   │
└───┴────────────┘
3 rows
(session: 1 rule(s))
> ?id_status(Id, Status)
┌────┬────────────┐
│ Id │ Status     │
├────┼────────────┤
│  1 │ "active"   │
│  2 │ "inactive" │
│  3 │ "active"   │
└────┴────────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_underscore_n21t46
Knowledge graph 'test_underscore_n21t46' dropped.
