Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_query_n21t47
Knowledge graph 'test_multi_query_n21t47' created.
Switched to knowledge graph: test_multi_query_n21t47
> .kg use test_multi_query_n21t47
Switched to knowledge graph: test_multi_query_n21t47
> +data[(1, "a", 100), (2, "b", 200), (3, "c", 300)]
Inserted 3 fact(s) into 'data'.
> ?data(X, _, _)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "a"  │  100 │
│    2 │ "b"  │  200 │
│    3 │ "c"  │  300 │
└──────┴──────┴──────┘
3 rows
> ?data(_, Y, _)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "a"  │  100 │
│    2 │ "b"  │  200 │
│    3 │ "c"  │  300 │
└──────┴──────┴──────┘
3 rows
> ?data(_, _, Z)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "a"  │  100 │
│    2 │ "b"  │  200 │
│    3 │ "c"  │  300 │
└──────┴──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_query_n21t47
Knowledge graph 'test_multi_query_n21t47' dropped.
