Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_multi_query_n21t47
Knowledge graph 'test_multi_query_n21t47' created.
Switched to knowledge graph: test_multi_query_n21t47
> .kg use test_multi_query_n21t47
Switched to knowledge graph: test_multi_query_n21t47
> +data[(1, "a", 100), (2, "b", 200), (3, "c", 300)]
Inserted 3 fact(s) into 'data'.
> ?data(X, _, _)
┌───┬─────┬─────┐
│ X │ _   │ _   │
├───┼─────┼─────┤
│ 1 │ "a" │ 100 │
│ 2 │ "b" │ 200 │
│ 3 │ "c" │ 300 │
└───┴─────┴─────┘
3 rows
> ?data(_, Y, _)
┌───┬─────┬─────┐
│ _ │ Y   │ _   │
├───┼─────┼─────┤
│ 1 │ "a" │ 100 │
│ 2 │ "b" │ 200 │
│ 3 │ "c" │ 300 │
└───┴─────┴─────┘
3 rows
> ?data(_, _, Z)
┌───┬─────┬─────┐
│ _ │ _   │ Z   │
├───┼─────┼─────┤
│ 1 │ "a" │ 100 │
│ 2 │ "b" │ 200 │
│ 3 │ "c" │ 300 │
└───┴─────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_query_n21t47
Knowledge graph 'test_multi_query_n21t47' dropped.
