Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_free_n21t49
Knowledge graph 'test_free_n21t49' created.
Switched to knowledge graph: test_free_n21t49
> .kg use test_free_n21t49
Switched to knowledge graph: test_free_n21t49
> +data[(1, "a", 100), (2, "b", 200), (3, "c", 300)].
Inserted 3 fact(s) into 'data'.
> ?- data(X, Y, Z).
3 rows:
  (1, "a", 100)
  (2, "b", 200)
  (3, "c", 300)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_free_n21t49
Knowledge graph 'test_free_n21t49' dropped.
