Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_derived_n21t50
Knowledge graph 'test_derived_n21t50' created.
Switched to knowledge graph: test_derived_n21t50
> .kg use test_derived_n21t50
Switched to knowledge graph: test_derived_n21t50
> +base[(1, 10), (2, 20), (3, 30)].
Inserted 3 fact(s) into 'base'.
> +doubled(Id, D) :- base(Id, V), D = V * 2.
Rule 'doubled' registered.
> ?- doubled(Id, D).
3 rows:
  (1, 20)
  (2, 40)
  (3, 60)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_derived_n21t50
Knowledge graph 'test_derived_n21t50' dropped.
