Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single
Knowledge graph 'test_single' created.
Switched to knowledge graph: test_single
> .kg use test_single
Switched to knowledge graph: test_single
> +unique_data[(42, "answer")].
Inserted 1 fact(s) into 'unique_data'.
> ?- unique_data(X, Y).
1 rows:
  (42, "answer")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_single
Knowledge graph 'test_single' dropped.
