Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_single_n21t51
Knowledge graph 'test_single_n21t51' created.
Switched to knowledge graph: test_single_n21t51
> .kg use test_single_n21t51
Switched to knowledge graph: test_single_n21t51
> +unique_data[(42, "answer")]
Inserted 1 fact(s) into 'unique_data'.
> ?unique_data(X, Y)
┌────┬──────────┐
│ X  │ Y        │
├────┼──────────┤
│ 42 │ "answer" │
└────┴──────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_single_n21t51
Knowledge graph 'test_single_n21t51' dropped.
