Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_result
Knowledge graph 'test_empty_result' created.
Switched to knowledge graph: test_empty_result
> .kg use test_empty_result
Switched to knowledge graph: test_empty_result
> +data[(1, "a"), (2, "b")].
Inserted 2 fact(s) into 'data'.
> ?- data(999, X).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty_result
Knowledge graph 'test_empty_result' dropped.
