Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_partial_n21t54
Knowledge graph 'test_partial_n21t54' created.
Switched to knowledge graph: test_partial_n21t54
> .kg use test_partial_n21t54
Switched to knowledge graph: test_partial_n21t54
> +data[(1, "a", 100), (2, "a", 200), (3, "b", 100)]
Inserted 3 fact(s) into 'data'.
> ?data(1, Y, Z)
┌───┬─────┬─────┐
│ 1 │ Y   │ Z   │
├───┼─────┼─────┤
│ 1 │ "a" │ 100 │
└───┴─────┴─────┘
1 rows
> ?data(X, "a", Z)
┌───┬─────┬─────┐
│ X │ a   │ Z   │
├───┼─────┼─────┤
│ 1 │ "a" │ 100 │
│ 2 │ "a" │ 200 │
└───┴─────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_partial_n21t54
Knowledge graph 'test_partial_n21t54' dropped.
