Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_computed_proj_n21t55
Knowledge graph 'test_computed_proj_n21t55' created.
Switched to knowledge graph: test_computed_proj_n21t55
> .kg use test_computed_proj_n21t55
Switched to knowledge graph: test_computed_proj_n21t55
> +items[(1, 10, 5), (2, 20, 3)].
Inserted 2 fact(s) into 'items'.
> with_total(Id, Total) :- items(Id, Price, Qty), Total = Price * Qty.
2 rows:
  (1, 50)
  (2, 60)
(session: 1 rule(s))
> ?- with_total(Id, T).
2 rows:
  (1, 50)
  (2, 60)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_computed_proj_n21t55
Knowledge graph 'test_computed_proj_n21t55' dropped.
