Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_clause
Knowledge graph 'test_multi_clause' created.
Switched to knowledge graph: test_multi_clause
> .kg use test_multi_clause
Switched to knowledge graph: test_multi_clause
> +dogs[(1, "Buddy"), (2, "Max")].
Inserted 2 fact(s) into 'dogs'.
> +cats[(3, "Whiskers"), (4, "Luna")].
Inserted 2 fact(s) into 'cats'.
> +pets(Id, Name) :- dogs(Id, Name).
Rule 'pets' registered.
> +pets(Id, Name) :- cats(Id, Name).
Rule 'pets' registered.
> ?- pets(Id, Name).
4 rows:
  (1, "Buddy")
  (2, "Max")
  (3, "Whiskers")
  (4, "Luna")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_clause
Knowledge graph 'test_multi_clause' dropped.
