Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_wildcard_n21t58
Knowledge graph 'test_wildcard_n21t58' created.
Switched to knowledge graph: test_wildcard_n21t58
> .kg use test_wildcard_n21t58
Switched to knowledge graph: test_wildcard_n21t58
> +records[(1, "A", 100, true), (2, "B", 200, false), (3, "C", 150, true)]
Inserted 3 fact(s) into 'records'.
> first_last(First, Last) <- records(First, _, _, Last)
┌──────┬───────┐
│ col0 │ col1  │
├──────┼───────┤
│    1 │ true  │
│    2 │ false │
│    3 │ true  │
└──────┴───────┘
3 rows
(session: 1 rule(s))
> ?first_last(F, L)
┌──────┬───────┐
│ col0 │ col1  │
├──────┼───────┤
│    1 │ true  │
│    2 │ false │
│    3 │ true  │
└──────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_wildcard_n21t58
Knowledge graph 'test_wildcard_n21t58' dropped.
