Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_const_head_n21t59
Knowledge graph 'test_const_head_n21t59' created.
Switched to knowledge graph: test_const_head_n21t59
> .kg use test_const_head_n21t59
Switched to knowledge graph: test_const_head_n21t59
> +items[(1, 100), (2, 200)].
Inserted 2 fact(s) into 'items'.
> with_const(Id, Price, "USD") :- items(Id, Price).
2 rows:
  (1, 100, "USD")
  (2, 200, "USD")
(session: 1 rule(s))
> ?- with_const(Id, P, C).
2 rows:
  (1, 100, "USD")
  (2, 200, "USD")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_const_head_n21t59
Knowledge graph 'test_const_head_n21t59' dropped.
