Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dup_var
Knowledge graph 'test_dup_var' created.
Switched to knowledge graph: test_dup_var
> .kg use test_dup_var
Switched to knowledge graph: test_dup_var
> +pairs[(1, 1), (2, 3), (3, 3), (4, 5)].
Inserted 4 fact(s) into 'pairs'.
> diagonal(X) :- pairs(X, X).
4 rows:
  (1)
  (2)
  (3)
  (4)
(session: 1 rule(s))
> ?- diagonal(X).
4 rows:
  (1)
  (2)
  (3)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_dup_var
Knowledge graph 'test_dup_var' dropped.
