Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_dup_var_n21t60
Knowledge graph 'test_dup_var_n21t60' created.
Switched to knowledge graph: test_dup_var_n21t60
> .kg use test_dup_var_n21t60
Switched to knowledge graph: test_dup_var_n21t60
> +pairs[(1, 1), (2, 3), (3, 3), (4, 5)]
Inserted 4 fact(s) into 'pairs'.
> diagonal(X) <- pairs(X, X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
(session: 1 rule(s))
> ?diagonal(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_dup_var_n21t60
Knowledge graph 'test_dup_var_n21t60' dropped.
