Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_repeat_var
Knowledge graph 'test_repeat_var' created.
Switched to knowledge graph: test_repeat_var
> .kg use test_repeat_var
Switched to knowledge graph: test_repeat_var
> +left[(1, "a"), (2, "b"), (3, "c")].
Inserted 3 fact(s) into 'left'.
> +right[(1, 100), (3, 300), (5, 500)].
Inserted 3 fact(s) into 'right'.
> joined(K, L, R) :- left(K, L), right(K, R).
2 rows:
  (1, 100, "a")
  (3, 300, "c")
(session: 1 rule(s))
> ?- joined(K, L, R).
2 rows:
  (1, 100, "a")
  (3, 300, "c")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_repeat_var
Knowledge graph 'test_repeat_var' dropped.
