Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_repeat_var_n21t61
Knowledge graph 'test_repeat_var_n21t61' created.
Switched to knowledge graph: test_repeat_var_n21t61
> .kg use test_repeat_var_n21t61
Switched to knowledge graph: test_repeat_var_n21t61
> +left[(1, "a"), (2, "b"), (3, "c")]
Inserted 3 fact(s) into 'left'.
> +right[(1, 100), (3, 300), (5, 500)]
Inserted 3 fact(s) into 'right'.
> joined(K, L, R) <- left(K, L), right(K, R)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "a"  │  100 │
│    3 │ "c"  │  300 │
└──────┴──────┴──────┘
2 rows
(session: 1 rule(s))
> ?joined(K, L, R)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "a"  │  100 │
│    3 │ "c"  │  300 │
└──────┴──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_repeat_var_n21t61
Knowledge graph 'test_repeat_var_n21t61' dropped.
