Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rename_col_n21t64
Knowledge graph 'test_rename_col_n21t64' created.
Switched to knowledge graph: test_rename_col_n21t64
> .kg use test_rename_col_n21t64
Switched to knowledge graph: test_rename_col_n21t64
> +source[(1, "Alice", 100)]
Inserted 1 fact(s) into 'source'.
> renamed(UserId, UserName, Balance) <- source(UserId, UserName, Balance)
┌───┬─────────┬─────┐
│ X │ Y       │ Z   │
├───┼─────────┼─────┤
│ 1 │ "Alice" │ 100 │
└───┴─────────┴─────┘
1 rows
(session: 1 rule(s))
> ?renamed(Id, Name, Bal)
┌────┬─────────┬─────┐
│ Id │ Name    │ Bal │
├────┼─────────┼─────┤
│  1 │ "Alice" │ 100 │
└────┴─────────┴─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_rename_col_n21t64
Knowledge graph 'test_rename_col_n21t64' dropped.
