Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rename_col
Knowledge graph 'test_rename_col' created.
Switched to knowledge graph: test_rename_col
> .kg use test_rename_col
Switched to knowledge graph: test_rename_col
> +source[(1, "Alice", 100)].
Inserted 1 fact(s) into 'source'.
> renamed(UserId, UserName, Balance) :- source(UserId, UserName, Balance).
1 rows:
  (1, "Alice", 100)
(session: 1 rule(s))
> ?- renamed(Id, Name, Bal).
1 rows:
  (1, "Alice", 100)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_rename_col
Knowledge graph 'test_rename_col' dropped.
