Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_nested_n21t65
Knowledge graph 'test_nested_n21t65' created.
Switched to knowledge graph: test_nested_n21t65
> .kg use test_nested_n21t65
Switched to knowledge graph: test_nested_n21t65
> +products[(1, "laptop", 999, 50), (2, "phone", 599, 100), (3, "tablet", 399, 75), (4, "watch", 199, 200)]
Inserted 4 fact(s) into 'products'.
> ?products(Id, Name, Price, Stock), Price > 300, Stock > 60
┌──────┬──────────┬──────┬──────┐
│ col0 │ col1     │ col2 │ col3 │
├──────┼──────────┼──────┼──────┤
│    2 │ "phone"  │  599 │  100 │
│    3 │ "tablet" │  399 │   75 │
└──────┴──────────┴──────┴──────┘
2 rows
> ?products(Id, Name, Price, Stock), Price < 300
┌──────┬─────────┬──────┬──────┐
│ col0 │ col1    │ col2 │ col3 │
├──────┼─────────┼──────┼──────┤
│    4 │ "watch" │  199 │  200 │
└──────┴─────────┴──────┴──────┘
1 rows
> ?products(Id, Name, Price, Stock), Stock > 150
┌──────┬─────────┬──────┬──────┐
│ col0 │ col1    │ col2 │ col3 │
├──────┼─────────┼──────┼──────┤
│    4 │ "watch" │  199 │  200 │
└──────┴─────────┴──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_nested_n21t65
Knowledge graph 'test_nested_n21t65' dropped.
