Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dup_col_n21t66
Knowledge graph 'test_dup_col_n21t66' created.
Switched to knowledge graph: test_dup_col_n21t66
> .kg use test_dup_col_n21t66
Switched to knowledge graph: test_dup_col_n21t66
> +data[(1, "a"), (2, "b"), (3, "c")]
Inserted 3 fact(s) into 'data'.
> dup_id(X, X) <- data(X, _)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 2 │ 2 │
│ 3 │ 3 │
└───┴───┘
3 rows
(session: 1 rule(s))
> ?dup_id(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 1 │ 1 │
│ 2 │ 2 │
│ 3 │ 3 │
└───┴───┘
3 rows
> dup_with_val(X, V, X) <- data(X, V)
┌───┬─────┬───┐
│ X │ Y   │ Z │
├───┼─────┼───┤
│ 1 │ "a" │ 1 │
│ 2 │ "b" │ 2 │
│ 3 │ "c" │ 3 │
└───┴─────┴───┘
3 rows
(session: 2 rule(s))
> ?dup_with_val(A, B, C)
┌───┬─────┬───┐
│ A │ B   │ C │
├───┼─────┼───┤
│ 1 │ "a" │ 1 │
│ 2 │ "b" │ 2 │
│ 3 │ "c" │ 3 │
└───┴─────┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_dup_col_n21t66
Knowledge graph 'test_dup_col_n21t66' dropped.
