Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_agg_n21t68
Knowledge graph 'test_multi_agg_n21t68' created.
Switched to knowledge graph: test_multi_agg_n21t68
> .kg use test_multi_agg_n21t68
Switched to knowledge graph: test_multi_agg_n21t68
> +sales[("Electronics", 100), ("Electronics", 200), ("Electronics", 150), ("Clothing", 50), ("Clothing", 75), ("Clothing", 60)].
Inserted 6 fact(s) into 'sales'.
> +stats_sum(Cat, sum<Amt>) :- sales(Cat, Amt).
Rule 'stats_sum' registered.
> +stats_count(Cat, count<Amt>) :- sales(Cat, Amt).
Rule 'stats_count' registered.
> +stats_min(Cat, min<Amt>) :- sales(Cat, Amt).
Rule 'stats_min' registered.
> +stats_max(Cat, max<Amt>) :- sales(Cat, Amt).
Rule 'stats_max' registered.
> ?- stats_sum(Cat, Sum).
2 rows:
  ("Clothing", 185)
  ("Electronics", 450)
> ?- stats_count(Cat, Count).
2 rows:
  ("Clothing", 3)
  ("Electronics", 3)
> ?- stats_min(Cat, Min).
2 rows:
  ("Clothing", 50)
  ("Electronics", 100)
> ?- stats_max(Cat, Max).
2 rows:
  ("Clothing", 75)
  ("Electronics", 200)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_agg_n21t68
Knowledge graph 'test_multi_agg_n21t68' dropped.
