Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_loop_n10t02
Knowledge graph 'test_loop_n10t02' created.
Switched to knowledge graph: test_loop_n10t02
> .kg use test_loop_n10t02
Switched to knowledge graph: test_loop_n10t02
> +edge[(1,1), (1,2), (2,2), (2,3), (3,3)]
Inserted 5 fact(s) into 'edge'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 2 │ 2 │
│ 2 │ 3 │
│ 3 │ 3 │
└───┴───┘
5 rows
> +loop(X, Y) <- edge(X, Y), X = Y
Rule 'loop' registered.
> ?loop(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 2 │ 2 │
│ 3 │ 3 │
└───┴───┘
3 rows
> +tc(X, Y) <- edge(X, Y)
Rule 'tc' registered.
> +tc(X, Z) <- tc(X, Y), edge(Y, Z)
Rule 'tc' registered.
> ?tc(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_loop_n10t02
Knowledge graph 'test_loop_n10t02' dropped.
