
> .db create test_loop
Database 'test_loop' created.
Switched to database: test_loop
> .db use test_loop
Switched to database: test_loop
> +edge[(1,1), (1,2), (2,2), (2,3), (3,3)].
Inserted 5 facts into 'edge'.
> ?- edge(X, Y).
5 rows:
  (1, 1)
  (1, 2)
  (2, 2)
  (2, 3)
  (3, 3)
> loop(X, Y) := edge(X, Y), X = Y.
View 'loop' registered.
> ?- loop(X, Y).
3 rows:
  (1, 1)
  (2, 2)
  (3, 3)
> tc(X, Y) := edge(X, Y).
View 'tc' registered.
> tc(X, Z) := tc(X, Y), edge(Y, Z).
Rule added to view 'tc' (2 rules total).
> ?- tc(1, X).
3 rows:
  (1, 1)
  (1, 2)
  (1, 3)
> .db use default
Switched to database: default
> .db drop test_loop
Database 'test_loop' dropped.
