Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_loop
Knowledge graph 'test_loop' created.
Switched to knowledge graph: test_loop
> .kg use test_loop
Switched to knowledge graph: test_loop
> +edge[(1,1), (1,2), (2,2), (2,3), (3,3)].
Inserted 5 fact(s) into 'edge'.
> ?- edge(X, Y).
5 rows:
  (1, 1)
  (1, 2)
  (2, 2)
  (2, 3)
  (3, 3)
> +loop(X, Y) :- edge(X, Y), X = Y.
Rule 'loop' registered.
> ?- loop(X, Y).
3 rows:
  (1, 1)
  (2, 2)
  (3, 3)
> +tc(X, Y) :- edge(X, Y).
Rule 'tc' registered.
> +tc(X, Z) :- tc(X, Y), edge(Y, Z).
Rule 'tc' registered.
> ?- tc(1, X).
3 rows:
  (1, 1)
  (1, 2)
  (1, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_loop
Knowledge graph 'test_loop' dropped.
