Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dup_n10t03
Knowledge graph 'test_dup_n10t03' created.
Switched to knowledge graph: test_dup_n10t03
> .kg use test_dup_n10t03
Switched to knowledge graph: test_dup_n10t03
> +edge[(1,2)]
Inserted 1 fact(s) into 'edge'.
> +edge[(1,2)]
No facts inserted (1 duplicate skipped).
> +edge[(1,2), (2,3), (2,3)]
Inserted 1 fact(s) into 'edge'.
> ?edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
└──────┴──────┘
2 rows
> +path(X, Z) <- edge(X, Y), edge(Y, Z)
Rule 'path' registered.
> ?path(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
└──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dup_n10t03
Knowledge graph 'test_dup_n10t03' dropped.
