Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dup
Knowledge graph 'test_dup' created.
Switched to knowledge graph: test_dup
> .kg use test_dup
Switched to knowledge graph: test_dup
> +edge[(1,2)].
Inserted 1 fact(s) into 'edge'.
> +edge[(1,2)].
No facts inserted (1 duplicate skipped).
> +edge[(1,2), (2,3), (2,3)].
Inserted 1 fact(s) into 'edge'.
> ?- edge(X, Y).
2 rows:
  (1, 2)
  (2, 3)
> +path(X, Z) :- edge(X, Y), edge(Y, Z).
Rule 'path' registered.
> ?- path(X, Y).
1 rows:
  (1, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dup
Knowledge graph 'test_dup' dropped.
