Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ternary_n10t04
Knowledge graph 'test_ternary_n10t04' created.
Switched to knowledge graph: test_ternary_n10t04
> .kg use test_ternary_n10t04
Switched to knowledge graph: test_ternary_n10t04
> +edge[(1,2), (2,3), (3,1)]
Inserted 3 fact(s) into 'edge'.
> +path2(A, B, C) <- edge(A, B), edge(B, C)
Rule 'path2' registered.
> ?path2(X, Y, Z)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    2 │    3 │
│    2 │    3 │    1 │
│    3 │    1 │    2 │
└──────┴──────┴──────┘
3 rows
> ?path2(1, Y, Z)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    2 │    3 │
└──────┴──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_ternary_n10t04
Knowledge graph 'test_ternary_n10t04' dropped.
