
Executing script: /Users/samuel.picek/InputLayer/FlowLog/course/final-project/examples/datalog/10_edge_cases/04_ternary.dl

> .db create test_ternary
Database 'test_ternary' created.
Switched to database: test_ternary
> .db use test_ternary
Switched to database: test_ternary
> +edge[(1,2), (2,3), (3,1)].
Inserted 3 facts into 'edge'.
> view path2(A: int, B: int, C: int) :- edge(A, B), edge(B, C).
View 'path2' registered.
> ?- path2(X, Y, Z).
3 rows:
  (1, 2, 3)
  (2, 3, 1)
  (3, 1, 2)
> ?- path2(1, Y, Z).
1 rows:
  (1, 2, 3)
> .db use default
Switched to database: default
> .db drop test_ternary
Database 'test_ternary' dropped.

