
Executing script: /Users/samuel.picek/InputLayer/FlowLog/course/final-project/examples/datalog/10_edge_cases/05_same_relation_twice.dl

> .db create test_same_rel
Database 'test_same_rel' created.
Switched to database: test_same_rel
> .db use test_same_rel
Switched to database: test_same_rel
> +knows[(1, 2), (2, 3), (3, 4), (1, 3), (2, 4)].
Inserted 5 facts into 'knows'.
> view mutual(A: int, C: int) :- knows(A, B), knows(B, C).
View 'mutual' registered.
> ?- mutual(X, Y).
3 rows:
  (1, 3)
  (1, 4)
  (2, 4)
> view shared_contact(A: int, B: int, C: int) :- knows(A, B), knows(A, C), B != C.
View 'shared_contact' registered.
> ?- shared_contact(1, X, Y).
2 rows:
  (1, 2, 3)
  (1, 3, 2)
> .db use default
Switched to database: default
> .db drop test_same_rel
Database 'test_same_rel' dropped.

