Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_overlap
Knowledge graph 'test_overlap' created.
Switched to knowledge graph: test_overlap
> .kg use test_overlap
Switched to knowledge graph: test_overlap
> +rel_a[(1, 2), (2, 3), (3, 4), (4, 5)].
Inserted 4 fact(s) into 'rel_a'.
> +rel_b[(2, 3), (3, 4), (5, 6), (6, 7)].
Inserted 4 fact(s) into 'rel_b'.
> +combined(X, Y) :- rel_a(X, Y).
Rule 'combined' registered.
> +combined(X, Y) :- rel_b(X, Y).
Rule 'combined' registered.
> ?- combined(X, Y).
6 rows:
  (1, 2)
  (2, 3)
  (3, 4)
  (4, 5)
  (5, 6)
  (6, 7)
> +intersection(X, Y) :- rel_a(X, Y), rel_b(X, Y).
Rule 'intersection' registered.
> ?- intersection(X, Y).
2 rows:
  (2, 3)
  (3, 4)
> +only_in_a(X, Y) :- rel_a(X, Y), !rel_b(X, Y).
Rule 'only_in_a' registered.
> ?- only_in_a(X, Y).
2 rows:
  (1, 2)
  (4, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_overlap
Knowledge graph 'test_overlap' dropped.
