Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_join
Knowledge graph 'test_self_join' created.
Switched to knowledge graph: test_self_join
> .kg use test_self_join
Switched to knowledge graph: test_self_join
> +edge[(1, 2), (2, 3), (3, 4), (1, 3), (2, 4), (4, 1)].
Inserted 6 fact(s) into 'edge'.
> +two_hop(X, Z) :- edge(X, Y), edge(Y, Z).
Rule 'two_hop' registered.
> ?- two_hop(X, Z).
7 rows:
  (1, 3)
  (1, 4)
  (2, 1)
  (2, 4)
  (3, 1)
  (4, 2)
  (4, 3)
> +self_loop(X) :- edge(X, X).
Rule 'self_loop' registered.
> ?- self_loop(X).
4 rows:
  (1)
  (2)
  (3)
  (4)
> +self_edge[(5, 5), (1, 2)].
Inserted 2 fact(s) into 'self_edge'.
> +actual_self_loop(X) :- self_edge(X, X).
Rule 'actual_self_loop' registered.
> ?- actual_self_loop(X).
2 rows:
  (1)
  (5)
> +triangle(A, B, C) :- edge(A, B), edge(B, C), edge(C, A), A < B, B < C.
Rule 'triangle' registered.
> ?- triangle(A, B, C).
2 rows:
  (4, 1, 2)
  (4, 1, 3)
> +symmetric(A, B) :- edge(A, B), edge(B, A), A < B.
Rule 'symmetric' registered.
> ?- symmetric(A, B).
No results.
> +three_hop(X, W) :- edge(X, Y), edge(Y, Z), edge(Z, W).
Rule 'three_hop' registered.
> ?- three_hop(X, W).
9 rows:
  (1, 1)
  (1, 4)
  (2, 1)
  (2, 2)
  (2, 3)
  (3, 2)
  (3, 3)
  (4, 3)
  (4, 4)
> +hop_count(X, count<Z>) :- two_hop(X, Z).
Rule 'hop_count' registered.
> ?- hop_count(X, C).
4 rows:
  (1, 2)
  (2, 2)
  (3, 1)
  (4, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_self_join
Knowledge graph 'test_self_join' dropped.
