Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_agg_n10t101
Knowledge graph 'test_multi_agg_n10t101' created.
Switched to knowledge graph: test_multi_agg_n10t101
> .kg use test_multi_agg_n10t101
Switched to knowledge graph: test_multi_agg_n10t101
> +values[(10,), (20,), (30,), (40,), (50,)]
Inserted 5 fact(s) into 'values'.
> sum_val(sum<X>) <- values(X)
┌─────┐
│ X   │
├─────┤
│ 150 │
└─────┘
1 rows
(session: 1 rule(s))
> count_val(count<X>) <- values(X)
┌───┐
│ X │
├───┤
│ 5 │
└───┘
1 rows
(session: 2 rule(s))
> min_val(min<X>) <- values(X)
┌────┐
│ X  │
├────┤
│ 10 │
└────┘
1 rows
(session: 3 rule(s))
> max_val(max<X>) <- values(X)
┌────┐
│ X  │
├────┤
│ 50 │
└────┘
1 rows
(session: 4 rule(s))
> avg_val(avg<X>) <- values(X)
┌──────┐
│ X    │
├──────┤
│ 30.0 │
└──────┘
1 rows
(session: 5 rule(s))
> ?sum_val(S)
┌─────┐
│ S   │
├─────┤
│ 150 │
└─────┘
1 rows
> ?count_val(C)
┌───┐
│ C │
├───┤
│ 5 │
└───┘
1 rows
> ?min_val(Mi)
┌────┐
│ Mi │
├────┤
│ 10 │
└────┘
1 rows
> ?max_val(Ma)
┌────┐
│ Ma │
├────┤
│ 50 │
└────┘
1 rows
> ?avg_val(A)
┌──────┐
│ A    │
├──────┤
│ 30.0 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 5 session rule(s), 0 session fact(s))
> .kg drop test_multi_agg_n10t101
Knowledge graph 'test_multi_agg_n10t101' dropped.
