Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_shadow_n10t102
Knowledge graph 'test_shadow_n10t102' created.
Switched to knowledge graph: test_shadow_n10t102
> .kg use test_shadow_n10t102
Switched to knowledge graph: test_shadow_n10t102
> +data[(1,), (2,)]
Inserted 2 fact(s) into 'data'.
> +data(X) <- data(Y), X = Y + 10
Rule 'data' registered.
> ?data(X)
┌────┐
│ X  │
├────┤
│ 11 │
│ 12 │
└────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_shadow_n10t102
Knowledge graph 'test_shadow_n10t102' dropped.
