Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_del_n10t10
Knowledge graph 'test_empty_del_n10t10' created.
Switched to knowledge graph: test_empty_del_n10t10
> .kg use test_empty_del_n10t10
Switched to knowledge graph: test_empty_del_n10t10
> +items[(1), (2), (3), (4), (5)].
Inserted 5 fact(s) into 'items'.
> ?- items(X).
5 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
> +big_items(X) :- items(X), X > 3.
Rule 'big_items' registered.
> ?- big_items(X).
2 rows:
  (4)
  (5)
> -items(X) :- items(X).
Conditional delete: 5 fact(s) deleted from 'items'.
> ?- items(X).
No results.
> ?- big_items(X).
No results.
> +items[(10), (20)].
Inserted 2 fact(s) into 'items'.
> ?- items(X).
2 rows:
  (10)
  (20)
> ?- big_items(X).
2 rows:
  (10)
  (20)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty_del_n10t10
Knowledge graph 'test_empty_del_n10t10' dropped.
