Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_del
Knowledge graph 'test_empty_del' created.
Switched to knowledge graph: test_empty_del
> .kg use test_empty_del
Switched to knowledge graph: test_empty_del
> +items[(1), (2), (3), (4), (5)].
Inserted 5 fact(s) into 'items'.
> ?- items(X).
5 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
> +big_items(X) :- items(X), X > 3.
Rule 'big_items' registered.
> ?- big_items(X).
2 rows:
  (4)
  (5)
> -items(X) :- items(X).
Conditional delete not yet supported over HTTP. Use query API.
> ?- items(X).
5 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
> ?- big_items(X).
2 rows:
  (4)
  (5)
> +items[(10), (20)].
Inserted 2 fact(s) into 'items'.
> ?- items(X).
7 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
  (10)
  (20)
> ?- big_items(X).
4 rows:
  (4)
  (5)
  (10)
  (20)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty_del
Knowledge graph 'test_empty_del' dropped.
