Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_const_query_n10t110
Knowledge graph 'test_const_query_n10t110' created.
Switched to knowledge graph: test_const_query_n10t110
> .kg use test_const_query_n10t110
Switched to knowledge graph: test_const_query_n10t110
> +data[(1, "a"), (2, "b"), (3, "c")]
Inserted 3 fact(s) into 'data'.
> ?data(1, "a")
┌───┬─────┐
│ 1 │ a   │
├───┼─────┤
│ 1 │ "a" │
└───┴─────┘
1 rows
> ?data(99, "z")
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_const_query_n10t110
Knowledge graph 'test_const_query_n10t110' dropped.
