Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_loop
Knowledge graph 'test_self_loop' created.
Switched to knowledge graph: test_self_loop
> .kg use test_self_loop
Switched to knowledge graph: test_self_loop
> +edge[("a", "b"), ("b", "b"), ("c", "c"), ("c", "d")].
Inserted 4 fact(s) into 'edge'.
> self_loop(N) :- edge(N, N).
3 rows:
  ("a")
  ("b")
  ("c")
(session: 1 rule(s))
> normal_edge(A, B) :- edge(A, B), A != B.
2 rows:
  ("a", "b")
  ("c", "d")
(session: 2 rule(s))
> ?- self_loop(N).
3 rows:
  ("a")
  ("b")
  ("c")
> ?- normal_edge(A, B).
2 rows:
  ("a", "b")
  ("c", "d")
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_self_loop
Knowledge graph 'test_self_loop' dropped.
