Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_parallel_n10t116
Knowledge graph 'test_parallel_n10t116' created.
Switched to knowledge graph: test_parallel_n10t116
> .kg use test_parallel_n10t116
Switched to knowledge graph: test_parallel_n10t116
> +multi_edge[("a", "b", 1), ("a", "b", 2), ("a", "b", 3), ("b", "c", 1)]
Inserted 4 fact(s) into 'multi_edge'.
> edge_count(A, B, count<Label>) <- multi_edge(A, B, Label)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│ "a"  │ "b"  │    3 │
│ "b"  │ "c"  │    1 │
└──────┴──────┴──────┘
2 rows
(session: 1 rule(s))
> ?edge_count(A, B, N)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│ "a"  │ "b"  │    3 │
│ "b"  │ "c"  │    1 │
└──────┴──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_parallel_n10t116
Knowledge graph 'test_parallel_n10t116' dropped.
