
Executing script: examples/datalog/10_edge_cases/11_join_one_side_empty.dl

> .db create test_join_empty
Database 'test_join_empty' created.
Switched to database: test_join_empty
> .db use test_join_empty
Switched to database: test_join_empty
> +left[(1), (2), (3)].
Inserted 3 facts into 'left'.
> view joined(X: int, Y: int) :- left(X), right(Y), X = Y.
View 'joined' registered.
> ?- joined(X, Y).
No results.
> view matched(X: int) :- left(X), right(X).
View 'matched' registered.
> ?- matched(X).
No results.
> +right[(2), (4)].
Inserted 2 facts into 'right'.
> ?- joined(X, Y).
1 rows:
  (2, 2)
> ?- matched(X).
1 rows:
  (2)
> -left(X) :- left(X).
No matching tuples to delete.
> ?- joined(X, Y).
1 rows:
  (2, 2)
> ?- matched(X).
1 rows:
  (2)
> .db use default
Switched to database: default
> .db drop test_join_empty
Database 'test_join_empty' dropped.

