Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_join_empty
Knowledge graph 'test_join_empty' created.
Switched to knowledge graph: test_join_empty
> .kg use test_join_empty
Switched to knowledge graph: test_join_empty
> +left[(1), (2), (3)].
Inserted 3 fact(s) into 'left'.
> +joined(X, Y) :- left(X), right(Y), X = Y.
Rule 'joined' registered.
> ?- joined(X, Y).
No results.
> +matched(X) :- left(X), right(X).
Rule 'matched' registered.
> ?- matched(X).
No results.
> +right[(2), (4)].
Inserted 2 fact(s) into 'right'.
> ?- joined(X, Y).
1 rows:
  (2, 2)
> ?- matched(X).
1 rows:
  (2)
> -left(X) :- left(X).
Conditional delete: 3 fact(s) deleted from 'left'.
> ?- joined(X, Y).
No results.
> ?- matched(X).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_join_empty
Knowledge graph 'test_join_empty' dropped.
