Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_agg_n10t120
Knowledge graph 'test_empty_agg_n10t120' created.
Switched to knowledge graph: test_empty_agg_n10t120
> .kg use test_empty_agg_n10t120
Switched to knowledge graph: test_empty_agg_n10t120
> +numbers[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'numbers'.
> big_sum(sum<X>) :- numbers(X), X > 100.
No results.
(session: 1 rule(s))
> ?- big_sum(S).
No results.
> big_count(count<X>) :- numbers(X), X > 100.
No results.
(session: 2 rule(s))
> ?- big_count(C).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_empty_agg_n10t120
Knowledge graph 'test_empty_agg_n10t120' dropped.
