Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_long_str_n10t125
Knowledge graph 'test_long_str_n10t125' created.
Switched to knowledge graph: test_long_str_n10t125
> .kg use test_long_str_n10t125
Switched to knowledge graph: test_long_str_n10t125
> +texts[("short",), ("medium length string here",), ("this is a somewhat longer string that tests handling of moderate length text values",)]
Inserted 3 fact(s) into 'texts'.
> ?texts(T)
┌──────────────────────────────────────────┐
│ T                                        │
├──────────────────────────────────────────┤
│ "medium length string here"              │
│ "short"                                  │
│ "this is a somewhat longer string that … │
└──────────────────────────────────────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_long_str_n10t125
Knowledge graph 'test_long_str_n10t125' dropped.
