Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_whitespace_n10t128
Knowledge graph 'test_whitespace_n10t128' created.
Switched to knowledge graph: test_whitespace_n10t128
> .kg use test_whitespace_n10t128
Switched to knowledge graph: test_whitespace_n10t128
> +text[("  leading",), ("trailing  ",), ("  both  ",), ("no spaces",)].
Inserted 4 fact(s) into 'text'.
> ?- text(T).
4 rows:
  ("  both  ")
  ("  leading")
  ("no spaces")
  ("trailing  ")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_whitespace_n10t128
Knowledge graph 'test_whitespace_n10t128' dropped.
