Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_whitespace
Knowledge graph 'test_whitespace' created.
Switched to knowledge graph: test_whitespace
> .kg use test_whitespace
Switched to knowledge graph: test_whitespace
> +text[("  leading",), ("trailing  ",), ("  both  ",), ("no spaces",)].
Inserted 4 fact(s) into 'text'.
> ?- text(T).
4 rows:
  ("  both  ")
  ("  leading")
  ("no spaces")
  ("trailing  ")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_whitespace
Knowledge graph 'test_whitespace' dropped.
