Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_special_n10t129
Knowledge graph 'test_special_n10t129' created.
Switched to knowledge graph: test_special_n10t129
> .kg use test_special_n10t129
Switched to knowledge graph: test_special_n10t129
> +text[("hello@world.com",), ("path/to/file",), ("a+b=c",), ("100%",)]
Inserted 4 fact(s) into 'text'.
> ?text(T)
┌───────────────────┐
│ T                 │
├───────────────────┤
│ "100%"            │
│ "a+b=c"           │
│ "hello@world.com" │
│ "path/to/file"    │
└───────────────────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_special_n10t129
Knowledge graph 'test_special_n10t129' dropped.
