Executing script: examples/datalog/10_edge_cases/12_view_evaluates_empty.dl

> .db create test_view_empty
Database 'test_view_empty' created.
Switched to database: test_view_empty
> .db use test_view_empty
Switched to database: test_view_empty
> +numbers[(1), (2), (3), (4), (5)].
Inserted 5 facts into 'numbers'.
> +impossible(X) :- numbers(X), X > 100.
Rule 'impossible' registered.
> ?- impossible(X).
No results.
> +uses_impossible(X) :- impossible(X).
Rule 'uses_impossible' registered.
> ?- uses_impossible(X).
No results.
> +contradictory(X) :- numbers(X), X > 3, X < 2.
Rule 'contradictory' registered.
> ?- contradictory(X).
No results.
> +threshold(X) :- numbers(X), X > 10.
Rule 'threshold' registered.
> ?- threshold(X).
No results.
> +numbers[(15), (20)].
Inserted 2 facts into 'numbers'.
> ?- threshold(X).
2 rows:
  (15)
  (20)
> .db use default
Switched to database: default
> .db drop test_view_empty
Database 'test_view_empty' dropped.
