Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_view_empty_n10t12
Knowledge graph 'test_view_empty_n10t12' created.
Switched to knowledge graph: test_view_empty_n10t12
> .kg use test_view_empty_n10t12
Switched to knowledge graph: test_view_empty_n10t12
> +numbers[(1), (2), (3), (4), (5)].
Inserted 5 fact(s) into 'numbers'.
> +impossible(X) :- numbers(X), X > 100.
Rule 'impossible' registered.
> ?- impossible(X).
No results.
> +uses_impossible(X) :- impossible(X).
Rule 'uses_impossible' registered.
> ?- uses_impossible(X).
No results.
> +contradictory(X) :- numbers(X), X > 3, X < 2.
Rule 'contradictory' registered.
> ?- contradictory(X).
No results.
> +threshold(X) :- numbers(X), X > 10.
Rule 'threshold' registered.
> ?- threshold(X).
No results.
> +numbers[(15), (20)].
Inserted 2 fact(s) into 'numbers'.
> ?- threshold(X).
2 rows:
  (15)
  (20)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_view_empty_n10t12
Knowledge graph 'test_view_empty_n10t12' dropped.
