Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_empty_str_n10t130
Knowledge graph 'test_empty_str_n10t130' created.
Switched to knowledge graph: test_empty_str_n10t130
> .kg use test_empty_str_n10t130
Switched to knowledge graph: test_empty_str_n10t130
> +data[(1, "value"), (2, ""), (3, "another")]
Inserted 3 fact(s) into 'data'.
> ?data(Id, V)
┌────┬───────────┐
│ Id │ V         │
├────┼───────────┤
│  1 │ "value"   │
│  2 │ ""        │
│  3 │ "another" │
└────┴───────────┘
3 rows
> non_empty(Id, V) <- data(Id, V), V != ""
┌───┬───────────┐
│ X │ Y         │
├───┼───────────┤
│ 1 │ "value"   │
│ 3 │ "another" │
└───┴───────────┘
2 rows
(session: 1 rule(s))
> ?non_empty(Id, V)
┌────┬───────────┐
│ Id │ V         │
├────┼───────────┤
│  1 │ "value"   │
│  3 │ "another" │
└────┴───────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_empty_str_n10t130
Knowledge graph 'test_empty_str_n10t130' dropped.
