Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_char_n10t131
Knowledge graph 'test_single_char_n10t131' created.
Switched to knowledge graph: test_single_char_n10t131
> .kg use test_single_char_n10t131
Switched to knowledge graph: test_single_char_n10t131
> +chars[("a",), ("b",), ("1",), ("@",)]
Inserted 4 fact(s) into 'chars'.
> ?chars(C)
┌──────┐
│ col0 │
├──────┤
│ "1"  │
│ "@"  │
│ "a"  │
│ "b"  │
└──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_single_char_n10t131
Knowledge graph 'test_single_char_n10t131' dropped.
