Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_num_str_n10t132
Knowledge graph 'test_num_str_n10t132' created.
Switched to knowledge graph: test_num_str_n10t132
> .kg use test_num_str_n10t132
Switched to knowledge graph: test_num_str_n10t132
> +str_data[("123",), ("456",)]
Inserted 2 fact(s) into 'str_data'.
> +int_data[(123,), (456,)]
Inserted 2 fact(s) into 'int_data'.
> ?str_data(S)
┌───────┐
│ col0  │
├───────┤
│ "123" │
│ "456" │
└───────┘
2 rows
> ?int_data(I)
┌──────┐
│ col0 │
├──────┤
│  123 │
│  456 │
└──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_num_str_n10t132
Knowledge graph 'test_num_str_n10t132' dropped.
