Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_case
Knowledge graph 'test_case' created.
Switched to knowledge graph: test_case
> .kg use test_case
Switched to knowledge graph: test_case
> +words[("Hello",), ("hello",), ("HELLO",)].
Inserted 3 fact(s) into 'words'.
> ?- words(W).
3 rows:
  ("HELLO")
  ("Hello")
  ("hello")
> lower(W) :- words(W), W = "hello".
1 rows:
  ("hello")
(session: 1 rule(s))
> ?- lower(W).
1 rows:
  ("hello")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_case
Knowledge graph 'test_case' dropped.
