Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_case_n10t133
Knowledge graph 'test_case_n10t133' created.
Switched to knowledge graph: test_case_n10t133
> .kg use test_case_n10t133
Switched to knowledge graph: test_case_n10t133
> +words[("Hello",), ("hello",), ("HELLO",)]
Inserted 3 fact(s) into 'words'.
> ?words(W)
┌─────────┐
│ W       │
├─────────┤
│ "HELLO" │
│ "Hello" │
│ "hello" │
└─────────┘
3 rows
> lower(W) <- words(W), W = "hello"
┌─────────┐
│ X       │
├─────────┤
│ "hello" │
└─────────┘
1 rows
(session: 1 rule(s))
> ?lower(W)
┌─────────┐
│ W       │
├─────────┤
│ "hello" │
└─────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_case_n10t133
Knowledge graph 'test_case_n10t133' dropped.
