Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_boundary
Knowledge graph 'test_boundary' created.
Switched to knowledge graph: test_boundary
> .kg use test_boundary
Switched to knowledge graph: test_boundary
> +nums[(0,), (1,), (-1,), (2147483647,), (-2147483648,)].
Inserted 5 fact(s) into 'nums'.
> ?- nums(N).
5 rows:
  (-2147483648)
  (-1)
  (0)
  (1)
  (2147483647)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_boundary
Knowledge graph 'test_boundary' dropped.
