Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_boundary_n10t134
Knowledge graph 'test_boundary_n10t134' created.
Switched to knowledge graph: test_boundary_n10t134
> .kg use test_boundary_n10t134
Switched to knowledge graph: test_boundary_n10t134
> +nums[(0,), (1,), (-1,), (2147483647,), (-2147483648,)]
Inserted 5 fact(s) into 'nums'.
> ?nums(N)
┌─────────────┐
│ col0        │
├─────────────┤
│ -2147483648 │
│          -1 │
│           0 │
│           1 │
│  2147483647 │
└─────────────┘
5 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_boundary_n10t134
Knowledge graph 'test_boundary_n10t134' dropped.
