Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multiline_n10t135
Knowledge graph 'test_multiline_n10t135' created.
Switched to knowledge graph: test_multiline_n10t135
> .kg use test_multiline_n10t135
Switched to knowledge graph: test_multiline_n10t135
> +text[("This is a longer text string that spans multiple words",)]
Inserted 1 fact(s) into 'text'.
> ?text(T)
┌──────────────────────────────────────────┐
│ col0                                     │
├──────────────────────────────────────────┤
│ "This is a longer text string that span… │
└──────────────────────────────────────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multiline_n10t135
Knowledge graph 'test_multiline_n10t135' dropped.
