Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multiline
Knowledge graph 'test_multiline' created.
Switched to knowledge graph: test_multiline
> .kg use test_multiline
Switched to knowledge graph: test_multiline
> +text[("This is a longer text string that spans multiple words",)].
Inserted 1 fact(s) into 'text'.
> ?- text(T).
1 rows:
  ("This is a longer text string that spans multiple words")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multiline
Knowledge graph 'test_multiline' dropped.
