Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_max_arity_n10t136
Knowledge graph 'test_max_arity_n10t136' created.
Switched to knowledge graph: test_max_arity_n10t136
> .kg use test_max_arity_n10t136
Switched to knowledge graph: test_max_arity_n10t136
> +wide[(1, 2, 3, 4, 5, 6, 7, 8)]
Inserted 1 fact(s) into 'wide'.
> ?wide(A, B, C, D, E, F, G, H)
┌───┬───┬───┬───┬───┬───┬───┬───┐
│ A │ B │ C │ D │ E │ F │ G │ H │
├───┼───┼───┼───┼───┼───┼───┼───┤
│ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │ 7 │ 8 │
└───┴───┴───┴───┴───┴───┴───┴───┘
1 rows
> subset(A, D, H) <- wide(A, _, _, D, _, _, _, H)
┌───┬───┬───┐
│ X │ Y │ Z │
├───┼───┼───┤
│ 1 │ 4 │ 8 │
└───┴───┴───┘
1 rows
(session: 1 rule(s))
> ?subset(A, D, H)
┌───┬───┬───┐
│ A │ D │ H │
├───┼───┼───┤
│ 1 │ 4 │ 8 │
└───┴───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_max_arity_n10t136
Knowledge graph 'test_max_arity_n10t136' dropped.
