Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_max_arity
Knowledge graph 'test_max_arity' created.
Switched to knowledge graph: test_max_arity
> .kg use test_max_arity
Switched to knowledge graph: test_max_arity
> +wide[(1, 2, 3, 4, 5, 6, 7, 8)].
Inserted 1 fact(s) into 'wide'.
> ?- wide(A, B, C, D, E, F, G, H).
1 rows:
  (1, 2, 3, 4, 5, 6, 7, 8)
> subset(A, D, H) :- wide(A, _, _, D, _, _, _, H).
1 rows:
  (1, 4, 8)
(session: 1 rule(s))
> ?- subset(A, D, H).
1 rows:
  (1, 4, 8)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_max_arity
Knowledge graph 'test_max_arity' dropped.
