Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_tuple_n10t137
Knowledge graph 'test_single_tuple_n10t137' created.
Switched to knowledge graph: test_single_tuple_n10t137
> .kg use test_single_tuple_n10t137
Switched to knowledge graph: test_single_tuple_n10t137
> +singleton[(42, "answer", true)].
Inserted 1 fact(s) into 'singleton'.
> ?- singleton(A, B, C).
1 rows:
  (42, "answer", "true")
> +single_sum(sum<A>) :- singleton(A, _, _).
Rule 'single_sum' registered.
> ?- single_sum(S).
1 rows:
  (42)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_single_tuple_n10t137
Knowledge graph 'test_single_tuple_n10t137' dropped.
