Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_safe_div_n10t139
Knowledge graph 'test_safe_div_n10t139' created.
Switched to knowledge graph: test_safe_div_n10t139
> .kg use test_safe_div_n10t139
Switched to knowledge graph: test_safe_div_n10t139
> +data[(10, 2), (20, 5), (30, 0), (40, 4)]
Inserted 4 fact(s) into 'data'.
> safe_div(A, B, R) <- data(A, B), B != 0, R = A / B
┌────┬───┬──────┐
│ X  │ Y │ Z    │
├────┼───┼──────┤
│ 10 │ 2 │  5.0 │
│ 20 │ 5 │  4.0 │
│ 40 │ 4 │ 10.0 │
└────┴───┴──────┘
3 rows
(session: 1 rule(s))
> ?safe_div(A, B, R)
┌────┬───┬──────┐
│ A  │ B │ R    │
├────┼───┼──────┤
│ 10 │ 2 │  5.0 │
│ 20 │ 5 │  4.0 │
│ 40 │ 4 │ 10.0 │
└────┴───┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_safe_div_n10t139
Knowledge graph 'test_safe_div_n10t139' dropped.
