Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create comments_test_n10t13
Knowledge graph 'comments_test_n10t13' created.
Switched to knowledge graph: comments_test_n10t13
> .kg use comments_test_n10t13
Switched to knowledge graph: comments_test_n10t13
> +edge(1, 2).
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3).
Inserted 1 fact(s) into 'edge'.
> +edge(3, 4).
Inserted 1 fact(s) into 'edge'.
> +edge(4, 5).
Inserted 1 fact(s) into 'edge'.
> ?- edge(X, Y).
4 rows:
  (1, 2)
  (2, 3)
  (3, 4)
  (4, 5)
> +path(X, Y) :- edge(X, Y).
Rule 'path' registered.
> +path(X, Z) :- path(X, Y), edge(Y, Z).
Rule 'path' registered.
> ?- path(1, X).
4 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
> +data(100, 200).
Inserted 1 fact(s) into 'data'.
> +data(101, 201).
Inserted 1 fact(s) into 'data'.
> ?- data(X, Y).
2 rows:
  (100, 200)
  (101, 201)
> .kg use default
Switched to knowledge graph: default
> .kg drop comments_test_n10t13
Knowledge graph 'comments_test_n10t13' dropped.
