Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_ws_n10t142
Knowledge graph 'test_ws_n10t142' created.
Switched to knowledge graph: test_ws_n10t142
> .kg use test_ws_n10t142
Switched to knowledge graph: test_ws_n10t142
> +data[(1, "a"), (2, "b"), (3, "c")]
Inserted 3 fact(s) into 'data'.
> ?data(  X  ,  Y  )
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ "a" │
│ 2 │ "b" │
│ 3 │ "c" │
└───┴─────┘
3 rows
> +long_rule(X, Y) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> data(X, Y),
Parse error: Expected parentheses: (X, Y),
> X > 1
Parse error: Unrecognized statement: X > 1
> ?long_rule(X, Y)
No results.
> +more[(10,), (20,)]
Inserted 2 fact(s) into 'more'.
> ?more(X)
┌────┐
│ X  │
├────┤
│ 10 │
│ 20 │
└────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_ws_n10t142
Knowledge graph 'test_ws_n10t142' dropped.
