Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_wildcards_n10t14
Knowledge graph 'test_wildcards_n10t14' created.
Switched to knowledge graph: test_wildcards_n10t14
> .kg use test_wildcards_n10t14
Switched to knowledge graph: test_wildcards_n10t14
> +data[(1, "a", 100), (2, "b", 200), (3, "c", 100)].
Inserted 3 fact(s) into 'data'.
> exists_with_value(Val) :- data(_, _, Val).
2 rows:
  (100)
  (200)
(session: 1 rule(s))
> ?- exists_with_value(Val).
2 rows:
  (100)
  (200)
> has_name(Name) :- data(_, Name, _).
3 rows:
  ("a")
  ("b")
  ("c")
(session: 2 rule(s))
> ?- has_name(Name).
3 rows:
  ("a")
  ("b")
  ("c")
> has_any_data() :- data(_, _, _).
1 rows:
  ()
(session: 3 rule(s))
> ?- has_any_data().
1 rows:
  ()
> count_distinct_values(Val) :- data(_, _, Val), data(_, _, Val).
2 rows:
  (100)
  (200)
(session: 4 rule(s))
> ?- count_distinct_values(Val).
2 rows:
  (100)
  (200)
> +other[(100, "x"), (200, "y"), (300, "z")].
Inserted 3 fact(s) into 'other'.
> joined(Name, Label) :- data(_, Name, Val), other(Val, Label).
3 rows:
  ("a", "x")
  ("b", "y")
  ("c", "x")
(session: 5 rule(s))
> ?- joined(Name, Label).
3 rows:
  ("a", "x")
  ("b", "y")
  ("c", "x")
> .kg use default
Switched to knowledge graph: default
(Cleared 5 session rule(s), 0 session fact(s))
> .kg drop test_wildcards_n10t14
Knowledge graph 'test_wildcards_n10t14' dropped.
