Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_ops_n10t15
Knowledge graph 'test_rel_ops_n10t15' created.
Switched to knowledge graph: test_rel_ops_n10t15
> .kg use test_rel_ops_n10t15
Switched to knowledge graph: test_rel_ops_n10t15
> +data[(1, 100), (2, 200), (3, 300)].
Inserted 3 fact(s) into 'data'.
> ?- data(X, Y).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> -data[(2, 200)].
Deleted 1 facts from 'data'.
> ?- data(X, Y).
2 rows:
  (1, 100)
  (3, 300)
> +data[(2, 200), (4, 400)].
Inserted 2 fact(s) into 'data'.
> ?- data(X, Y).
4 rows:
  (1, 100)
  (2, 200)
  (3, 300)
  (4, 400)
> -data[(1, 100), (4, 400)].
Deleted 2 facts from 'data'.
> ?- data(X, Y).
2 rows:
  (2, 200)
  (3, 300)
> +data[(2, 200)].
No facts inserted (1 duplicate skipped).
> ?- data(X, Y).
2 rows:
  (2, 200)
  (3, 300)
> -data[(2, 200), (3, 300)].
Deleted 2 facts from 'data'.
> ?- data(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_ops_n10t15
Knowledge graph 'test_rel_ops_n10t15' dropped.
