Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_unary_n10t16
Knowledge graph 'test_unary_n10t16' created.
Switched to knowledge graph: test_unary_n10t16
> .kg use test_unary_n10t16
Switched to knowledge graph: test_unary_n10t16
> +ids[(1,), (2,), (3,), (42,), (100,)]
Inserted 5 fact(s) into 'ids'.
> ?ids(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    3 │
│   42 │
│  100 │
└──────┘
5 rows
> ?ids(X), X > 10
┌──────┐
│ col0 │
├──────┤
│   42 │
│  100 │
└──────┘
2 rows
> +scores[(1, 100), (2, 200), (3, 300)]
Inserted 3 fact(s) into 'scores'.
