Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_unary
Knowledge graph 'test_unary' created.
Switched to knowledge graph: test_unary
> .kg use test_unary
Switched to knowledge graph: test_unary
> +ids[(1,), (2,), (3,), (42,), (100,)].
Inserted 5 fact(s) into 'ids'.
> ?- ids(X).
5 rows:
  (1)
  (2)
  (3)
  (42)
  (100)
> ?- ids(X), X > 10.
2 rows:
  (42)
  (100)
> +scores[(1, 100), (2, 200), (3, 300)].
Inserted 3 fact(s) into 'scores'.
> combined(X, S) :- ids(X), scores(X, S).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
(session: 1 rule(s))
> ?- combined(X, S).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_unary
Knowledge graph 'test_unary' dropped.
