Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_row_n10t17
Knowledge graph 'test_single_row_n10t17' created.
Switched to knowledge graph: test_single_row_n10t17
> .kg use test_single_row_n10t17
Switched to knowledge graph: test_single_row_n10t17
> +singleton(42, "only_one")
Inserted 1 fact(s) into 'singleton'.
> ?singleton(X, Y)
┌──────┬────────────┐
│ col0 │ col1       │
├──────┼────────────┤
│   42 │ "only_one" │
└──────┴────────────┘
1 rows
> +numbers[(1,), (2,), (3,), (4,), (5,)]
Inserted 5 fact(s) into 'numbers'.
> ?numbers(X), X = 3
┌──────┐
│ col0 │
├──────┤
│    3 │
└──────┘
1 rows
