Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_wide20_n10t18
Knowledge graph 'test_wide20_n10t18' created.
Switched to knowledge graph: test_wide20_n10t18
> .kg use test_wide20_n10t18
Switched to knowledge graph: test_wide20_n10t18
> +wide20(1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
Inserted 1 fact(s) into 'wide20'.
> +wide20(21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40)
Inserted 1 fact(s) into 'wide20'.
> ?wide20(A, B, C, D, E, F, G, H, I, J, K, L, M, N, O, P, Q, R, S, T)
┌────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┬────┐
│ A  │ B  │ C  │ D  │ E  │ F  │ G  │ H  │ I  │ J  │ K  │ L  │ M  │ N  │ O  │ P  │ Q  │ R  │ S  │ T  │
├────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┼────┤
│  1 │  2 │  3 │  4 │  5 │  6 │  7 │  8 │  9 │ 10 │ 11 │ 12 │ 13 │ 14 │ 15 │ 16 │ 17 │ 18 │ 19 │ 20 │
│ 21 │ 22 │ 23 │ 24 │ 25 │ 26 │ 27 │ 28 │ 29 │ 30 │ 31 │ 32 │ 33 │ 34 │ 35 │ 36 │ 37 │ 38 │ 39 │ 40 │
└────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┴────┘
2 rows
> first_last(A, T) <- wide20(A, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, _, T)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  1 │ 20 │
│ 21 │ 40 │
└────┴────┘
2 rows
(session: 1 rule(s))
> ?first_last(X, Y)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  1 │ 20 │
│ 21 │ 40 │
└────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_wide20_n10t18
Knowledge graph 'test_wide20_n10t18' dropped.
