Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_const_query_n10t21
Knowledge graph 'test_const_query_n10t21' created.
Switched to knowledge graph: test_const_query_n10t21
> .kg use test_const_query_n10t21
Switched to knowledge graph: test_const_query_n10t21
> +facts[(1, 2), (3, 4), (5, 6)]
Inserted 3 fact(s) into 'facts'.
> ?facts(1, 2)
┌───┬───┐
│ 1 │ 2 │
├───┼───┤
│ 1 │ 2 │
└───┴───┘
1 rows
> ?facts(1, 3)
No results.
> ?facts(3, 4)
┌───┬───┐
│ 3 │ 4 │
├───┼───┤
│ 3 │ 4 │
└───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_const_query_n10t21
Knowledge graph 'test_const_query_n10t21' dropped.
