Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_large_tuple_n10t24
Knowledge graph 'test_large_tuple_n10t24' created.
Switched to knowledge graph: test_large_tuple_n10t24
> .kg use test_large_tuple_n10t24
Switched to knowledge graph: test_large_tuple_n10t24
> +wide[(1, 2, 3, 4, 5, 6, 7, 8)]
Inserted 1 fact(s) into 'wide'.
> ?wide(A, B, C, D, E, F, G, H)
┌───┬───┬───┬───┬───┬───┬───┬───┐
│ A │ B │ C │ D │ E │ F │ G │ H │
├───┼───┼───┼───┼───┼───┼───┼───┤
│ 1 │ 2 │ 3 │ 4 │ 5 │ 6 │ 7 │ 8 │
└───┴───┴───┴───┴───┴───┴───┴───┘
1 rows
> self_join(A, B, C) <- wide(A, B, C, _, _, _, _, _), wide(A, _, _, D, E, F, G, H)
┌───┬───┬───┐
│ X │ Y │ Z │
├───┼───┼───┤
│ 1 │ 2 │ 3 │
└───┴───┴───┘
1 rows
(session: 1 rule(s))
> ?self_join(A, B, C)
┌───┬───┬───┐
│ A │ B │ C │
├───┼───┼───┤
│ 1 │ 2 │ 3 │
└───┴───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_large_tuple_n10t24
Knowledge graph 'test_large_tuple_n10t24' dropped.
