Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_wildcards_n10t26
Knowledge graph 'test_wildcards_n10t26' created.
Switched to knowledge graph: test_wildcards_n10t26
> .kg use test_wildcards_n10t26
Switched to knowledge graph: test_wildcards_n10t26
> +wide[(1, 2, 3, 4, 5, 6)]
Inserted 1 fact(s) into 'wide'.
> +wide[(10, 20, 30, 40, 50, 60)]
Inserted 1 fact(s) into 'wide'.
> ends(First, Last) <- wide(First, _, _, _, _, Last)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  1 │  6 │
│ 10 │ 60 │
└────┴────┘
2 rows
(session: 1 rule(s))
> ?ends(First, Last)
┌───────┬──────┐
│ First │ Last │
├───────┼──────┤
│     1 │    6 │
│    10 │   60 │
└───────┴──────┘
2 rows
> middle(C, D) <- wide(_, _, C, D, _, _)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  3 │  4 │
│ 30 │ 40 │
└────┴────┘
2 rows
(session: 2 rule(s))
> ?middle(C, D)
┌────┬────┐
│ C  │ D  │
├────┼────┤
│  3 │  4 │
│ 30 │ 40 │
└────┴────┘
2 rows
> alternate(A, C, E) <- wide(A, _, C, _, E, _)
┌────┬────┬────┐
│ X  │ Y  │ Z  │
├────┼────┼────┤
│  1 │  3 │  5 │
│ 10 │ 30 │ 50 │
└────┴────┴────┘
2 rows
(session: 3 rule(s))
> ?alternate(A, C, E)
┌────┬────┬────┐
│ A  │ C  │ E  │
├────┼────┼────┤
│  1 │  3 │  5 │
│ 10 │ 30 │ 50 │
└────┴────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_wildcards_n10t26
Knowledge graph 'test_wildcards_n10t26' dropped.
