Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_ref
Knowledge graph 'test_self_ref' created.
Switched to knowledge graph: test_self_ref
> .kg use test_self_ref
Switched to knowledge graph: test_self_ref
> +edges[(1, 2), (2, 3), (3, 3), (4, 4)].
Inserted 4 fact(s) into 'edges'.
> self_loop(X) :- edges(X, X).
4 rows:
  (1)
  (2)
  (3)
  (4)
(session: 1 rule(s))
> ?- self_loop(X).
4 rows:
  (1)
  (2)
  (3)
  (4)
> non_self(X, Y) :- edges(X, Y), X != Y.
2 rows:
  (1, 2)
  (2, 3)
(session: 2 rule(s))
> ?- non_self(X, Y).
2 rows:
  (1, 2)
  (2, 3)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_self_ref
Knowledge graph 'test_self_ref' dropped.
