Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_anti_n10t29
Knowledge graph 'test_anti_n10t29' created.
Switched to knowledge graph: test_anti_n10t29
> .kg use test_anti_n10t29
Switched to knowledge graph: test_anti_n10t29
> +all_items[(1, "a"), (2, "b"), (3, "c"), (4, "d"), (5, "e")].
Inserted 5 fact(s) into 'all_items'.
> +selected[(2), (4)].
Inserted 2 fact(s) into 'selected'.
> anti_join(Id, Val) :- all_items(Id, Val), !selected(Id).
3 rows:
  (1, "a")
  (3, "c")
  (5, "e")
(session: 1 rule(s))
> ?- anti_join(Id, Val).
3 rows:
  (1, "a")
  (3, "c")
  (5, "e")
> semi_join(Id, Val) :- all_items(Id, Val), selected(Id).
2 rows:
  (2, "b")
  (4, "d")
(session: 2 rule(s))
> ?- semi_join(Id, Val).
2 rows:
  (2, "b")
  (4, "d")
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_anti_n10t29
Knowledge graph 'test_anti_n10t29' dropped.
