Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_exists_n10t30
Knowledge graph 'test_exists_n10t30' created.
Switched to knowledge graph: test_exists_n10t30
> .kg use test_exists_n10t30
Switched to knowledge graph: test_exists_n10t30
> +customers[(1, "Alice"), (2, "Bob"), (3, "Carol")]
Inserted 3 fact(s) into 'customers'.
> +orders[(1, 100), (1, 200), (3, 150)]
Inserted 3 fact(s) into 'orders'.
> has_orders(Name) <- customers(Id, Name), orders(Id, _)
┌─────────┐
│ X       │
├─────────┤
│ "Alice" │
│ "Carol" │
└─────────┘
2 rows
(session: 1 rule(s))
> ?has_orders(Name)
┌─────────┐
│ Name    │
├─────────┤
│ "Alice" │
│ "Carol" │
└─────────┘
2 rows
> no_orders(Name) <- customers(Id, Name), !orders(Id, _)
┌───────┐
│ X     │
├───────┤
│ "Bob" │
└───────┘
1 rows
(session: 2 rule(s))
> ?no_orders(Name)
┌───────┐
│ Name  │
├───────┤
│ "Bob" │
└───────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_exists_n10t30
Knowledge graph 'test_exists_n10t30' dropped.
