Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_negative_n10t34
Knowledge graph 'test_negative_n10t34' created.
Switched to knowledge graph: test_negative_n10t34
> .kg use test_negative_n10t34
Switched to knowledge graph: test_negative_n10t34
> +data[(-5, 10), (5, -10), (-5, -10), (5, 10)].
Inserted 4 fact(s) into 'data'.
> sums(X, Y, S) :- data(X, Y), S = X + Y.
4 rows:
  (-5, -10, -15)
  (-5, 10, 5)
  (5, -10, -5)
  (5, 10, 15)
(session: 1 rule(s))
> ?- sums(X, Y, S).
4 rows:
  (-5, -10, -15)
  (-5, 10, 5)
  (5, -10, -5)
  (5, 10, 15)
> products(X, Y, P) :- data(X, Y), P = X * Y.
4 rows:
  (-5, -10, 50)
  (-5, 10, -50)
  (5, -10, -50)
  (5, 10, 50)
(session: 2 rule(s))
> ?- products(X, Y, P).
4 rows:
  (-5, -10, 50)
  (-5, 10, -50)
  (5, -10, -50)
  (5, 10, 50)
> has_negative(X, Y) :- data(X, Y), X < 0.
2 rows:
  (-5, -10)
  (-5, 10)
(session: 3 rule(s))
> has_negative(X, Y) :- data(X, Y), Y < 0.
3 rows:
  (-5, -10)
  (-5, 10)
  (5, -10)
(session: 4 rule(s))
> ?- has_negative(X, Y).
3 rows:
  (-5, -10)
  (-5, 10)
  (5, -10)
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_negative_n10t34
Knowledge graph 'test_negative_n10t34' dropped.
