Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_negative_n10t34
Knowledge graph 'test_negative_n10t34' created.
Switched to knowledge graph: test_negative_n10t34
> .kg use test_negative_n10t34
Switched to knowledge graph: test_negative_n10t34
> +data[(-5, 10), (5, -10), (-5, -10), (5, 10)]
Inserted 4 fact(s) into 'data'.
> sums(X, Y, S) <- data(X, Y), S = X + Y
┌────┬─────┬─────┐
│ X  │ Y   │ Z   │
├────┼─────┼─────┤
│ -5 │ -10 │ -15 │
│ -5 │  10 │   5 │
│  5 │ -10 │  -5 │
│  5 │  10 │  15 │
└────┴─────┴─────┘
4 rows
(session: 1 rule(s))
> ?sums(X, Y, S)
┌────┬─────┬─────┐
│ X  │ Y   │ S   │
├────┼─────┼─────┤
│ -5 │ -10 │ -15 │
│ -5 │  10 │   5 │
│  5 │ -10 │  -5 │
│  5 │  10 │  15 │
└────┴─────┴─────┘
4 rows
> products(X, Y, P) <- data(X, Y), P = X * Y
┌────┬─────┬─────┐
│ X  │ Y   │ Z   │
├────┼─────┼─────┤
│ -5 │ -10 │  50 │
│ -5 │  10 │ -50 │
│  5 │ -10 │ -50 │
│  5 │  10 │  50 │
└────┴─────┴─────┘
4 rows
(session: 2 rule(s))
> ?products(X, Y, P)
┌────┬─────┬─────┐
│ X  │ Y   │ P   │
├────┼─────┼─────┤
│ -5 │ -10 │  50 │
│ -5 │  10 │ -50 │
│  5 │ -10 │ -50 │
│  5 │  10 │  50 │
└────┴─────┴─────┘
4 rows
> has_negative(X, Y) <- data(X, Y), X < 0
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│ -5 │ -10 │
│ -5 │  10 │
└────┴─────┘
2 rows
(session: 3 rule(s))
> has_negative(X, Y) <- data(X, Y), Y < 0
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│ -5 │ -10 │
│ -5 │  10 │
│  5 │ -10 │
└────┴─────┘
3 rows
(session: 4 rule(s))
> ?has_negative(X, Y)
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│ -5 │ -10 │
│ -5 │  10 │
│  5 │ -10 │
└────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_negative_n10t34
Knowledge graph 'test_negative_n10t34' dropped.
