Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_col_n10t35
Knowledge graph 'test_single_col_n10t35' created.
Switched to knowledge graph: test_single_col_n10t35
> .kg use test_single_col_n10t35
Switched to knowledge graph: test_single_col_n10t35
> +ids[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'ids'.
> ?- ids(X).
5 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
> +id_count(count<X>) :- ids(X).
Rule 'id_count' registered.
> ?- id_count(C).
1 rows:
  (5)
> big_ids(X) :- ids(X), X > 3.
2 rows:
  (4)
  (5)
(session: 1 rule(s))
> ?- big_ids(X).
2 rows:
  (4)
  (5)
> pairs(X, Y) :- ids(X), ids(Y), X < Y.
10 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 4)
  (3, 5)
  (4, 5)
(session: 2 rule(s))
> ?- pairs(X, Y).
10 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 4)
  (3, 5)
  (4, 5)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_single_col_n10t35
Knowledge graph 'test_single_col_n10t35' dropped.
