Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_col_n10t35
Knowledge graph 'test_single_col_n10t35' created.
Switched to knowledge graph: test_single_col_n10t35
> .kg use test_single_col_n10t35
Switched to knowledge graph: test_single_col_n10t35
> +ids[(1,), (2,), (3,), (4,), (5,)]
Inserted 5 fact(s) into 'ids'.
> ?ids(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
│ 4 │
│ 5 │
└───┘
5 rows
> +id_count(count<X>) <- ids(X)
Rule 'id_count' registered.
> ?id_count(C)
┌───┐
│ C │
├───┤
│ 5 │
└───┘
1 rows
> big_ids(X) <- ids(X), X > 3
┌───┐
│ X │
├───┤
│ 4 │
│ 5 │
└───┘
2 rows
(session: 1 rule(s))
> ?big_ids(X)
┌───┐
│ X │
├───┤
│ 4 │
│ 5 │
└───┘
2 rows
> pairs(X, Y) <- ids(X), ids(Y), X < Y
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 2 │ 5 │
│ 3 │ 4 │
│ 3 │ 5 │
│ 4 │ 5 │
└───┴───┘
10 rows
(session: 2 rule(s))
> ?pairs(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 2 │ 5 │
│ 3 │ 4 │
│ 3 │ 5 │
│ 4 │ 5 │
└───┴───┘
10 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_single_col_n10t35
Knowledge graph 'test_single_col_n10t35' dropped.
