Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_large_result_n10t37
Knowledge graph 'test_large_result_n10t37' created.
Switched to knowledge graph: test_large_result_n10t37
> .kg use test_large_result_n10t37
Switched to knowledge graph: test_large_result_n10t37
> +nums[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,)]
Inserted 10 fact(s) into 'nums'.
> +product(X, Y) <- nums(X), nums(Y)
Rule 'product' registered.
> +prod_count(count<X>) <- product(X, _)
Rule 'prod_count' registered.
> ?prod_count(C)
┌─────┐
│ C   │
├─────┤
│ 100 │
└─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_large_result_n10t37
Knowledge graph 'test_large_result_n10t37' dropped.
