Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_filter_n10t38
Knowledge graph 'test_empty_filter_n10t38' created.
Switched to knowledge graph: test_empty_filter_n10t38
> .kg use test_empty_filter_n10t38
Switched to knowledge graph: test_empty_filter_n10t38
> +data[(1, 10), (2, 20), (3, 30)].
Inserted 3 fact(s) into 'data'.
> empty_result(Id, Val) :- data(Id, Val), Val > 100.
No results.
(session: 1 rule(s))
> ?- empty_result(Id, Val).
No results.
> +empty_count(count<Id>) :- empty_result(Id, _).
Rule 'empty_count' registered.
> ?- empty_count(C).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_empty_filter_n10t38
Knowledge graph 'test_empty_filter_n10t38' dropped.
