Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_cyclic_n10t39
Knowledge graph 'test_cyclic_n10t39' created.
Switched to knowledge graph: test_cyclic_n10t39
> .kg use test_cyclic_n10t39
Switched to knowledge graph: test_cyclic_n10t39
> +refs[(1, 2), (2, 3), (3, 1)]
Inserted 3 fact(s) into 'refs'.
> +reachable(X, Y) <- refs(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- reachable(X, Y), refs(Y, Z)
Rule 'reachable' registered.
> ?reachable(1, Y)
┌───┬───┐
│ 1 │ Y │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
└───┴───┘
3 rows
> in_cycle(X) <- reachable(X, X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
(session: 1 rule(s))
> ?in_cycle(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cyclic_n10t39
Knowledge graph 'test_cyclic_n10t39' dropped.
