Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cyclic
Knowledge graph 'test_cyclic' created.
Switched to knowledge graph: test_cyclic
> .kg use test_cyclic
Switched to knowledge graph: test_cyclic
> +refs[(1, 2), (2, 3), (3, 1)].
Inserted 3 fact(s) into 'refs'.
> +reachable(X, Y) :- refs(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), refs(Y, Z).
Rule 'reachable' registered.
> ?- reachable(1, Y).
3 rows:
  (1, 1)
  (1, 2)
  (1, 3)
> in_cycle(X) :- reachable(X, X).
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> ?- in_cycle(X).
3 rows:
  (1)
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cyclic
Knowledge graph 'test_cyclic' dropped.
