Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_col_n10t40
Knowledge graph 'test_single_col_n10t40' created.
Switched to knowledge graph: test_single_col_n10t40
> .kg use test_single_col_n10t40
Switched to knowledge graph: test_single_col_n10t40
> +flags[(true,), (false,)]
Inserted 2 fact(s) into 'flags'.
> +ids[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'ids'.
> ?flags(F)
┌──────┐
│ col0 │
├──────┤
│    0 │
│    1 │
└──────┘
2 rows
> ?ids(I)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    3 │
└──────┘
3 rows
> both(I, F) <- ids(I), flags(F)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    0 │
│    1 │    1 │
│    2 │    0 │
│    2 │    1 │
│    3 │    0 │
│    3 │    1 │
└──────┴──────┘
6 rows
(session: 1 rule(s))
> ?both(I, F)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    0 │
│    1 │    1 │
│    2 │    0 │
│    2 │    1 │
│    3 │    0 │
│    3 │    1 │
└──────┴──────┘
6 rows
> +count_ids(count<I>) <- ids(I)
Rule 'count_ids' registered.
> ?count_ids(C)
┌──────┐
│ col0 │
├──────┤
│    3 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_single_col_n10t40
Knowledge graph 'test_single_col_n10t40' dropped.
