Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_wide_n10t41
Knowledge graph 'test_wide_n10t41' created.
Switched to knowledge graph: test_wide_n10t41
> .kg use test_wide_n10t41
Switched to knowledge graph: test_wide_n10t41
> +wide[(1, "a", 10, 1.5, "x", 100, 2.5, "y")]
Inserted 1 fact(s) into 'wide'.
> +wide[(2, "b", 20, 2.5, "z", 200, 3.5, "w")]
Inserted 1 fact(s) into 'wide'.
> ?wide(A, B, C, D, E, F, G, H)
┌──────┬──────┬──────┬──────┬──────┬──────┬──────┬──────┐
│ col0 │ col1 │ col2 │ col3 │ col4 │ col5 │ col6 │ col7 │
├──────┼──────┼──────┼──────┼──────┼──────┼──────┼──────┤
│    1 │ "a"  │   10 │  1.5 │ "x"  │  100 │  2.5 │ "y"  │
│    2 │ "b"  │   20 │  2.5 │ "z"  │  200 │  3.5 │ "w"  │
└──────┴──────┴──────┴──────┴──────┴──────┴──────┴──────┘
2 rows
> narrow(A, C, F) <- wide(A, _, C, _, _, F, _, _)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │   10 │  100 │
│    2 │   20 │  200 │
└──────┴──────┴──────┘
2 rows
(session: 1 rule(s))
> ?narrow(A, C, F)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │   10 │  100 │
│    2 │   20 │  200 │
└──────┴──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_wide_n10t41
Knowledge graph 'test_wide_n10t41' dropped.
