Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_wide
Knowledge graph 'test_wide' created.
Switched to knowledge graph: test_wide
> .kg use test_wide
Switched to knowledge graph: test_wide
> +wide[(1, "a", 10, 1.5, "x", 100, 2.5, "y")].
Inserted 1 fact(s) into 'wide'.
> +wide[(2, "b", 20, 2.5, "z", 200, 3.5, "w")].
Inserted 1 fact(s) into 'wide'.
> ?- wide(A, B, C, D, E, F, G, H).
2 rows:
  (1, "a", 10, 1.5, "x", 100, 2.5, "y")
  (2, "b", 20, 2.5, "z", 200, 3.5, "w")
> narrow(A, C, F) :- wide(A, _, C, _, _, F, _, _).
2 rows:
  (1, 10, 100)
  (2, 20, 200)
(session: 1 rule(s))
> ?- narrow(A, C, F).
2 rows:
  (1, 10, 100)
  (2, 20, 200)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_wide
Knowledge graph 'test_wide' dropped.
