Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_large_result_n10t42
Knowledge graph 'test_large_result_n10t42' created.
Switched to knowledge graph: test_large_result_n10t42
> .kg use test_large_result_n10t42
Switched to knowledge graph: test_large_result_n10t42
> +a[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'a'.
> +b[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'b'.
> +c[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'c'.
> product(X, Y, Z) :- a(X), b(Y), c(Z).
125 rows:
  (1, 1, 1)
  (1, 1, 2)
  (1, 1, 3)
  (1, 1, 4)
  (1, 1, 5)
  (1, 2, 1)
  (1, 2, 2)
  (1, 2, 3)
  (1, 2, 4)
  (1, 2, 5)
  (1, 3, 1)
  (1, 3, 2)
  (1, 3, 3)
  (1, 3, 4)
  (1, 3, 5)
  (1, 4, 1)
  (1, 4, 2)
  (1, 4, 3)
  (1, 4, 4)
  (1, 4, 5)
  (1, 5, 1)
  (1, 5, 2)
  (1, 5, 3)
  (1, 5, 4)
  (1, 5, 5)
  (2, 1, 1)
  (2, 1, 2)
  (2, 1, 3)
  (2, 1, 4)
  (2, 1, 5)
  (2, 2, 1)
  (2, 2, 2)
  (2, 2, 3)
  (2, 2, 4)
  (2, 2, 5)
  (2, 3, 1)
  (2, 3, 2)
  (2, 3, 3)
  (2, 3, 4)
  (2, 3, 5)
  (2, 4, 1)
  (2, 4, 2)
  (2, 4, 3)
  (2, 4, 4)
  (2, 4, 5)
  (2, 5, 1)
  (2, 5, 2)
  (2, 5, 3)
  (2, 5, 4)
  (2, 5, 5)
  (3, 1, 1)
  (3, 1, 2)
  (3, 1, 3)
  (3, 1, 4)
  (3, 1, 5)
  (3, 2, 1)
  (3, 2, 2)
  (3, 2, 3)
  (3, 2, 4)
  (3, 2, 5)
  (3, 3, 1)
  (3, 3, 2)
  (3, 3, 3)
  (3, 3, 4)
  (3, 3, 5)
  (3, 4, 1)
  (3, 4, 2)
  (3, 4, 3)
  (3, 4, 4)
  (3, 4, 5)
  (3, 5, 1)
  (3, 5, 2)
  (3, 5, 3)
  (3, 5, 4)
  (3, 5, 5)
  (4, 1, 1)
  (4, 1, 2)
  (4, 1, 3)
  (4, 1, 4)
  (4, 1, 5)
  (4, 2, 1)
  (4, 2, 2)
  (4, 2, 3)
  (4, 2, 4)
  (4, 2, 5)
  (4, 3, 1)
  (4, 3, 2)
  (4, 3, 3)
  (4, 3, 4)
  (4, 3, 5)
  (4, 4, 1)
  (4, 4, 2)
  (4, 4, 3)
  (4, 4, 4)
  (4, 4, 5)
  (4, 5, 1)
  (4, 5, 2)
  (4, 5, 3)
  (4, 5, 4)
  (4, 5, 5)
  (5, 1, 1)
  (5, 1, 2)
  (5, 1, 3)
  (5, 1, 4)
  (5, 1, 5)
  (5, 2, 1)
  (5, 2, 2)
  (5, 2, 3)
  (5, 2, 4)
  (5, 2, 5)
  (5, 3, 1)
  (5, 3, 2)
  (5, 3, 3)
  (5, 3, 4)
  (5, 3, 5)
  (5, 4, 1)
  (5, 4, 2)
  (5, 4, 3)
  (5, 4, 4)
  (5, 4, 5)
  (5, 5, 1)
  (5, 5, 2)
  (5, 5, 3)
  (5, 5, 4)
  (5, 5, 5)
(session: 1 rule(s))
> +count_product(count<X>) :- product(X, _, _).
Rule 'count_product' registered.
> ?- count_product(N).
1 rows:
  (125)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_large_result_n10t42
Knowledge graph 'test_large_result_n10t42' dropped.
