Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_symmetric
Knowledge graph 'test_symmetric' created.
Switched to knowledge graph: test_symmetric
> .kg use test_symmetric
Switched to knowledge graph: test_symmetric
> +friend[(1, 2), (2, 3), (1, 4)].
Inserted 3 fact(s) into 'friend'.
> +symmetric(A, B) :- friend(A, B).
Rule 'symmetric' registered.
> +symmetric(A, B) :- friend(B, A).
Rule 'symmetric' registered.
> ?- symmetric(A, B).
6 rows:
  (1, 2)
  (1, 4)
  (2, 1)
  (2, 3)
  (3, 2)
  (4, 1)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_symmetric
Knowledge graph 'test_symmetric' dropped.
