Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_anti
Knowledge graph 'test_anti' created.
Switched to knowledge graph: test_anti
> .kg use test_anti
Switched to knowledge graph: test_anti
> +all_users[(1, "Alice"), (2, "Bob"), (3, "Carol"), (4, "Dave")].
Inserted 4 fact(s) into 'all_users'.
> +active_users[(1,), (3,)].
Inserted 2 fact(s) into 'active_users'.
> inactive(Id, Name) :- all_users(Id, Name), !active_users(Id).
2 rows:
  (2, "Bob")
  (4, "Dave")
(session: 1 rule(s))
> ?- inactive(Id, Name).
2 rows:
  (2, "Bob")
  (4, "Dave")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_anti
Knowledge graph 'test_anti' dropped.
