Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_exists
Knowledge graph 'test_exists' created.
Switched to knowledge graph: test_exists
> .kg use test_exists
Switched to knowledge graph: test_exists
> +departments[(1, "Engineering"), (2, "Sales"), (3, "HR")].
Inserted 3 fact(s) into 'departments'.
> +employees[(1, 1), (2, 1), (3, 2)].
Inserted 3 fact(s) into 'employees'.
> has_employees(DeptId, Name) :- departments(DeptId, Name), employees(_, DeptId).
2 rows:
  (1, "Engineering")
  (2, "Sales")
(session: 1 rule(s))
> ?- has_employees(DeptId, Name).
2 rows:
  (1, "Engineering")
  (2, "Sales")
> no_employees(DeptId, Name) :- departments(DeptId, Name), !employees(_, DeptId).
1 rows:
  (3, "HR")
(session: 2 rule(s))
> ?- no_employees(DeptId, Name).
1 rows:
  (3, "HR")
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_exists
Knowledge graph 'test_exists' dropped.
