Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_zeros_n10t46
Knowledge graph 'test_zeros_n10t46' created.
Switched to knowledge graph: test_zeros_n10t46
> .kg use test_zeros_n10t46
Switched to knowledge graph: test_zeros_n10t46
> +nums[(0,), (1,), (-1,)].
Inserted 3 fact(s) into 'nums'.
> plus_zero(X, Y) :- nums(X), Y = X + 0.
3 rows:
  (-1, -1)
  (0, 0)
  (1, 1)
(session: 1 rule(s))
> ?- plus_zero(X, Y).
3 rows:
  (-1, -1)
  (0, 0)
  (1, 1)
> mult_zero(X, Y) :- nums(X), Y = X * 0.
3 rows:
  (-1, 0)
  (0, 0)
  (1, 0)
(session: 2 rule(s))
> ?- mult_zero(X, Y).
3 rows:
  (-1, 0)
  (0, 0)
  (1, 0)
> is_zero(X) :- nums(X), X = 0.
1 rows:
  (0)
(session: 3 rule(s))
> ?- is_zero(X).
1 rows:
  (0)
> is_positive(X) :- nums(X), X > 0.
1 rows:
  (1)
(session: 4 rule(s))
> ?- is_positive(X).
1 rows:
  (1)
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_zeros_n10t46
Knowledge graph 'test_zeros_n10t46' dropped.
