Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_zeros_n10t46
Knowledge graph 'test_zeros_n10t46' created.
Switched to knowledge graph: test_zeros_n10t46
> .kg use test_zeros_n10t46
Switched to knowledge graph: test_zeros_n10t46
> +nums[(0,), (1,), (-1,)]
Inserted 3 fact(s) into 'nums'.
> plus_zero(X, Y) <- nums(X), Y = X + 0
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│ -1 │ -1 │
│  0 │  0 │
│  1 │  1 │
└────┴────┘
3 rows
(session: 1 rule(s))
> ?plus_zero(X, Y)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│ -1 │ -1 │
│  0 │  0 │
│  1 │  1 │
└────┴────┘
3 rows
> mult_zero(X, Y) <- nums(X), Y = X * 0
┌────┬───┐
│ X  │ Y │
├────┼───┤
│ -1 │ 0 │
│  0 │ 0 │
│  1 │ 0 │
└────┴───┘
3 rows
(session: 2 rule(s))
> ?mult_zero(X, Y)
┌────┬───┐
│ X  │ Y │
├────┼───┤
│ -1 │ 0 │
│  0 │ 0 │
│  1 │ 0 │
└────┴───┘
3 rows
> is_zero(X) <- nums(X), X = 0
┌───┐
│ X │
├───┤
│ 0 │
└───┘
1 rows
(session: 3 rule(s))
> ?is_zero(X)
┌───┐
│ X │
├───┤
│ 0 │
└───┘
1 rows
> is_positive(X) <- nums(X), X > 0
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
(session: 4 rule(s))
> ?is_positive(X)
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_zeros_n10t46
Knowledge graph 'test_zeros_n10t46' dropped.
