Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_negatives_n10t47
Knowledge graph 'test_negatives_n10t47' created.
Switched to knowledge graph: test_negatives_n10t47
> .kg use test_negatives_n10t47
Switched to knowledge graph: test_negatives_n10t47
> +nums[(-5,), (-3,), (0,), (3,), (5,)].
Inserted 5 fact(s) into 'nums'.
> +sum_negs(sum<X>) :- nums(X), X < 0.
Rule 'sum_negs' registered.
> ?- sum_negs(S).
1 rows:
  (-8)
> +count_negs(count<X>) :- nums(X), X < 0.
Rule 'count_negs' registered.
> ?- count_negs(C).
1 rows:
  (2)
> +min_val(min<X>) :- nums(X).
Rule 'min_val' registered.
> +max_val(max<X>) :- nums(X).
Rule 'max_val' registered.
> ?- min_val(M).
1 rows:
  (-5)
> ?- max_val(M).
1 rows:
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_negatives_n10t47
Knowledge graph 'test_negatives_n10t47' dropped.
