Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_all_same_n10t48
Knowledge graph 'test_all_same_n10t48' created.
Switched to knowledge graph: test_all_same_n10t48
> .kg use test_all_same_n10t48
Switched to knowledge graph: test_all_same_n10t48
> +same[(5,), (5,), (5,)].
Inserted 1 fact(s) into 'same'.
> ?- same(X).
1 rows:
  (5)
> +distinct_count(<COUNT_DISTINCT:X>) :- same(X).
Rule 'distinct_count' registered.
> ?- distinct_count(N).
1 rows:
  (1)
> pairs(A, B) :- same(A), same(B).
1 rows:
  (5, 5)
(session: 1 rule(s))
> +pair_count(count<A>) :- pairs(A, _).
Rule 'pair_count' registered.
> ?- pair_count(N).
1 rows:
  (1)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_all_same_n10t48
Knowledge graph 'test_all_same_n10t48' dropped.
