Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_ternary_n10t51
Knowledge graph 'test_ternary_n10t51' created.
Switched to knowledge graph: test_ternary_n10t51
> .kg use test_ternary_n10t51
Switched to knowledge graph: test_ternary_n10t51
> +triple[(1, 2, 3), (2, 3, 4), (3, 4, 5)]
Inserted 3 fact(s) into 'triple'.
> first_two(A, B) <- triple(A, B, _)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
(session: 1 rule(s))
> last_two(B, C) <- triple(_, B, C)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 2 │ 3 │
│ 3 │ 4 │
│ 4 │ 5 │
└───┴───┘
3 rows
(session: 2 rule(s))
> ?first_two(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> ?last_two(B, C)
┌───┬───┐
│ B │ C │
├───┼───┤
│ 2 │ 3 │
│ 3 │ 4 │
│ 4 │ 5 │
└───┴───┘
3 rows
> joined(A, B, C, D) <- triple(A, B, C), triple(B, C, D)
┌───┬───┬───┬───┐
│ X │ Y │ Z │ W │
├───┼───┼───┼───┤
│ 1 │ 2 │ 3 │ 4 │
│ 2 │ 3 │ 4 │ 5 │
└───┴───┴───┴───┘
2 rows
(session: 3 rule(s))
> ?joined(A, B, C, D)
┌───┬───┬───┬───┐
│ A │ B │ C │ D │
├───┼───┼───┼───┤
│ 1 │ 2 │ 3 │ 4 │
│ 2 │ 3 │ 4 │ 5 │
└───┴───┴───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_ternary_n10t51
Knowledge graph 'test_ternary_n10t51' dropped.
