Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ternary
Knowledge graph 'test_ternary' created.
Switched to knowledge graph: test_ternary
> .kg use test_ternary
Switched to knowledge graph: test_ternary
> +triple[(1, 2, 3), (2, 3, 4), (3, 4, 5)].
Inserted 3 fact(s) into 'triple'.
> first_two(A, B) :- triple(A, B, _).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
(session: 1 rule(s))
> last_two(B, C) :- triple(_, B, C).
3 rows:
  (2, 3)
  (3, 4)
  (4, 5)
(session: 2 rule(s))
> ?- first_two(A, B).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> ?- last_two(B, C).
3 rows:
  (2, 3)
  (3, 4)
  (4, 5)
> joined(A, B, C, D) :- triple(A, B, C), triple(B, C, D).
2 rows:
  (2, 3, 4, 1)
  (3, 4, 5, 2)
(session: 3 rule(s))
> ?- joined(A, B, C, D).
2 rows:
  (2, 3, 4, 1)
  (3, 4, 5, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_ternary
Knowledge graph 'test_ternary' dropped.
