Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_same_twice_n10t53
Knowledge graph 'test_same_twice_n10t53' created.
Switched to knowledge graph: test_same_twice_n10t53
> .kg use test_same_twice_n10t53
Switched to knowledge graph: test_same_twice_n10t53
> +nums[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'nums'.
> pairs(A, B) <- nums(A), nums(B), A < B
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 3 │
└───┴───┘
3 rows
(session: 1 rule(s))
> ?pairs(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 3 │
└───┴───┘
3 rows
> +pair_count(count<A>) <- pairs(A, _)
Rule 'pair_count' registered.
> ?pair_count(N)
┌───┐
│ N │
├───┤
│ 3 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_same_twice_n10t53
Knowledge graph 'test_same_twice_n10t53' dropped.
