Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_same_twice_n10t53
Knowledge graph 'test_same_twice_n10t53' created.
Switched to knowledge graph: test_same_twice_n10t53
> .kg use test_same_twice_n10t53
Switched to knowledge graph: test_same_twice_n10t53
> +nums[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'nums'.
> pairs(A, B) :- nums(A), nums(B), A < B.
3 rows:
  (1, 2)
  (1, 3)
  (2, 3)
(session: 1 rule(s))
> ?- pairs(A, B).
3 rows:
  (1, 2)
  (1, 3)
  (2, 3)
> +pair_count(count<A>) :- pairs(A, _).
Rule 'pair_count' registered.
> ?- pair_count(N).
1 rows:
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_same_twice_n10t53
Knowledge graph 'test_same_twice_n10t53' dropped.
