Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_n10t55
Knowledge graph 'test_single_n10t55' created.
Switched to knowledge graph: test_single_n10t55
> .kg use test_single_n10t55
Switched to knowledge graph: test_single_n10t55
> +single[(42, "answer")]
Inserted 1 fact(s) into 'single'.
> ?single(X, Y)
┌──────┬──────────┐
│ col0 │ col1     │
├──────┼──────────┤
│   42 │ "answer" │
└──────┴──────────┘
1 rows
> +one_sum(sum<X>) <- single(X, _)
Rule 'one_sum' registered.
> ?one_sum(S)
┌──────┐
│ col0 │
├──────┤
│   42 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_single_n10t55
Knowledge graph 'test_single_n10t55' dropped.
