Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_large_arity
Knowledge graph 'test_large_arity' created.
Switched to knowledge graph: test_large_arity
> .kg use test_large_arity
Switched to knowledge graph: test_large_arity
> +wide10[(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)].
Inserted 1 fact(s) into 'wide10'.
> +wide10[(10, 20, 30, 40, 50, 60, 70, 80, 90, 100)].
Inserted 1 fact(s) into 'wide10'.
> ?- wide10(A, B, C, D, E, F, G, H, I, J).
2 rows:
  (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
  (10, 20, 30, 40, 50, 60, 70, 80, 90, 100)
> project(A, E, J) :- wide10(A, _, _, _, E, _, _, _, _, J).
2 rows:
  (1, 5, 10)
  (10, 50, 100)
(session: 1 rule(s))
> ?- project(A, E, J).
2 rows:
  (1, 5, 10)
  (10, 50, 100)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_large_arity
Knowledge graph 'test_large_arity' dropped.
