Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rec_filter_n10t58
Knowledge graph 'test_rec_filter_n10t58' created.
Switched to knowledge graph: test_rec_filter_n10t58
> .kg use test_rec_filter_n10t58
Switched to knowledge graph: test_rec_filter_n10t58
> +link[(1, 2, 1), (2, 3, 2), (3, 4, 1), (4, 5, 3)]
Inserted 4 fact(s) into 'link'.
> +filtered_path(A, B) <- link(A, B, W), W <= 2
Rule 'filtered_path' registered.
> +filtered_path(A, C) <- filtered_path(A, B), link(B, C, W), W <= 2
Rule 'filtered_path' registered.
> ?filtered_path(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rec_filter_n10t58
Knowledge graph 'test_rec_filter_n10t58' dropped.
