Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dup_ins_n10t59
Knowledge graph 'test_dup_ins_n10t59' created.
Switched to knowledge graph: test_dup_ins_n10t59
> .kg use test_dup_ins_n10t59
Switched to knowledge graph: test_dup_ins_n10t59
> +data[(1, "a")].
Inserted 1 fact(s) into 'data'.
> +data[(1, "a")].
No facts inserted (1 duplicate skipped).
> +data[(1, "a")].
No facts inserted (1 duplicate skipped).
> ?- data(Id, Val).
1 rows:
  (1, "a")
> +count_data(count<Id>) :- data(Id, _).
Rule 'count_data' registered.
> ?- count_data(N).
1 rows:
  (1)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dup_ins_n10t59
Knowledge graph 'test_dup_ins_n10t59' dropped.
