Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_whitespace_n10t61
Knowledge graph 'test_whitespace_n10t61' created.
Switched to knowledge graph: test_whitespace_n10t61
> .kg use test_whitespace_n10t61
Switched to knowledge graph: test_whitespace_n10t61
> +names[(1, "John Doe"), (2, "Jane Smith"), (3, "Bob")].
Inserted 3 fact(s) into 'names'.
> ?- names(Id, Name).
3 rows:
  (1, "John Doe")
  (2, "Jane Smith")
  (3, "Bob")
> has_space(Id, Name) :- names(Id, Name), Name = "John Doe".
1 rows:
  (1, "John Doe")
(session: 1 rule(s))
> ?- has_space(Id, Name).
1 rows:
  (1, "John Doe")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_whitespace_n10t61
Knowledge graph 'test_whitespace_n10t61' dropped.
