Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_bool_key_n10t65
Knowledge graph 'test_bool_key_n10t65' created.
Switched to knowledge graph: test_bool_key_n10t65
> .kg use test_bool_key_n10t65
Switched to knowledge graph: test_bool_key_n10t65
> +flags[(true, "yes"), (false, "no")]
Inserted 2 fact(s) into 'flags'.
> ?flags(Key, Val)
┌───────┬───────┐
│ Key   │ Val   │
├───────┼───────┤
│ false │ "no"  │
│ true  │ "yes" │
└───────┴───────┘
2 rows
> true_only(Val) <- flags(true, Val)
┌───────┐
│ X     │
├───────┤
│ "yes" │
└───────┘
1 rows
(session: 1 rule(s))
> ?true_only(Val)
┌───────┐
│ Val   │
├───────┤
│ "yes" │
└───────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_bool_key_n10t65
Knowledge graph 'test_bool_key_n10t65' dropped.
