Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_key
Knowledge graph 'test_bool_key' created.
Switched to knowledge graph: test_bool_key
> .kg use test_bool_key
Switched to knowledge graph: test_bool_key
> +flags[(true, "yes"), (false, "no")].
Inserted 2 fact(s) into 'flags'.
> ?- flags(Key, Val).
2 rows:
  ("false", "no")
  ("true", "yes")
> true_only(Val) :- flags(true, Val).
1 rows:
  ("yes")
(session: 1 rule(s))
> ?- true_only(Val).
1 rows:
  ("yes")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_bool_key
Knowledge graph 'test_bool_key' dropped.
