Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mixed_keys_n10t66
Knowledge graph 'test_mixed_keys_n10t66' created.
Switched to knowledge graph: test_mixed_keys_n10t66
> .kg use test_mixed_keys_n10t66
Switched to knowledge graph: test_mixed_keys_n10t66
> +data[(1, 100), (2, 200)].
Inserted 2 fact(s) into 'data'.
> +data2[("a", 300), ("b", 400)].
Inserted 2 fact(s) into 'data2'.
> ?- data(A, B).
2 rows:
  (1, 100)
  (2, 200)
> ?- data2(A, B).
2 rows:
  ("a", 300)
  ("b", 400)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_mixed_keys_n10t66
Knowledge graph 'test_mixed_keys_n10t66' dropped.
