Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_self_ref_n10t70
Knowledge graph 'test_self_ref_n10t70' created.
Switched to knowledge graph: test_self_ref_n10t70
> .kg use test_self_ref_n10t70
Switched to knowledge graph: test_self_ref_n10t70
> +graph[("a", "a"), ("a", "b"), ("b", "c"), ("c", "c")]
Inserted 4 fact(s) into 'graph'.
> has_self_loop(X) <- graph(X, X)
┌─────┐
│ X   │
├─────┤
│ "a" │
│ "c" │
└─────┘
2 rows
(session: 1 rule(s))
> no_self_loop(X) <- graph(X, _), !has_self_loop(X)
┌─────┐
│ X   │
├─────┤
│ "b" │
└─────┘
1 rows
(session: 2 rule(s))
> ?has_self_loop(X)
┌─────┐
│ X   │
├─────┤
│ "a" │
│ "c" │
└─────┘
2 rows
> ?no_self_loop(X)
┌─────┐
│ X   │
├─────┤
│ "b" │
└─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_self_ref_n10t70
Knowledge graph 'test_self_ref_n10t70' dropped.
