Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_bind
Knowledge graph 'test_multi_bind' created.
Switched to knowledge graph: test_multi_bind
> .kg use test_multi_bind
Switched to knowledge graph: test_multi_bind
> +data[(1, 1), (1, 2), (2, 2), (3, 3)].
Inserted 4 fact(s) into 'data'.
> diagonal(X) :- data(X, X).
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> ?- diagonal(X).
3 rows:
  (1)
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multi_bind
Knowledge graph 'test_multi_bind' dropped.
