Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_bind_n10t71
Knowledge graph 'test_multi_bind_n10t71' created.
Switched to knowledge graph: test_multi_bind_n10t71
> .kg use test_multi_bind_n10t71
Switched to knowledge graph: test_multi_bind_n10t71
> +data[(1, 1), (1, 2), (2, 2), (3, 3)]
Inserted 4 fact(s) into 'data'.
> diagonal(X) <- data(X, X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    3 │
└──────┘
3 rows
(session: 1 rule(s))
> ?diagonal(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    3 │
└──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multi_bind_n10t71
Knowledge graph 'test_multi_bind_n10t71' dropped.
