Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_result_n10t75
Knowledge graph 'test_empty_result_n10t75' created.
Switched to knowledge graph: test_empty_result_n10t75
> .kg use test_empty_result_n10t75
Switched to knowledge graph: test_empty_result_n10t75
> +data[(1, "a"), (2, "b"), (3, "c")].
Inserted 3 fact(s) into 'data'.
> ?- data(X, Y), X > 100.
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty_result_n10t75
Knowledge graph 'test_empty_result_n10t75' dropped.
