Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_no_match_n10t76
Knowledge graph 'test_rule_no_match_n10t76' created.
Switched to knowledge graph: test_rule_no_match_n10t76
> .kg use test_rule_no_match_n10t76
Switched to knowledge graph: test_rule_no_match_n10t76
> +items[(1, "a"), (2, "b")]
Inserted 2 fact(s) into 'items'.
> impossible(X, Y) <- items(X, Y), X = "string"
No results.
(session: 1 rule(s))
> ?impossible(X, Y)
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_rule_no_match_n10t76
Knowledge graph 'test_rule_no_match_n10t76' dropped.
