Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_special_chars_n10t79
Knowledge graph 'test_special_chars_n10t79' created.
Switched to knowledge graph: test_special_chars_n10t79
> .kg use test_special_chars_n10t79
Switched to knowledge graph: test_special_chars_n10t79
> +texts[(1, "hello\nworld"), (2, "tab\there"), (3, "back\\slash")].
Inserted 3 fact(s) into 'texts'.
> ?- texts(Id, T).
3 rows:
  (1, "hello\nworld")
  (2, "tab\there")
  (3, "back\\slash")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_special_chars_n10t79
Knowledge graph 'test_special_chars_n10t79' dropped.
