Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_long_str_n10t80
Knowledge graph 'test_long_str_n10t80' created.
Switched to knowledge graph: test_long_str_n10t80
> .kg use test_long_str_n10t80
Switched to knowledge graph: test_long_str_n10t80
> +data[(1, "this_is_a_very_long_string_that_goes_on_and_on_and_on_for_quite_some_time_to_test_handling_of_longer_values")]
Inserted 1 fact(s) into 'data'.
> len_check(Id, S, L) <- data(Id, S), L = LEN(S)
┌───┬──────────────────────────────────────────┬─────┐
│ X │ Y                                        │ Z   │
├───┼──────────────────────────────────────────┼─────┤
│ 1 │ "this_is_a_very_long_string_that_goes_o… │ 107 │
└───┴──────────────────────────────────────────┴─────┘
1 rows
(session: 1 rule(s))
> ?len_check(Id, S, L)
┌────┬──────────────────────────────────────────┬─────┐
│ Id │ S                                        │ L   │
├────┼──────────────────────────────────────────┼─────┤
│  1 │ "this_is_a_very_long_string_that_goes_o… │ 107 │
└────┴──────────────────────────────────────────┴─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_long_str_n10t80
Knowledge graph 'test_long_str_n10t80' dropped.
