Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_many_rules
Knowledge graph 'test_many_rules' created.
Switched to knowledge graph: test_many_rules
> .kg use test_many_rules
Switched to knowledge graph: test_many_rules
> +nums[(1,), (2,), (3,), (4,), (5,), (6,)].
Inserted 6 fact(s) into 'nums'.
> +classified(X, "tiny") :- nums(X), X <= 1.
Rule 'classified' registered.
> +classified(X, "small") :- nums(X), X > 1, X <= 3.
Rule 'classified' registered.
> +classified(X, "medium") :- nums(X), X > 3, X <= 5.
Rule 'classified' registered.
> +classified(X, "large") :- nums(X), X > 5.
Rule 'classified' registered.
> ?- classified(X, Cat).
6 rows:
  (1, "tiny")
  (2, "small")
  (3, "small")
  (4, "medium")
  (5, "medium")
  (6, "large")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_many_rules
Knowledge graph 'test_many_rules' dropped.
