Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_diamond_n10t87
Knowledge graph 'test_diamond_n10t87' created.
Switched to knowledge graph: test_diamond_n10t87
> .kg use test_diamond_n10t87
Switched to knowledge graph: test_diamond_n10t87
> +start[(1,), (2,)].
Inserted 2 fact(s) into 'start'.
> left(X, Y) :- start(X), Y = X * 2.
2 rows:
  (1, 2)
  (2, 4)
(session: 1 rule(s))
> right(X, Y) :- start(X), Y = X + 10.
2 rows:
  (1, 11)
  (2, 12)
(session: 2 rule(s))
> combined(X, L, R) :- left(X, L), right(X, R).
2 rows:
  (1, 2, 11)
  (2, 4, 12)
(session: 3 rule(s))
> ?- combined(X, L, R).
2 rows:
  (1, 2, 11)
  (2, 4, 12)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_diamond_n10t87
Knowledge graph 'test_diamond_n10t87' dropped.
