Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cartesian
Knowledge graph 'test_cartesian' created.
Switched to knowledge graph: test_cartesian
> .kg use test_cartesian
Switched to knowledge graph: test_cartesian
> +left[(1,), (2,)].
Inserted 2 fact(s) into 'left'.
> +right[("a",), ("b",)].
Inserted 2 fact(s) into 'right'.
> product(L, R) :- left(L), right(R).
4 rows:
  (1, "a")
  (1, "b")
  (2, "a")
  (2, "b")
(session: 1 rule(s))
> ?- product(L, R).
4 rows:
  (1, "a")
  (1, "b")
  (2, "a")
  (2, "b")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cartesian
Knowledge graph 'test_cartesian' dropped.
