Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cartesian_n10t89
Knowledge graph 'test_cartesian_n10t89' created.
Switched to knowledge graph: test_cartesian_n10t89
> .kg use test_cartesian_n10t89
Switched to knowledge graph: test_cartesian_n10t89
> +left[(1,), (2,)]
Inserted 2 fact(s) into 'left'.
> +right[("a",), ("b",)]
Inserted 2 fact(s) into 'right'.
> product(L, R) <- left(L), right(R)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │ "a"  │
│    1 │ "b"  │
│    2 │ "a"  │
│    2 │ "b"  │
└──────┴──────┘
4 rows
(session: 1 rule(s))
> ?product(L, R)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │ "a"  │
│    1 │ "b"  │
│    2 │ "a"  │
│    2 │ "b"  │
└──────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cartesian_n10t89
Knowledge graph 'test_cartesian_n10t89' dropped.
