Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_agg_n10t90
Knowledge graph 'test_single_agg_n10t90' created.
Switched to knowledge graph: test_single_agg_n10t90
> .kg use test_single_agg_n10t90
Switched to knowledge graph: test_single_agg_n10t90
> +single[(42,)]
Inserted 1 fact(s) into 'single'.
> sum_single(sum<X>) <- single(X)
┌──────┐
│ col0 │
├──────┤
│   42 │
└──────┘
1 rows
(session: 1 rule(s))
> count_single(count<X>) <- single(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
└──────┘
1 rows
(session: 2 rule(s))
> min_single(min<X>) <- single(X)
┌──────┐
│ col0 │
├──────┤
│   42 │
└──────┘
1 rows
(session: 3 rule(s))
> max_single(max<X>) <- single(X)
┌──────┐
│ col0 │
├──────┤
│   42 │
└──────┘
1 rows
(session: 4 rule(s))
> ?sum_single(S)
┌──────┐
│ col0 │
├──────┤
│   42 │
└──────┘
1 rows
> ?count_single(C)
┌──────┐
│ col0 │
├──────┤
│    1 │
└──────┘
1 rows
> ?min_single(M)
┌──────┐
│ col0 │
├──────┤
│   42 │
└──────┘
1 rows
> ?max_single(M)
┌──────┐
│ col0 │
├──────┤
│   42 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_single_agg_n10t90
Knowledge graph 'test_single_agg_n10t90' dropped.
