Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create constraint_key_test
Knowledge graph 'constraint_key_test' created.
Switched to knowledge graph: constraint_key_test
> .kg use constraint_key_test
Switched to knowledge graph: constraint_key_test
> +user(id: int @key, name: string, email: string).
Schema 'user' declared (persistent).
> +user(1, "alice", "alice@example.com").
Inserted 1 fact(s) into 'user'.
> +user(2, "bob", "bob@example.com").
Inserted 1 fact(s) into 'user'.
> +user(3, "carol", "carol@example.com").
Inserted 1 fact(s) into 'user'.
> ?- user(Id, Name, Email).
3 rows:
  (1, "alice", "alice@example.com")
  (2, "bob", "bob@example.com")
  (3, "carol", "carol@example.com")
> .rel user
Relation: user
  Columns: ["col0", "col1", "col2"]
  Total rows: 3
  Preview (first 3):
    (1, "alice", "alice@example.com")
    (2, "bob", "bob@example.com")
    (3, "carol", "carol@example.com")
> .kg use default
Switched to knowledge graph: default
> .kg drop constraint_key_test
Knowledge graph 'constraint_key_test' dropped.
