Executing script: examples/datalog/26_constraints/03_not_empty_constraint.dl

> .db create constraint_not_empty_test
Database 'constraint_not_empty_test' created.
Switched to database: constraint_not_empty_test
> .db use constraint_not_empty_test
Switched to database: constraint_not_empty_test
> +person(id: int @key, name: string @not_empty, bio: string).
Persistent schema 'person' declared: (id: Base(Int) @primary, name: Base(String) @not_empty, bio: Base(String))
> +person(1, "Alice Smith", "Software engineer").
Inserted 1 fact into 'person'.
> +person(2, "Bob Jones", "").
Inserted 1 fact into 'person'.
> +person(3, "Carol White", "Designer").
Inserted 1 fact into 'person'.
> ?- person(Id, Name, Bio).
3 rows:
  (1, "Alice Smith", "Software engineer")
  (2, "Bob Jones", "")
  (3, "Carol White", "Designer")
> .rel person
Relation: person
Schema: ["col0", "col1", "col2"]
Tuple count: 3
> .db use default
Switched to database: default
> .db drop constraint_not_empty_test
Database 'constraint_not_empty_test' dropped.
