Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create constraint_not_empty_test
Knowledge graph 'constraint_not_empty_test' created.
Switched to knowledge graph: constraint_not_empty_test
> .kg use constraint_not_empty_test
Switched to knowledge graph: constraint_not_empty_test
> +person(id: int @key, name: string @not_empty, bio: string).
Schema 'person' declared (persistent).
> +person(1, "Alice Smith", "Software engineer").
Inserted 1 fact(s) into 'person'.
> +person(2, "Bob Jones", "").
Inserted 1 fact(s) into 'person'.
> +person(3, "Carol White", "Designer").
Inserted 1 fact(s) into 'person'.
> ?- person(Id, Name, Bio).
3 rows:
  (1, "Alice Smith", "Software engineer")
  (2, "Bob Jones", "")
  (3, "Carol White", "Designer")
> .rel person
Relation: person
  Columns: ["col0", "col1", "col2"]
  Total rows: 3
  Preview (first 3):
    (1, "Alice Smith", "Software engineer")
    (2, "Bob Jones", "")
    (3, "Carol White", "Designer")
> .kg use default
Switched to knowledge graph: default
> .kg drop constraint_not_empty_test
Knowledge graph 'constraint_not_empty_test' dropped.
