Executing script: examples/datalog/26_constraints/04_range_constraint.dl

> .db create constraint_range_test
Database 'constraint_range_test' created.
Switched to database: constraint_range_test
> .db use constraint_range_test
Switched to database: constraint_range_test
> +employee(id: int @key, name: string, age: int @range(0, 150)).
Persistent schema 'employee' declared: (id: Base(Int) @primary, name: Base(String), age: Base(Int) @range(0, 150))
> +employee(1, "Alice", 30).
Inserted 1 fact into 'employee'.
> +employee(2, "Bob", 25).
Inserted 1 fact into 'employee'.
> +employee(3, "Carol", 45).
Inserted 1 fact into 'employee'.
> ?- employee(Id, Name, Age).
3 rows:
  (1, "Alice", 30)
  (2, "Bob", 25)
  (3, "Carol", 45)
> .rel employee
Relation: employee
Schema: ["col0", "col1", "col2"]
Tuple count: 3
> .db use default
Switched to database: default
> .db drop constraint_range_test
Database 'constraint_range_test' dropped.
