Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create constraint_multi_test
Knowledge graph 'constraint_multi_test' created.
Switched to knowledge graph: constraint_multi_test
> .kg use constraint_multi_test
Switched to knowledge graph: constraint_multi_test
> +customer( id: int @key, email: string @unique, name: string @not_empty, age: int @range(18, 120) ).
Schema 'customer' declared (persistent).
> +customer(1, "alice@example.com", "Alice Smith", 30).
Inserted 1 fact(s) into 'customer'.
> +customer(2, "bob@example.com", "Bob Jones", 25).
Inserted 1 fact(s) into 'customer'.
> +customer(3, "carol@example.com", "Carol White", 45).
Inserted 1 fact(s) into 'customer'.
> ?- customer(Id, Email, Name, Age).
3 rows:
  (1, "alice@example.com", "Alice Smith", 30)
  (2, "bob@example.com", "Bob Jones", 25)
  (3, "carol@example.com", "Carol White", 45)
> .rel customer
Relation: customer
  Columns: ["col0", "col1", "col2", "col3"]
  Total rows: 3
  Preview (first 3):
    (1, "alice@example.com", "Alice Smith", 30)
    (2, "bob@example.com", "Bob Jones", 25)
    (3, "carol@example.com", "Carol White", 45)
> .kg use default
Switched to knowledge graph: default
> .kg drop constraint_multi_test
Knowledge graph 'constraint_multi_test' dropped.
