Executing script: examples/datalog/26_constraints/05_multiple_constraints.dl

> .db create constraint_multi_test
Database 'constraint_multi_test' created.
Switched to database: constraint_multi_test
> .db use constraint_multi_test
Switched to database: constraint_multi_test
> +customer( id: int @key, email: string @unique, name: string @not_empty, age: int @range(18, 120) ).
Persistent schema 'customer' declared: (id: Base(Int) @primary, email: Base(String) @unique, name: Base(String) @not_empty, age: Base(Int) @range(18, 120))
> +customer(1, "alice@example.com", "Alice Smith", 30).
Inserted 1 fact into 'customer'.
> +customer(2, "bob@example.com", "Bob Jones", 25).
Inserted 1 fact into 'customer'.
> +customer(3, "carol@example.com", "Carol White", 45).
Inserted 1 fact into 'customer'.
> ?- customer(Id, Email, Name, Age).
3 rows:
  (1, "alice@example.com", "Alice Smith", 30)
  (2, "bob@example.com", "Bob Jones", 25)
  (3, "carol@example.com", "Carol White", 45)
> .rel customer
Relation: customer
Schema: ["col0", "col1", "col2", "col3"]
Tuple count: 3
> .db use default
Switched to database: default
> .db drop constraint_multi_test
Database 'constraint_multi_test' dropped.
