Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create constraint_composite_test
Knowledge graph 'constraint_composite_test' created.
Switched to knowledge graph: constraint_composite_test
> .kg use constraint_composite_test
Switched to knowledge graph: constraint_composite_test
> +enrollment(student_id: int @key, course_id: int @key, grade: float, semester: string).
Schema 'enrollment' declared (persistent).
> +enrollment(1, 101, 3.5, "Fall 2024").
Inserted 1 fact(s) into 'enrollment'.
> +enrollment(1, 102, 4.0, "Fall 2024").
Inserted 1 fact(s) into 'enrollment'.
> +enrollment(2, 101, 3.8, "Fall 2024").
Inserted 1 fact(s) into 'enrollment'.
> +enrollment(2, 103, 3.2, "Spring 2025").
Inserted 1 fact(s) into 'enrollment'.
> ?- enrollment(StudentId, CourseId, Grade, Semester).
4 rows:
  (1, 101, 3.5, "Fall 2024")
  (1, 102, 4.0, "Fall 2024")
  (2, 101, 3.8, "Fall 2024")
  (2, 103, 3.2, "Spring 2025")
> ?- enrollment(1, CourseId, Grade, Semester).
2 rows:
  (1, 101, 3.5, "Fall 2024")
  (1, 102, 4.0, "Fall 2024")
> .rel enrollment
Relation: enrollment
  Columns: ["col0", "col1", "col2", "col3"]
  Total rows: 4
  Preview (first 4):
    (1, 101, 3.5, "Fall 2024")
    (1, 102, 4.0, "Fall 2024")
    (2, 101, 3.8, "Fall 2024")
    (2, 103, 3.2, "Spring 2025")
> .kg use default
Switched to knowledge graph: default
> .kg drop constraint_composite_test
Knowledge graph 'constraint_composite_test' dropped.
