Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_precedence
Knowledge graph 'test_precedence' created.
Switched to knowledge graph: test_precedence
> .kg use test_precedence
Switched to knowledge graph: test_precedence
> +nums[(1), (2), (3)].
Inserted 3 fact(s) into 'nums'.
> test_add(X, X+1) :- nums(X).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
(session: 1 rule(s))
> ?- test_add(X, R).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> test_mul(X, X*2) :- nums(X).
3 rows:
  (1, 2)
  (2, 4)
  (3, 6)
(session: 2 rule(s))
> ?- test_mul(X, R).
3 rows:
  (1, 2)
  (2, 4)
  (3, 6)
> +pairs[(10, 2), (20, 4), (15, 3)].
Inserted 3 fact(s) into 'pairs'.
> test_div(X, Y, X/Y) :- pairs(X, Y).
3 rows:
  (10, 2, 5.0)
  (15, 3, 5.0)
  (20, 4, 5.0)
(session: 3 rule(s))
> ?- test_div(X, Y, R).
3 rows:
  (10, 2, 5.0)
  (15, 3, 5.0)
  (20, 4, 5.0)
> test_sub(X, X-1) :- nums(X).
3 rows:
  (1, 0)
  (2, 1)
  (3, 2)
(session: 4 rule(s))
> ?- test_sub(X, R).
3 rows:
  (1, 0)
  (2, 1)
  (3, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_precedence
Knowledge graph 'test_precedence' dropped.
