Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_reserved
Knowledge graph 'test_reserved' created.
Switched to knowledge graph: test_reserved
> .kg use test_reserved
Switched to knowledge graph: test_reserved
> +count_rel(1, 2).
Inserted 1 fact(s) into 'count_rel'.
> ?- count_rel(X, Y).
1 rows:
  (1, 2)
> +sum_data(1, 100).
Inserted 1 fact(s) into 'sum_data'.
> ?- sum_data(X, Y).
1 rows:
  (1, 100)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_reserved
Knowledge graph 'test_reserved' dropped.
