Executing script: examples/datalog/19_self_checking/04_bug_verification.dl

> .db create test_bug_verification
Database 'test_bug_verification' created.
Switched to database: test_bug_verification
> .db use test_bug_verification
Switched to database: test_bug_verification
> +src3[(1, 7777, 999), (2, 8888, 888)].
Inserted 2 facts into 'src3'.
> +link[(1, 1001), (2, 1002)].
Inserted 2 facts into 'link'.
> result(Y, D+1) :- src3(X, D, _), link(X, Y).
2 rows:
  (1001, 7778)
  (1002, 8889)
(session: 1 rule(s))
> ?- result(A, B).
2 rows:
  (1001, 7778)
  (1002, 8889)
> .db use default
Switched to database: default
(Cleared 1 session rule(s))
> .db drop test_bug_verification
Database 'test_bug_verification' dropped.
