Executing script: examples/datalog/16_vectors/01_euclidean_distance.dl

> .db create test_vec_euclidean
Database 'test_vec_euclidean' created.
Switched to database: test_vec_euclidean
> .db use test_vec_euclidean
Switched to database: test_vec_euclidean
> +vectors[(1, [1.0, 0.0, 0.0]), (2, [0.0, 1.0, 0.0]), (3, [1.0, 1.0, 0.0])].
Inserted 3 facts into 'vectors'.
> +query[([0.0, 0.0, 0.0])].
Inserted 1 fact into 'query'.
> nearest(Id, Dist) :- vectors(Id, V), query(Q), Dist = euclidean(V, Q).
No results for 'nearest'.
(session: 1 rule(s))
> ?- nearest(X, Y).
3 rows:
  (1, 1)
  (2, 1)
  (3, 1.4142135623730951)
> .db use default
Switched to database: default
(Cleared 1 session rule(s))
> .db drop test_vec_euclidean
Database 'test_vec_euclidean' dropped.
