Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_euclidean
Knowledge graph 'test_vec_euclidean' created.
Switched to knowledge graph: test_vec_euclidean
> .kg use test_vec_euclidean
Switched to knowledge graph: test_vec_euclidean
> +vectors[(1, [1.0, 0.0, 0.0]), (2, [0.0, 1.0, 0.0]), (3, [1.0, 1.0, 0.0])].
No facts inserted (3 duplicate skipped).
> +query[([0.0, 0.0, 0.0])].
No facts inserted (1 duplicate skipped).
> nearest(Id, Dist) :- vectors(Id, V), query(Q), Dist = euclidean(V, Q).
No results.
(session: 1 rule(s))
> ?- nearest(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_euclidean
Knowledge graph 'test_vec_euclidean' dropped.
