Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_cosine
Knowledge graph 'test_vec_cosine' created.
Switched to knowledge graph: test_vec_cosine
> .kg use test_vec_cosine
Switched to knowledge graph: test_vec_cosine
> +vectors[(1, [1.0, 0.0]), (2, [0.0, 1.0]), (3, [1.0, 1.0])].
No facts inserted (3 duplicate skipped).
> +query[([1.0, 0.0])].
No facts inserted (1 duplicate skipped).
> similarity(Id, Dist) :- vectors(Id, V), query(Q), Dist = cosine(V, Q).
No results.
(session: 1 rule(s))
> ?- similarity(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_cosine
Knowledge graph 'test_vec_cosine' dropped.
