Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_dot
Knowledge graph 'test_vec_dot' created.
Switched to knowledge graph: test_vec_dot
> .kg use test_vec_dot
Switched to knowledge graph: test_vec_dot
> +vectors[(1, [1.0, 2.0, 3.0]), (2, [2.0, 0.0, 1.0]), (3, [1.0, 1.0, 1.0])].
No facts inserted (3 duplicate skipped).
> +query[([1.0, 1.0, 1.0])].
No facts inserted (1 duplicate skipped).
> dot_result(Id, Score) :- vectors(Id, V), query(Q), Score = dot(V, Q).
No results.
(session: 1 rule(s))
> ?- dot_result(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_dot
Knowledge graph 'test_vec_dot' dropped.
