Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_dot_n16t03
Knowledge graph 'test_vec_dot_n16t03' created.
Switched to knowledge graph: test_vec_dot_n16t03
> .kg use test_vec_dot_n16t03
Switched to knowledge graph: test_vec_dot_n16t03
> +vectors[(1, [1.0, 2.0, 3.0]), (2, [2.0, 0.0, 1.0]), (3, [1.0, 1.0, 1.0])]
Inserted 3 fact(s) into 'vectors'.
> +query[([1.0, 1.0, 1.0])]
Inserted 1 fact(s) into 'query'.
> dot_result(Id, Score) <- vectors(Id, V), query(Q), Score = dot(V, Q)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 6.0 │
│ 2 │ 3.0 │
│ 3 │ 3.0 │
└───┴─────┘
3 rows
(session: 1 rule(s))
> ?dot_result(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 6.0 │
│ 2 │ 3.0 │
│ 3 │ 3.0 │
└───┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_dot_n16t03
Knowledge graph 'test_vec_dot_n16t03' dropped.
