Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_manhattan
Knowledge graph 'test_vec_manhattan' created.
Switched to knowledge graph: test_vec_manhattan
> .kg use test_vec_manhattan
Switched to knowledge graph: test_vec_manhattan
> +vectors[(1, [0.0, 0.0]), (2, [1.0, 1.0]), (3, [2.0, 2.0]), (4, [3.0, 0.0])].
No facts inserted (4 duplicate skipped).
> +query[([0.0, 0.0])].
No facts inserted (1 duplicate skipped).
> l1_dist(Id, Dist) :- vectors(Id, V), query(Q), Dist = manhattan(V, Q).
No results.
(session: 1 rule(s))
> ?- l1_dist(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_manhattan
Knowledge graph 'test_vec_manhattan' dropped.
