Executing script: examples/datalog/16_vectors/05_vec_operations.dl

> .db create test_vec_ops
Database 'test_vec_ops' created.
Switched to database: test_vec_ops
> .db use test_vec_ops
Switched to database: test_vec_ops
> +vectors[(1, [3.0, 4.0]), (2, [1.0, 0.0])].
Inserted 2 facts into 'vectors'.
> vec_info(Id, Dim) :- vectors(Id, V), Dim = vec_dim(V).
2 rows:
  (1, 2)
  (2, 2)
(session: 1 rule(s))
> ?- vec_info(X, Y).
2 rows:
  (1, 2)
  (2, 2)
> .db use default
Switched to database: default
(Cleared 1 session rule(s))
> .db drop test_vec_ops
Database 'test_vec_ops' dropped.
