Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_ops
Knowledge graph 'test_vec_ops' created.
Switched to knowledge graph: test_vec_ops
> .kg use test_vec_ops
Switched to knowledge graph: test_vec_ops
> +vectors[(1, [3.0, 4.0]), (2, [1.0, 0.0])].
No facts inserted (2 duplicate skipped).
> vec_info(Id, Dim) :- vectors(Id, V), Dim = vec_dim(V).
No results.
(session: 1 rule(s))
> ?- vec_info(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_ops
Knowledge graph 'test_vec_ops' dropped.
