Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_vec_n16t06
Knowledge graph 'test_empty_vec_n16t06' created.
Switched to knowledge graph: test_empty_vec_n16t06
> .kg use test_empty_vec_n16t06
Switched to knowledge graph: test_empty_vec_n16t06
> +empty_embed[(1, [1.0])].
Inserted 1 fact(s) into 'empty_embed'.
> ?- empty_embed(Id, V).
1 rows:
  (1, [Number(1.0)])
> +small_vec[(1, [0.5])].
Inserted 1 fact(s) into 'small_vec'.
> ?- small_vec(Id, V).
1 rows:
  (1, [Number(0.5)])
> +vecs_1d[(1, [0.1]), (2, [0.9])].
Inserted 2 fact(s) into 'vecs_1d'.
> ?- vecs_1d(Id1, V1), vecs_1d(Id2, V2), Id1 < Id2, D = euclidean(V1, V2).
1 rows:
  (1, [Number(0.10000000149011612)], 2, [Number(0.8999999761581421)], 0.799999953806399)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty_vec_n16t06
Knowledge graph 'test_empty_vec_n16t06' dropped.
