Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_vec_n16t06
Knowledge graph 'test_empty_vec_n16t06' created.
Switched to knowledge graph: test_empty_vec_n16t06
> .kg use test_empty_vec_n16t06
Switched to knowledge graph: test_empty_vec_n16t06
> +empty_embed[(1, [1.0])]
Inserted 1 fact(s) into 'empty_embed'.
> ?empty_embed(Id, V)
┌──────┬───────┐
│ col0 │ col1  │
├──────┼───────┤
│    1 │ [1.0] │
└──────┴───────┘
1 rows
> +small_vec[(1, [0.5])]
Inserted 1 fact(s) into 'small_vec'.
> ?small_vec(Id, V)
┌──────┬───────┐
│ col0 │ col1  │
├──────┼───────┤
│    1 │ [0.5] │
└──────┴───────┘
1 rows
> +vecs_1d[(1, [0.1]), (2, [0.9])]
Inserted 2 fact(s) into 'vecs_1d'.
