Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_norm_n16t07
Knowledge graph 'test_vec_norm_n16t07' created.
Switched to knowledge graph: test_vec_norm_n16t07
> .kg use test_vec_norm_n16t07
Switched to knowledge graph: test_vec_norm_n16t07
> +vectors[(1, [3.0, 4.0]), (2, [1.0, 0.0]), (3, [0.0, 0.0])].
Inserted 3 fact(s) into 'vectors'.
> normalized(Id, Norm) :- vectors(Id, V), Norm = normalize(V).
3 rows:
  (1, [Number(0.6000000238418579), Number(0.800000011920929)])
  (2, [Number(1.0), Number(0.0)])
  (3, [Number(0.0), Number(0.0)])
(session: 1 rule(s))
> ?- normalized(Id, Norm).
3 rows:
  (1, [Number(0.6000000238418579), Number(0.800000011920929)])
  (2, [Number(1.0), Number(0.0)])
  (3, [Number(0.0), Number(0.0)])
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_norm_n16t07
Knowledge graph 'test_vec_norm_n16t07' dropped.
