Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_scale
Knowledge graph 'test_vec_scale' created.
Switched to knowledge graph: test_vec_scale
> .kg use test_vec_scale
Switched to knowledge graph: test_vec_scale
> +vectors[(1, [1.0, 2.0, 3.0], 2.0)].
Inserted 1 fact(s) into 'vectors'.
> +vectors[(2, [5.0, 10.0], 0.5)].
Inserted 1 fact(s) into 'vectors'.
> +vectors[(3, [1.0, 1.0, 1.0], 0.0)].
Inserted 1 fact(s) into 'vectors'.
> scaled(Id, Result) :- vectors(Id, V, S), Result = vec_scale(V, S).
3 rows:
  (1, [Number(2.0), Number(4.0), Number(6.0)])
  (2, [Number(2.5), Number(5.0)])
  (3, [Number(0.0), Number(0.0), Number(0.0)])
(session: 1 rule(s))
> ?- scaled(Id, Result).
3 rows:
  (1, [Number(2.0), Number(4.0), Number(6.0)])
  (2, [Number(2.5), Number(5.0)])
  (3, [Number(0.0), Number(0.0), Number(0.0)])
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_scale
Knowledge graph 'test_vec_scale' dropped.
