Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_nan_n16t11
Knowledge graph 'test_vec_nan_n16t11' created.
Switched to knowledge graph: test_vec_nan_n16t11
> .kg use test_vec_nan_n16t11
Switched to knowledge graph: test_vec_nan_n16t11
> +vecs[(1, [1.0, 2.0, 3.0]), (2, [4.0, 5.0, 6.0])]
Inserted 2 fact(s) into 'vecs'.
> dist(Id1, Id2, D) <- vecs(Id1, V1), vecs(Id2, V2), Id1 < Id2, D = euclidean(V1, V2)
┌───┬───┬───────────────────┐
│ X │ Y │ Z                 │
├───┼───┼───────────────────┤
│ 1 │ 2 │ 5.196152422706632 │
└───┴───┴───────────────────┘
1 rows
(session: 1 rule(s))
> ?dist(Id1, Id2, D)
┌─────┬─────┬───────────────────┐
│ Id1 │ Id2 │ D                 │
├─────┼─────┼───────────────────┤
│   1 │   2 │ 5.196152422706632 │
└─────┴─────┴───────────────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_nan_n16t11
Knowledge graph 'test_vec_nan_n16t11' dropped.
