Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_eq_n16t15
Knowledge graph 'test_vec_eq_n16t15' created.
Switched to knowledge graph: test_vec_eq_n16t15
> .kg use test_vec_eq_n16t15
Switched to knowledge graph: test_vec_eq_n16t15
> +data[(1, [1, 2, 3]), (2, [4, 5, 6]), (3, [1, 2, 3])]
Inserted 3 fact(s) into 'data'.
> matching(Id, V) <- data(Id, V), data(1, V)
┌──────┬─────────────────┐
│ col0 │ col1            │
├──────┼─────────────────┤
│    1 │ [1.0, 2.0, 3.0] │
│    3 │ [1.0, 2.0, 3.0] │
└──────┴─────────────────┘
2 rows
(session: 1 rule(s))
> ?matching(Id, V)
┌──────┬─────────────────┐
│ col0 │ col1            │
├──────┼─────────────────┤
│    1 │ [1.0, 2.0, 3.0] │
│    3 │ [1.0, 2.0, 3.0] │
└──────┴─────────────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_eq_n16t15
Knowledge graph 'test_vec_eq_n16t15' dropped.
