Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_pairwise_sim_n16t17
Knowledge graph 'test_pairwise_sim_n16t17' created.
Switched to knowledge graph: test_pairwise_sim_n16t17
> .kg use test_pairwise_sim_n16t17
Switched to knowledge graph: test_pairwise_sim_n16t17
> +embedding[(1, [1.0, 0.0, 0.0]), (2, [0.0, 1.0, 0.0]), (3, [0.7, 0.7, 0.0])].
Inserted 3 fact(s) into 'embedding'.
> pairwise(Id1, Id2, Sim) :- embedding(Id1, V1), embedding(Id2, V2), Id1 < Id2, Sim = cosine(V1, V2).
3 rows:
  (1, 2, 1.0)
  (1, 3, 0.292893216233033)
  (2, 3, 0.292893216233033)
(session: 1 rule(s))
> ?- pairwise(X, Y, Z).
3 rows:
  (1, 2, 1.0)
  (1, 3, 0.292893216233033)
  (2, 3, 0.292893216233033)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_pairwise_sim_n16t17
Knowledge graph 'test_pairwise_sim_n16t17' dropped.
