Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_rule_n16t19
Knowledge graph 'test_vec_rule_n16t19' created.
Switched to knowledge graph: test_vec_rule_n16t19
> .kg use test_vec_rule_n16t19
Switched to knowledge graph: test_vec_rule_n16t19
> +data[(1, [1, 2, 3]), (2, [4, 5, 6])]
Inserted 2 fact(s) into 'data'.
> has_vector(Id, V) <- data(Id, V)
┌───┬─────────────────┐
│ X │ Y               │
├───┼─────────────────┤
│ 1 │ [1.0, 2.0, 3.0] │
│ 2 │ [4.0, 5.0, 6.0] │
└───┴─────────────────┘
2 rows
(session: 1 rule(s))
> ?has_vector(Id, V)
┌────┬─────────────────┐
│ Id │ V               │
├────┼─────────────────┤
│  1 │ [1.0, 2.0, 3.0] │
│  2 │ [4.0, 5.0, 6.0] │
└────┴─────────────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_vec_rule_n16t19
Knowledge graph 'test_vec_rule_n16t19' dropped.
