Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_vec_const_n16t20
Knowledge graph 'test_vec_const_n16t20' created.
Switched to knowledge graph: test_vec_const_n16t20
> .kg use test_vec_const_n16t20
Switched to knowledge graph: test_vec_const_n16t20
> +vectors[(1, [1, 2, 3]), (2, [4, 5, 6]), (3, [1, 2, 3])]
Inserted 3 fact(s) into 'vectors'.
> ?vectors(Id, [1, 2, 3])
┌────┬─────────────────┐
│ Id │ _v1             │
├────┼─────────────────┤
│  1 │ [1.0, 2.0, 3.0] │
│  2 │ [4.0, 5.0, 6.0] │
│  3 │ [1.0, 2.0, 3.0] │
└────┴─────────────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_vec_const_n16t20
Knowledge graph 'test_vec_const_n16t20' dropped.
