Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_vec_n16t21
Knowledge graph 'test_empty_vec_n16t21' created.
Switched to knowledge graph: test_empty_vec_n16t21
> .kg use test_empty_vec_n16t21
Switched to knowledge graph: test_empty_vec_n16t21
> +empty_vec[(1, []), (2, [])].
Inserted 2 fact(s) into 'empty_vec'.
> ?- empty_vec(Id, V).
2 rows:
  (1, [])
  (2, [])
> dist(Id1, Id2, D) :- empty_vec(Id1, V1), empty_vec(Id2, V2), Id1 < Id2, D = euclidean(V1, V2).
1 rows:
  (1, 2, -0.0)
(session: 1 rule(s))
> ?- dist(Id1, Id2, D).
1 rows:
  (1, 2, -0.0)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_empty_vec_n16t21
Knowledge graph 'test_empty_vec_n16t21' dropped.
