Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_single_elem_n16t24
Knowledge graph 'test_single_elem_n16t24' created.
Switched to knowledge graph: test_single_elem_n16t24
> .kg use test_single_elem_n16t24
Switched to knowledge graph: test_single_elem_n16t24
> +scalar[(1, [5.0]), (2, [3.0]), (3, [-2.0])]
Inserted 3 fact(s) into 'scalar'.
> dist(Id1, Id2, D) <- scalar(Id1, V1), scalar(Id2, V2), Id1 < Id2, D = euclidean(V1, V2)
┌───┬───┬─────┐
│ X │ Y │ Z   │
├───┼───┼─────┤
│ 1 │ 2 │ 2.0 │
│ 1 │ 3 │ 7.0 │
│ 2 │ 3 │ 5.0 │
└───┴───┴─────┘
3 rows
(session: 1 rule(s))
> ?dist(Id1, Id2, D)
┌─────┬─────┬─────┐
│ Id1 │ Id2 │ D   │
├─────┼─────┼─────┤
│   1 │   2 │ 2.0 │
│   1 │   3 │ 7.0 │
│   2 │   3 │ 5.0 │
└─────┴─────┴─────┘
3 rows
> cos(Id1, Id2, S) <- scalar(Id1, V1), scalar(Id2, V2), Id1 < Id2, S = cosine(V1, V2)
┌───┬───┬─────┐
│ X │ Y │ Z   │
├───┼───┼─────┤
│ 1 │ 2 │ 0.0 │
│ 1 │ 3 │ 2.0 │
│ 2 │ 3 │ 2.0 │
└───┴───┴─────┘
3 rows
(session: 2 rule(s))
> ?cos(Id1, Id2, S)
┌─────┬─────┬─────┐
│ Id1 │ Id2 │ S   │
├─────┼─────┼─────┤
│   1 │   2 │ 0.0 │
│   1 │   3 │ 2.0 │
│   2 │   3 │ 2.0 │
└─────┴─────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_single_elem_n16t24
Knowledge graph 'test_single_elem_n16t24' dropped.
