Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_kg
Knowledge graph 'test_kg' created.
Switched to knowledge graph: test_kg
> .kg use test_kg
Switched to knowledge graph: test_kg
> .kg
Current knowledge graph: test_kg
> .kg list
Knowledge Graphs:
  default
  test_kg *
> +edge(1, 2).
Inserted 1 fact(s) into 'edge'.
> ?- edge(X, Y).
1 rows:
  (1, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_kg
Knowledge graph 'test_kg' dropped.
> .kg list
Knowledge Graphs:
  default *
