Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_kg_n01t01
Knowledge graph 'test_kg_n01t01' created.
Switched to knowledge graph: test_kg_n01t01
> .kg use test_kg_n01t01
Switched to knowledge graph: test_kg_n01t01
> .kg
Current knowledge graph: test_kg_n01t01
> .kg list
Knowledge Graphs:
  default
  test_kg_n01t01 *
> +edge(1, 2)
Inserted 1 fact(s) into 'edge'.
> ?edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
└──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_kg_n01t01
Knowledge graph 'test_kg_n01t01' dropped.
> .kg list
Knowledge Graphs:
  default *
