Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create kg_list_test1_n01t02
Knowledge graph 'kg_list_test1_n01t02' created.
Switched to knowledge graph: kg_list_test1_n01t02
> .kg create kg_list_test2_n01t02
Knowledge graph 'kg_list_test2_n01t02' created.
Switched to knowledge graph: kg_list_test2_n01t02
> .kg create kg_list_test3_n01t02
Knowledge graph 'kg_list_test3_n01t02' created.
Switched to knowledge graph: kg_list_test3_n01t02
> .kg list
Knowledge Graphs:
  default
  kg_list_test1_n01t02
  kg_list_test2_n01t02
  kg_list_test3_n01t02 *
> .kg use kg_list_test1_n01t02
Switched to knowledge graph: kg_list_test1_n01t02
> +data[(1), (2), (3)].
Inserted 3 fact(s) into 'data'.
> ?- data(X).
3 rows:
  (1)
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
> .kg drop kg_list_test1_n01t02
Knowledge graph 'kg_list_test1_n01t02' dropped.
> .kg drop kg_list_test2_n01t02
Knowledge graph 'kg_list_test2_n01t02' dropped.
> .kg drop kg_list_test3_n01t02
Knowledge graph 'kg_list_test3_n01t02' dropped.
> .kg list
Knowledge Graphs:
  default *
