Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create kg_list_test1
Knowledge graph 'kg_list_test1' created.
Switched to knowledge graph: kg_list_test1
> .kg create kg_list_test2
Knowledge graph 'kg_list_test2' created.
Switched to knowledge graph: kg_list_test2
> .kg create kg_list_test3
Knowledge graph 'kg_list_test3' created.
Switched to knowledge graph: kg_list_test3
> .kg list
Knowledge Graphs:
  default
  kg_list_test1
  kg_list_test2
  kg_list_test3 *
> .kg use kg_list_test1
Switched to knowledge graph: kg_list_test1
> +data[(1), (2), (3)].
Inserted 3 fact(s) into 'data'.
> ?- data(X).
3 rows:
  (1)
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
> .kg drop kg_list_test1
Knowledge graph 'kg_list_test1' dropped.
> .kg drop kg_list_test2
Knowledge graph 'kg_list_test2' dropped.
> .kg drop kg_list_test3
Knowledge graph 'kg_list_test3' dropped.
> .kg list
Knowledge Graphs:
  default *
