Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_cmd_n01t03
Knowledge graph 'test_rel_cmd_n01t03' created.
Switched to knowledge graph: test_rel_cmd_n01t03
> .kg use test_rel_cmd_n01t03
Switched to knowledge graph: test_rel_cmd_n01t03
> +users[(1, "Alice"), (2, "Bob")]
Inserted 2 fact(s) into 'users'.
> +products[(100, "Widget", 9.99), (200, "Gadget", 19.99)]
Inserted 2 fact(s) into 'products'.
> .rel
Relations:
  products (arity: 3)
  users (arity: 2)
> .rel users
Relation: users
┌──────┬─────────┐
│ col0 │ col1    │
├──────┼─────────┤
│    1 │ "Alice" │
│    2 │ "Bob"   │
└──────┴─────────┘
2 of 2 total rows
> .rel products
Relation: products
┌──────┬──────────┬───────┐
│ col0 │ col1     │ col2  │
├──────┼──────────┼───────┤
│  100 │ "Widget" │  9.99 │
│  200 │ "Gadget" │ 19.99 │
└──────┴──────────┴───────┘
2 of 2 total rows
> +orders(id: int, user_id: int, product_id: int)
Script error: Query execution failed: Invalid term: 'id: int'
