Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_cmd
Knowledge graph 'test_rel_cmd' created.
Switched to knowledge graph: test_rel_cmd
> .kg use test_rel_cmd
Switched to knowledge graph: test_rel_cmd
> +users[(1, "Alice"), (2, "Bob")].
Inserted 2 fact(s) into 'users'.
> +products[(100, "Widget", 9.99), (200, "Gadget", 19.99)].
Inserted 2 fact(s) into 'products'.
> .rel
Relations:
  products (arity: 3)
  users (arity: 2)
> .rel users
Relation: users
  Columns: ["col0", "col1"]
  Total rows: 2
  Preview (first 2):
    (1, "Alice")
    (2, "Bob")
> .rel products
Relation: products
  Columns: ["col0", "col1", "col2"]
  Total rows: 2
  Preview (first 2):
    (100, "Widget", 9.99)
    (200, "Gadget", 19.99)
> +orders(id: int, user_id: int, product_id: int).
Schema 'orders' declared (persistent).
> +orders[(1, 1, 100), (2, 2, 200)].
Inserted 2 fact(s) into 'orders'.
> .rel
Relations:
  orders (arity: 3)
  products (arity: 3)
  users (arity: 2)
> .rel orders
Relation: orders
  Columns: ["col0", "col1", "col2"]
  Total rows: 2
  Preview (first 2):
    (1, 1, 100)
    (2, 2, 200)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_cmd
Knowledge graph 'test_rel_cmd' dropped.
