Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_current_n01t05
Knowledge graph 'test_drop_current_n01t05' created.
Switched to knowledge graph: test_drop_current_n01t05
> .kg use test_drop_current_n01t05
Switched to knowledge graph: test_drop_current_n01t05
> +test_data[(1, "data")].
Inserted 1 fact(s) into 'test_data'.
> ?- test_data(X, Y).
1 rows:
  (1, "data")
> .kg drop test_drop_current_n01t05
Script error: Cannot drop current knowledge graph. Switch to another first.
