Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_iso_a_n01t06
Knowledge graph 'test_iso_a_n01t06' created.
Switched to knowledge graph: test_iso_a_n01t06
> .kg use test_iso_a_n01t06
Switched to knowledge graph: test_iso_a_n01t06
> +data[(1, "a"), (2, "b")].
Inserted 2 fact(s) into 'data'.
> ?- data(Id, Val).
2 rows:
  (1, "a")
  (2, "b")
> .kg create test_iso_b_n01t06
Knowledge graph 'test_iso_b_n01t06' created.
Switched to knowledge graph: test_iso_b_n01t06
> .kg use test_iso_b_n01t06
Switched to knowledge graph: test_iso_b_n01t06
> ?- data(Id, Val).
No results.
> +data[(99, "z")].
Inserted 1 fact(s) into 'data'.
> ?- data(Id, Val).
1 rows:
  (99, "z")
> .kg use test_iso_a_n01t06
Switched to knowledge graph: test_iso_a_n01t06
> ?- data(Id, Val).
2 rows:
  (1, "a")
  (2, "b")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_iso_a_n01t06
Knowledge graph 'test_iso_a_n01t06' dropped.
> .kg drop test_iso_b_n01t06
Knowledge graph 'test_iso_b_n01t06' dropped.
