Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_kg_a_n01t08
Knowledge graph 'test_kg_a_n01t08' created.
Switched to knowledge graph: test_kg_a_n01t08
> .kg use test_kg_a_n01t08
Switched to knowledge graph: test_kg_a_n01t08
> +data[(1,)]
Inserted 1 fact(s) into 'data'.
> temp(X, Y) <- data(X), Y = X * 2
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
└───┴───┘
1 rows
(session: 1 rule(s))
> ?temp(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
└───┴───┘
1 rows
> .kg create test_kg_b_n01t08
Knowledge graph 'test_kg_b_n01t08' created.
Switched to knowledge graph: test_kg_b_n01t08
(Cleared 1 session rule(s), 0 session fact(s))
> .kg use test_kg_b_n01t08
Switched to knowledge graph: test_kg_b_n01t08
> ?temp(X, Y)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_kg_a_n01t08
Knowledge graph 'test_kg_a_n01t08' dropped.
> .kg drop test_kg_b_n01t08
Knowledge graph 'test_kg_b_n01t08' dropped.
