Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create kg_a_n01t08
Knowledge graph 'kg_a_n01t08' created.
Switched to knowledge graph: kg_a_n01t08
> .kg use kg_a_n01t08
Switched to knowledge graph: kg_a_n01t08
> +data[(1,)].
Inserted 1 fact(s) into 'data'.
> temp(X, Y) :- data(X), Y = X * 2.
1 rows:
  (1, 2)
(session: 1 rule(s))
> ?- temp(X, Y).
1 rows:
  (1, 2)
> .kg create kg_b_n01t08
Knowledge graph 'kg_b_n01t08' created.
Switched to knowledge graph: kg_b_n01t08
> .kg use kg_b_n01t08
Switched to knowledge graph: kg_b_n01t08
(Cleared 1 session rule(s), 0 session fact(s))
> ?- temp(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop kg_a_n01t08
Knowledge graph 'kg_a_n01t08' dropped.
> .kg drop kg_b_n01t08
Knowledge graph 'kg_b_n01t08' dropped.
