Executing script: examples/datalog/17_view_commands/01_view_list.dl

> .db create test_view_list
Database 'test_view_list' created.
Switched to database: test_view_list
> .db use test_view_list
Switched to database: test_view_list
> +edge[(1,2), (2,3)].
Inserted 2 facts into 'edge'.
> +reverse(X, Y) :- edge(Y, X).
Rule 'reverse' registered.
> +paths(X, Y) :- edge(X, Y).
Rule 'paths' registered.
> +paths(X, Z) :- paths(X, Y), edge(Y, Z).
Rule added to 'paths' (2 rules total).
> .view
Rules:
  paths
  reverse
> .db use default
Switched to database: default
> .db drop test_view_list
Database 'test_view_list' dropped.
