Executing script: examples/datalog/17_view_commands/03_view_drop.dl

> .db create test_view_drop
Database 'test_view_drop' created.
Switched to database: test_view_drop
> .db use test_view_drop
Switched to database: test_view_drop
> +edge[(1,2), (2,3)].
Inserted 2 facts into 'edge'.
> +reverse(X, Y) :- edge(Y, X).
Rule 'reverse' registered.
> +paths(X, Y) :- edge(X, Y).
Rule 'paths' registered.
> .view
Rules:
  paths
  reverse
> .view drop reverse
Rule 'reverse' dropped.
> .view
Rules:
  paths
> .db use default
Switched to database: default
> .db drop test_view_drop
Database 'test_view_drop' dropped.
