
> .db create test_view_drop
Database 'test_view_drop' created.
Switched to database: test_view_drop
> .db use test_view_drop
Switched to database: test_view_drop
> +edge[(1,2), (2,3)].
Inserted 2 facts into 'edge'.
> reverse(X, Y) := edge(Y, X).
View 'reverse' registered.
> paths(X, Y) := edge(X, Y).
View 'paths' registered.
> .view
Views:
  paths
  reverse
> .view drop reverse
View 'reverse' dropped.
> .view
Views:
  paths
> .db use default
Switched to database: default
> .db drop test_view_drop
Database 'test_view_drop' dropped.
