Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_join_n06t01
Knowledge graph 'test_join_n06t01' created.
Switched to knowledge graph: test_join_n06t01
> .kg use test_join_n06t01
Switched to knowledge graph: test_join_n06t01
> +employee[(1, 100), (2, 100), (3, 200), (4, 200)]
Inserted 4 fact(s) into 'employee'.
> +department[(100, 10), (200, 20)]
Inserted 2 fact(s) into 'department'.
> +emp_dept(EmpId, DeptName) <- employee(EmpId, DeptId), department(DeptId, DeptName)
Rule 'emp_dept' registered.
> ?emp_dept(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │   10 │
│    2 │   10 │
│    3 │   20 │
│    4 │   20 │
└──────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_join_n06t01
Knowledge graph 'test_join_n06t01' dropped.
