Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_n06t02
Knowledge graph 'test_self_n06t02' created.
Switched to knowledge graph: test_self_n06t02
> .kg use test_self_n06t02
Switched to knowledge graph: test_self_n06t02
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> +path2(X, Z) <- edge(X, Y), edge(Y, Z)
Rule 'path2' registered.
> ?path2(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
│    2 │    4 │
└──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_self_n06t02
Knowledge graph 'test_self_n06t02' dropped.
