Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_tri_n06t03
Knowledge graph 'test_tri_n06t03' created.
Switched to knowledge graph: test_tri_n06t03
> .kg use test_tri_n06t03
Switched to knowledge graph: test_tri_n06t03
> +edge[(1,2), (2,3), (3,1)]
Inserted 3 fact(s) into 'edge'.
> +edge[(4,5), (5,6)]
Inserted 2 fact(s) into 'edge'.
> +triangle(A, B, C) <- edge(A, B), edge(B, C), edge(C, A)
Rule 'triangle' registered.
> ?triangle(X, Y, Z)
┌───┬───┬───┐
│ X │ Y │ Z │
├───┼───┼───┤
│ 1 │ 2 │ 3 │
│ 2 │ 3 │ 1 │
│ 3 │ 1 │ 2 │
└───┴───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_tri_n06t03
Knowledge graph 'test_tri_n06t03' dropped.
