
> .db create test_tri
Database 'test_tri' created.
Switched to database: test_tri
> .db use test_tri
Switched to database: test_tri
> +edge[(1,2), (2,3), (3,1)].
Inserted 3 facts into 'edge'.
> +edge[(4,5), (5,6)].
Inserted 2 facts into 'edge'.
> triangle(A, B, C) := edge(A, B), edge(B, C), edge(C, A).
View 'triangle' registered.
> ?- triangle(X, Y, Z).
3 rows:
  (1, 2, 3)
  (2, 3, 1)
  (3, 1, 2)
> .db use default
Switched to database: default
> .db drop test_tri
Database 'test_tri' dropped.
