Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_multi_n06t04
Knowledge graph 'test_multi_n06t04' created.
Switched to knowledge graph: test_multi_n06t04
> .kg use test_multi_n06t04
Switched to knowledge graph: test_multi_n06t04
> +a[(1, 2), (10, 20)]
Inserted 2 fact(s) into 'a'.
> +b[(2, 3), (20, 30)]
Inserted 2 fact(s) into 'b'.
> +c[(3, 4), (30, 40)]
Inserted 2 fact(s) into 'c'.
> +d[(4, 5), (40, 50)]
Inserted 2 fact(s) into 'd'.
> +chain(W, Z) <- a(W, X), b(X, Y), c(Y, Z)
Rule 'chain' registered.
> ?chain(X, Y)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  1 │  4 │
│ 10 │ 40 │
└────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_n06t04
Knowledge graph 'test_multi_n06t04' dropped.
