Executing script: examples/datalog/06_joins/05_chain_join.dl

> .db create test_chain_join
Database 'test_chain_join' created.
Switched to database: test_chain_join
> .db use test_chain_join
Switched to database: test_chain_join
> +a_to_b[(1, 10), (2, 20), (3, 30)].
Inserted 3 facts into 'a_to_b'.
> +b_to_c[(10, 100), (20, 200), (30, 300)].
Inserted 3 facts into 'b_to_c'.
> +c_to_d[(100, 1000), (200, 2000), (300, 3000)].
Inserted 3 facts into 'c_to_d'.
> +chain2(A, C) :- a_to_b(A, B), b_to_c(B, C).
Rule 'chain2' registered.
> ?- chain2(X, Y).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> +chain3(A, D) :- a_to_b(A, B), b_to_c(B, C), c_to_d(C, D).
Rule 'chain3' registered.
> ?- chain3(X, Y).
3 rows:
  (1, 1000)
  (2, 2000)
  (3, 3000)
> .db use default
Switched to database: default
> .db drop test_chain_join
Database 'test_chain_join' dropped.
