Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_chain_join
Knowledge graph 'test_chain_join' created.
Switched to knowledge graph: test_chain_join
> .kg use test_chain_join
Switched to knowledge graph: test_chain_join
> +a_to_b[(1, 10), (2, 20), (3, 30)].
Inserted 3 fact(s) into 'a_to_b'.
> +b_to_c[(10, 100), (20, 200), (30, 300)].
Inserted 3 fact(s) into 'b_to_c'.
> +c_to_d[(100, 1000), (200, 2000), (300, 3000)].
Inserted 3 fact(s) into 'c_to_d'.
> +chain2(A, C) :- a_to_b(A, B), b_to_c(B, C).
Rule 'chain2' registered.
> ?- chain2(X, Y).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> +chain3(A, D) :- a_to_b(A, B), b_to_c(B, C), c_to_d(C, D).
Rule 'chain3' registered.
> ?- chain3(X, Y).
3 rows:
  (1, 1000)
  (2, 2000)
  (3, 3000)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_chain_join
Knowledge graph 'test_chain_join' dropped.
