Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_4way
Knowledge graph 'test_4way' created.
Switched to knowledge graph: test_4way
> .kg use test_4way
Switched to knowledge graph: test_4way
> +users[(1, "alice"), (2, "bob"), (3, "charlie")].
Inserted 3 fact(s) into 'users'.
> +emails[(1, "alice@mail.com"), (2, "bob@mail.com")].
Inserted 2 fact(s) into 'emails'.
> +roles[(1, "admin"), (2, "user"), (3, "guest")].
Inserted 3 fact(s) into 'roles'.
> +departments[(1, "engineering"), (2, "sales")].
Inserted 2 fact(s) into 'departments'.
> full_user_info(Name, Email, Role, Dept) :- users(Id, Name), emails(Id, Email), roles(Id, Role), departments(Id, Dept).
2 rows:
  ("alice", "alice@mail.com", "admin", "engineering")
  ("bob", "bob@mail.com", "user", "sales")
(session: 1 rule(s))
> ?- full_user_info(Name, Email, Role, Dept).
2 rows:
  ("alice", "alice@mail.com", "admin", "engineering")
  ("bob", "bob@mail.com", "user", "sales")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_4way
Knowledge graph 'test_4way' dropped.
