Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cross_n06t07
Knowledge graph 'test_cross_n06t07' created.
Switched to knowledge graph: test_cross_n06t07
> .kg use test_cross_n06t07
Switched to knowledge graph: test_cross_n06t07
> +colors[("red"), ("blue")]
Inserted 2 fact(s) into 'colors'.
> +shapes[("circle"), ("square")]
Inserted 2 fact(s) into 'shapes'.
> combinations(C, S) <- colors(C), shapes(S)
┌────────┬──────────┐
│ X      │ Y        │
├────────┼──────────┤
│ "blue" │ "circle" │
│ "blue" │ "square" │
│ "red"  │ "circle" │
│ "red"  │ "square" │
└────────┴──────────┘
4 rows
(session: 1 rule(s))
> ?combinations(C, S)
┌────────┬──────────┐
│ C      │ S        │
├────────┼──────────┤
│ "blue" │ "circle" │
│ "blue" │ "square" │
│ "red"  │ "circle" │
│ "red"  │ "square" │
└────────┴──────────┘
4 rows
> +sizes[("small"), ("large")]
Inserted 2 fact(s) into 'sizes'.
> all_combos(C, S, Z) <- colors(C), shapes(S), sizes(Z)
┌────────┬──────────┬─────────┐
│ X      │ Y        │ Z       │
├────────┼──────────┼─────────┤
│ "blue" │ "circle" │ "large" │
│ "blue" │ "circle" │ "small" │
│ "blue" │ "square" │ "large" │
│ "blue" │ "square" │ "small" │
│ "red"  │ "circle" │ "large" │
│ "red"  │ "circle" │ "small" │
│ "red"  │ "square" │ "large" │
│ "red"  │ "square" │ "small" │
└────────┴──────────┴─────────┘
8 rows
(session: 2 rule(s))
> ?all_combos(C, S, Z)
┌────────┬──────────┬─────────┐
│ C      │ S        │ Z       │
├────────┼──────────┼─────────┤
│ "blue" │ "circle" │ "large" │
│ "blue" │ "circle" │ "small" │
│ "blue" │ "square" │ "large" │
│ "blue" │ "square" │ "small" │
│ "red"  │ "circle" │ "large" │
│ "red"  │ "circle" │ "small" │
│ "red"  │ "square" │ "large" │
│ "red"  │ "square" │ "small" │
└────────┴──────────┴─────────┘
8 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_cross_n06t07
Knowledge graph 'test_cross_n06t07' dropped.
