Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_join_const_n06t08
Knowledge graph 'test_join_const_n06t08' created.
Switched to knowledge graph: test_join_const_n06t08
> .kg use test_join_const_n06t08
Switched to knowledge graph: test_join_const_n06t08
> +edges[(1, 2), (2, 3), (3, 4), (1, 4)].
Inserted 4 fact(s) into 'edges'.
> +nodes[(1, "start"), (2, "mid1"), (3, "mid2"), (4, "end")].
Inserted 4 fact(s) into 'nodes'.
> from_start(Y) :- edges(1, Y).
2 rows:
  (2)
  (4)
(session: 1 rule(s))
> ?- from_start(Y).
2 rows:
  (2)
  (4)
> paths_to_4(X) :- edges(X, 4).
2 rows:
  (1)
  (3)
(session: 2 rule(s))
> ?- paths_to_4(X).
2 rows:
  (1)
  (3)
> start_to_end_via(Mid, Name) :- edges(1, Mid), edges(Mid, 4), nodes(Mid, Name).
No results.
(session: 3 rule(s))
> ?- start_to_end_via(Mid, Name).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_join_const_n06t08
Knowledge graph 'test_join_const_n06t08' dropped.
