Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_col_join_n06t09
Knowledge graph 'test_multi_col_join_n06t09' created.
Switched to knowledge graph: test_multi_col_join_n06t09
> .kg use test_multi_col_join_n06t09
Switched to knowledge graph: test_multi_col_join_n06t09
> +orders[(1, 10, "pending"), (2, 20, "shipped"), (3, 30, "pending"), (4, 40, "delivered")]
Inserted 4 fact(s) into 'orders'.
> +order_status[(10, "pending", "new"), (20, "shipped", "in_transit"), (30, "pending", "approved")]
Inserted 3 fact(s) into 'order_status'.
> +order_info(Id, Amount, Status) <- orders(Id, Amount, Status)
Rule 'order_info' registered.
> +customers[(1, "Alice", "NY"), (2, "Bob", "CA"), (3, "Carol", "NY")]
Inserted 3 fact(s) into 'customers'.
> +regional_config[("NY", "east"), ("CA", "west")]
Inserted 2 fact(s) into 'regional_config'.
> +customer_region(Name, Region) <- customers(_, Name, Location), regional_config(Location, Region)
Rule 'customer_region' registered.
> ?customer_region(Name, Region)
┌─────────┬────────┐
│ col0    │ col1   │
├─────────┼────────┤
│ "Alice" │ "east" │
│ "Bob"   │ "west" │
│ "Carol" │ "east" │
└─────────┴────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_col_join_n06t09
Knowledge graph 'test_multi_col_join_n06t09' dropped.
