Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_diamond
Knowledge graph 'test_diamond' created.
Switched to knowledge graph: test_diamond
> .kg use test_diamond
Switched to knowledge graph: test_diamond
> +ab[(1, 10), (2, 20)].
Inserted 2 fact(s) into 'ab'.
> +ac[(1, 100), (2, 200)].
Inserted 2 fact(s) into 'ac'.
> +bd[(10, 1000), (20, 2000)].
Inserted 2 fact(s) into 'bd'.
> +cd[(100, 1000), (200, 2000)].
Inserted 2 fact(s) into 'cd'.
> diamond(A, B, C, D) :- ab(A, B), ac(A, C), bd(B, D), cd(C, D).
2 rows:
  (10, 1000, 100, 1)
  (20, 2000, 200, 2)
(session: 1 rule(s))
> ?- diamond(A, B, C, D).
2 rows:
  (10, 1000, 100, 1)
  (20, 2000, 200, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_diamond
Knowledge graph 'test_diamond' dropped.
