Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_diamond_n06t11
Knowledge graph 'test_diamond_n06t11' created.
Switched to knowledge graph: test_diamond_n06t11
> .kg use test_diamond_n06t11
Switched to knowledge graph: test_diamond_n06t11
> +ab[(1, 10), (2, 20)]
Inserted 2 fact(s) into 'ab'.
> +ac[(1, 100), (2, 200)]
Inserted 2 fact(s) into 'ac'.
> +bd[(10, 1000), (20, 2000)]
Inserted 2 fact(s) into 'bd'.
> +cd[(100, 1000), (200, 2000)]
Inserted 2 fact(s) into 'cd'.
> diamond(A, B, C, D) <- ab(A, B), ac(A, C), bd(B, D), cd(C, D)
┌───┬────┬─────┬──────┐
│ X │ Y  │ Z   │ W    │
├───┼────┼─────┼──────┤
│ 1 │ 10 │ 100 │ 1000 │
│ 2 │ 20 │ 200 │ 2000 │
└───┴────┴─────┴──────┘
2 rows
(session: 1 rule(s))
> ?diamond(A, B, C, D)
┌───┬────┬─────┬──────┐
│ A │ B  │ C   │ D    │
├───┼────┼─────┼──────┤
│ 1 │ 10 │ 100 │ 1000 │
│ 2 │ 20 │ 200 │ 2000 │
└───┴────┴─────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_diamond_n06t11
Knowledge graph 'test_diamond_n06t11' dropped.
