Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_asym_join_n06t12
Knowledge graph 'test_asym_join_n06t12' created.
Switched to knowledge graph: test_asym_join_n06t12
> .kg use test_asym_join_n06t12
Switched to knowledge graph: test_asym_join_n06t12
> +items[(1, "a"), (2, "b"), (3, "c"), (4, "d"), (5, "e"), (6, "f"), (7, "g")]
Inserted 7 fact(s) into 'items'.
> +selected[(2), (5)]
Inserted 2 fact(s) into 'selected'.
> matched(Id, Val) <- items(Id, Val), selected(Id)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 2 │ "b" │
│ 5 │ "e" │
└───┴─────┘
2 rows
(session: 1 rule(s))
> ?matched(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  2 │ "b" │
│  5 │ "e" │
└────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_asym_join_n06t12
Knowledge graph 'test_asym_join_n06t12' dropped.
