Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_five_join
Knowledge graph 'test_five_join' created.
Switched to knowledge graph: test_five_join
> .kg use test_five_join
Switched to knowledge graph: test_five_join
> +a[(1, 10), (2, 20)].
Inserted 2 fact(s) into 'a'.
> +b[(10, 100), (20, 200)].
Inserted 2 fact(s) into 'b'.
> +c[(100, 1000), (200, 2000)].
Inserted 2 fact(s) into 'c'.
> +d[(1000, 10000), (2000, 20000)].
Inserted 2 fact(s) into 'd'.
> +e[(10000, "final"), (20000, "done")].
Inserted 2 fact(s) into 'e'.
> five_join(A, B, C, D, E) :- a(X, A), b(A, B), c(B, C), d(C, D), e(D, E).
2 rows:
  (10, 100, 1000, 10000, "final")
  (20, 200, 2000, 20000, "done")
(session: 1 rule(s))
> ?- five_join(A, B, C, D, E).
2 rows:
  (10, 100, 1000, 10000, "final")
  (20, 200, 2000, 20000, "done")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_five_join
Knowledge graph 'test_five_join' dropped.
