Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_outer_sim
Knowledge graph 'test_outer_sim' created.
Switched to knowledge graph: test_outer_sim
> .kg use test_outer_sim
Switched to knowledge graph: test_outer_sim
> +employees[(1, "Alice"), (2, "Bob"), (3, "Carol")].
Inserted 3 fact(s) into 'employees'.
> +dept_assign[(1, "Engineering"), (3, "Sales")].
Inserted 2 fact(s) into 'dept_assign'.
> +emp_with_dept(Id, Name, Dept) :- employees(Id, Name), dept_assign(Id, Dept).
Rule 'emp_with_dept' registered.
> ?- emp_with_dept(I, N, D).
2 rows:
  (1, "Engineering", "Alice")
  (3, "Sales", "Carol")
> +emp_no_dept(Id, Name) :- employees(Id, Name), !dept_assign(Id, _).
Rule 'emp_no_dept' registered.
> ?- emp_no_dept(I, N).
1 rows:
  (2, "Bob")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_outer_sim
Knowledge graph 'test_outer_sim' dropped.
