Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_star_n06t15
Knowledge graph 'test_star_n06t15' created.
Switched to knowledge graph: test_star_n06t15
> .kg use test_star_n06t15
Switched to knowledge graph: test_star_n06t15
> +sales[(1, 100, 1000, "2024-01-01"), (2, 101, 1001, "2024-01-02"), (3, 100, 1000, "2024-01-03")]
Inserted 3 fact(s) into 'sales'.
> +products[(100, "Widget"), (101, "Gadget")]
Inserted 2 fact(s) into 'products'.
> +customers[(1000, "Alice"), (1001, "Bob")]
Inserted 2 fact(s) into 'customers'.
> full_report(SaleId, ProdName, CustName, Date) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> sales(SaleId, ProdId, CustId, Date),
Parse error: Expected parentheses: (SaleId, ProdId, CustId, Date),
> products(ProdId, ProdName),
Parse error: Expected parentheses: (ProdId, ProdName),
> customers(CustId, CustName)
Cannot insert variable 'CustId' - use constants only
> ?full_report(SaleId, ProdName, CustName, Date)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_star_n06t15
Knowledge graph 'test_star_n06t15' dropped.
