Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_star
Knowledge graph 'test_star' created.
Switched to knowledge graph: test_star
> .kg use test_star
Switched to knowledge graph: test_star
> +sales[(1, 100, 1000, "2024-01-01"), (2, 101, 1001, "2024-01-02"), (3, 100, 1000, "2024-01-03")].
Inserted 3 fact(s) into 'sales'.
> +products[(100, "Widget"), (101, "Gadget")].
Inserted 2 fact(s) into 'products'.
> +customers[(1000, "Alice"), (1001, "Bob")].
Inserted 2 fact(s) into 'customers'.
> full_report(SaleId, ProdName, CustName, Date) :- sales(SaleId, ProdId, CustId, Date), products(ProdId, ProdName), customers(CustId, CustName).
3 rows:
  (1, "Widget", "Alice", "2024-01-01")
  (2, "Gadget", "Bob", "2024-01-02")
  (3, "Widget", "Alice", "2024-01-03")
(session: 1 rule(s))
> ?- full_report(SaleId, ProdName, CustName, Date).
3 rows:
  (1, "Widget", "Alice", "2024-01-01")
  (2, "Gadget", "Bob", "2024-01-02")
  (3, "Widget", "Alice", "2024-01-03")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_star
Knowledge graph 'test_star' dropped.
