Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multikey_n06t19
Knowledge graph 'test_multikey_n06t19' created.
Switched to knowledge graph: test_multikey_n06t19
> .kg use test_multikey_n06t19
Switched to knowledge graph: test_multikey_n06t19
> +orders[(1, "2024", "Q1", 100), (2, "2024", "Q2", 200), (3, "2023", "Q1", 50)].
Inserted 3 fact(s) into 'orders'.
> +targets[(1, "2024", "Q1", 90), (2, "2024", "Q2", 150)].
Inserted 2 fact(s) into 'targets'.
> matched(OrdId, Year, Qtr, Actual, Target) :- orders(OrdId, Year, Qtr, Actual), targets(_, Year, Qtr, Target).
2 rows:
  (1, "2024", "Q1", 100, 90)
  (2, "2024", "Q2", 200, 150)
(session: 1 rule(s))
> ?- matched(OrdId, Year, Qtr, Actual, Target).
2 rows:
  (1, "2024", "Q1", 100, 90)
  (2, "2024", "Q2", 200, 150)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multikey_n06t19
Knowledge graph 'test_multikey_n06t19' dropped.
