Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_theta_n06t20
Knowledge graph 'test_theta_n06t20' created.
Switched to knowledge graph: test_theta_n06t20
> .kg use test_theta_n06t20
Switched to knowledge graph: test_theta_n06t20
> +products[(1, "Widget", 50), (2, "Gadget", 100), (3, "Gizmo", 75)]
Inserted 3 fact(s) into 'products'.
> +budgets[(1, "Alice", 80), (2, "Bob", 120)]
Inserted 2 fact(s) into 'budgets'.
> affordable(BuyerName, ProductName, Price, Budget) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> budgets(_, BuyerName, Budget),
Parse error: Expected parentheses: (_, BuyerName, Budget),
> products(_, ProductName, Price),
Parse error: Expected parentheses: (_, ProductName, Price),
> Price <= Budget
Parse error: Unrecognized statement: Price <= Budget
> ?affordable(BuyerName, ProductName, Price, Budget)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_theta_n06t20
Knowledge graph 'test_theta_n06t20' dropped.
