Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_three_join
Knowledge graph 'test_three_join' created.
Switched to knowledge graph: test_three_join
> .kg use test_three_join
Switched to knowledge graph: test_three_join
> +orders[(1, "Alice"), (2, "Bob"), (3, "Alice")].
Inserted 3 fact(s) into 'orders'.
> +items[(1, "Widget"), (2, "Gadget"), (3, "Widget")].
Inserted 3 fact(s) into 'items'.
> +prices[("Widget", 100), ("Gadget", 200)].
Inserted 2 fact(s) into 'prices'.
> order_details(OId, Name, Item, Price) :- orders(OId, Name), items(OId, Item), prices(Item, Price).
3 rows:
  ("Gadget", 200, 2, "Bob")
  ("Widget", 100, 1, "Alice")
  ("Widget", 100, 3, "Alice")
(session: 1 rule(s))
> ?- order_details(OId, Name, Item, Price).
3 rows:
  ("Gadget", 200, 2, "Bob")
  ("Widget", 100, 1, "Alice")
  ("Widget", 100, 3, "Alice")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_three_join
Knowledge graph 'test_three_join' dropped.
