Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_3chain
Knowledge graph 'test_3chain' created.
Switched to knowledge graph: test_3chain
> .kg use test_3chain
Switched to knowledge graph: test_3chain
> +a_to_b[(1, 10), (2, 20)].
Inserted 2 fact(s) into 'a_to_b'.
> +b_to_c[(10, 100), (20, 200)].
Inserted 2 fact(s) into 'b_to_c'.
> chain(A, B, C) :- a_to_b(A, B), b_to_c(B, C).
2 rows:
  (10, 100, 1)
  (20, 200, 2)
(session: 1 rule(s))
> ?- chain(A, B, C).
2 rows:
  (10, 100, 1)
  (20, 200, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_3chain
Knowledge graph 'test_3chain' dropped.
