Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_3chain_n06t24
Knowledge graph 'test_3chain_n06t24' created.
Switched to knowledge graph: test_3chain_n06t24
> .kg use test_3chain_n06t24
Switched to knowledge graph: test_3chain_n06t24
> +a_to_b[(1, 10), (2, 20)]
Inserted 2 fact(s) into 'a_to_b'.
> +b_to_c[(10, 100), (20, 200)]
Inserted 2 fact(s) into 'b_to_c'.
> chain(A, B, C) <- a_to_b(A, B), b_to_c(B, C)
┌───┬────┬─────┐
│ X │ Y  │ Z   │
├───┼────┼─────┤
│ 1 │ 10 │ 100 │
│ 2 │ 20 │ 200 │
└───┴────┴─────┘
2 rows
(session: 1 rule(s))
> ?chain(A, B, C)
┌───┬────┬─────┐
│ A │ B  │ C   │
├───┼────┼─────┤
│ 1 │ 10 │ 100 │
│ 2 │ 20 │ 200 │
└───┴────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_3chain_n06t24
Knowledge graph 'test_3chain_n06t24' dropped.
