Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_join_comp_n06t25
Knowledge graph 'test_join_comp_n06t25' created.
Switched to knowledge graph: test_join_comp_n06t25
> .kg use test_join_comp_n06t25
Switched to knowledge graph: test_join_comp_n06t25
> +items[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'items'.
> +multipliers[(10, 2), (20, 3), (30, 4)]
Inserted 3 fact(s) into 'multipliers'.
> joined(Id, V, M) <- items(Id, V), multipliers(V, M)
┌───┬────┬───┐
│ X │ Y  │ Z │
├───┼────┼───┤
│ 1 │ 10 │ 2 │
│ 2 │ 20 │ 3 │
│ 3 │ 30 │ 4 │
└───┴────┴───┘
3 rows
(session: 1 rule(s))
> ?joined(Id, V, M)
┌────┬────┬───┐
│ Id │ V  │ M │
├────┼────┼───┤
│  1 │ 10 │ 2 │
│  2 │ 20 │ 3 │
│  3 │ 30 │ 4 │
└────┴────┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_join_comp_n06t25
Knowledge graph 'test_join_comp_n06t25' dropped.
