Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_key
Knowledge graph 'test_multi_key' created.
Switched to knowledge graph: test_multi_key
> .kg use test_multi_key
Switched to knowledge graph: test_multi_key
> +left[(1, "a", 100), (2, "b", 200), (3, "a", 300)].
Inserted 3 fact(s) into 'left'.
> +right[(1, "a", "match1"), (2, "b", "match2"), (1, "b", "nomatch")].
Inserted 3 fact(s) into 'right'.
> joined(Id, Cat, Val, Label) :- left(Id, Cat, Val), right(Id, Cat, Label).
2 rows:
  (1, "a", "match1", 100)
  (2, "b", "match2", 200)
(session: 1 rule(s))
> ?- joined(Id, Cat, Val, Label).
2 rows:
  (1, "a", "match1", 100)
  (2, "b", "match2", 200)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multi_key
Knowledge graph 'test_multi_key' dropped.
