Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_partial_n06t27
Knowledge graph 'test_partial_n06t27' created.
Switched to knowledge graph: test_partial_n06t27
> .kg use test_partial_n06t27
Switched to knowledge graph: test_partial_n06t27
> +orders[(1, "Alice", 100), (2, "Bob", 200), (3, "Alice", 150)]
Inserted 3 fact(s) into 'orders'.
> +customers[("Alice", "VIP"), ("Bob", "Regular"), ("Carol", "New")]
Inserted 3 fact(s) into 'customers'.
> enriched(OrdId, Name, Amount, Status) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> orders(OrdId, Name, Amount),
Parse error: Expected parentheses: (OrdId, Name, Amount),
> customers(Name, Status)
Cannot insert variable 'Name' - use constants only
> ?enriched(OrdId, Name, Amount, Status)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_partial_n06t27
Knowledge graph 'test_partial_n06t27' dropped.
