Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ineq_join_n06t30
Knowledge graph 'test_ineq_join_n06t30' created.
Switched to knowledge graph: test_ineq_join_n06t30
> .kg use test_ineq_join_n06t30
Switched to knowledge graph: test_ineq_join_n06t30
> +ranges[(1, 10), (5, 20), (15, 30)].
Inserted 3 fact(s) into 'ranges'.
> +points[(3,), (12,), (25,), (35,)].
Inserted 4 fact(s) into 'points'.
> in_range(Start, End, P) :- ranges(Start, End), points(P), P >= Start, P <= End.
3 rows:
  (1, 10, 3)
  (5, 20, 12)
  (15, 30, 25)
(session: 1 rule(s))
> ?- in_range(Start, End, P).
3 rows:
  (1, 10, 3)
  (5, 20, 12)
  (15, 30, 25)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_ineq_join_n06t30
Knowledge graph 'test_ineq_join_n06t30' dropped.
