Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_key
Knowledge graph 'test_str_key' created.
Switched to knowledge graph: test_str_key
> .kg use test_str_key
Switched to knowledge graph: test_str_key
> +orders[("ord1", "Alice", 100), ("ord2", "Bob", 200), ("ord3", "Alice", 150)].
Inserted 3 fact(s) into 'orders'.
> +loyalty[("Alice", "Gold"), ("Bob", "Silver")].
Inserted 2 fact(s) into 'loyalty'.
> order_with_status(OrdId, Name, Amount, Status) :- orders(OrdId, Name, Amount), loyalty(Name, Status).
3 rows:
  ("Alice", "Gold", "ord1", 100)
  ("Alice", "Gold", "ord3", 150)
  ("Bob", "Silver", "ord2", 200)
(session: 1 rule(s))
> ?- order_with_status(OrdId, Name, Amount, Status).
3 rows:
  ("Alice", "Gold", "ord1", 100)
  ("Alice", "Gold", "ord3", 150)
  ("Bob", "Silver", "ord2", 200)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_str_key
Knowledge graph 'test_str_key' dropped.
