Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_str_key_n06t31
Knowledge graph 'test_str_key_n06t31' created.
Switched to knowledge graph: test_str_key_n06t31
> .kg use test_str_key_n06t31
Switched to knowledge graph: test_str_key_n06t31
> +orders[("ord1", "Alice", 100), ("ord2", "Bob", 200), ("ord3", "Alice", 150)]
Inserted 3 fact(s) into 'orders'.
> +loyalty[("Alice", "Gold"), ("Bob", "Silver")]
Inserted 2 fact(s) into 'loyalty'.
> order_with_status(OrdId, Name, Amount, Status) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> orders(OrdId, Name, Amount),
Parse error: Expected parentheses: (OrdId, Name, Amount),
> loyalty(Name, Status)
Cannot insert variable 'Name' - use constants only
> ?order_with_status(OrdId, Name, Amount, Status)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_key_n06t31
Knowledge graph 'test_str_key_n06t31' dropped.
