Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_key_n06t31
Knowledge graph 'test_str_key_n06t31' created.
Switched to knowledge graph: test_str_key_n06t31
> .kg use test_str_key_n06t31
Switched to knowledge graph: test_str_key_n06t31
> +orders[("ord1", "Alice", 100), ("ord2", "Bob", 200), ("ord3", "Alice", 150)].
Inserted 3 fact(s) into 'orders'.
> +loyalty[("Alice", "Gold"), ("Bob", "Silver")].
Inserted 2 fact(s) into 'loyalty'.
> order_with_status(OrdId, Name, Amount, Status) :- orders(OrdId, Name, Amount), loyalty(Name, Status).
3 rows:
  ("ord1", "Alice", 100, "Gold")
  ("ord2", "Bob", 200, "Silver")
  ("ord3", "Alice", 150, "Gold")
(session: 1 rule(s))
> ?- order_with_status(OrdId, Name, Amount, Status).
3 rows:
  ("ord1", "Alice", 100, "Gold")
  ("ord2", "Bob", 200, "Silver")
  ("ord3", "Alice", 150, "Gold")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_str_key_n06t31
Knowledge graph 'test_str_key_n06t31' dropped.
