Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_four_join
Knowledge graph 'test_four_join' created.
Switched to knowledge graph: test_four_join
> .kg use test_four_join
Switched to knowledge graph: test_four_join
> +orders[(1, 101, "2024-01")].
Inserted 1 fact(s) into 'orders'.
> +customers[(101, "Alice")].
Inserted 1 fact(s) into 'customers'.
> +products[(1, "Widget")].
Inserted 1 fact(s) into 'products'.
> +shipping[("2024-01", "Express")].
Inserted 1 fact(s) into 'shipping'.
> full_details(OrdId, CustName, ProdName, ShipType) :- orders(OrdId, CustId, Date), customers(CustId, CustName), products(OrdId, ProdName), shipping(Date, ShipType).
1 rows:
  (1, "Alice", "Widget", "Express")
(session: 1 rule(s))
> ?- full_details(OrdId, CustName, ProdName, ShipType).
1 rows:
  (1, "Alice", "Widget", "Express")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_four_join
Knowledge graph 'test_four_join' dropped.
