Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_five_join
Knowledge graph 'test_five_join' created.
Switched to knowledge graph: test_five_join
> .kg use test_five_join
Switched to knowledge graph: test_five_join
> +a[(1, "x")].
Inserted 1 fact(s) into 'a'.
> +b[("x", 100)].
Inserted 1 fact(s) into 'b'.
> +c[(100, "y")].
Inserted 1 fact(s) into 'c'.
> +d[("y", true)].
Inserted 1 fact(s) into 'd'.
> +e[(true, "final")].
Inserted 1 fact(s) into 'e'.
> joined(A1, A2, B2, C2, D2, E2) :- a(A1, A2), b(A2, B2), c(B2, C2), d(C2, D2), e(D2, E2).
1 rows:
  ("true", "final", "y", 100, "x", 1)
(session: 1 rule(s))
> ?- joined(A1, A2, B2, C2, D2, E2).
1 rows:
  ("true", "final", "y", 100, "x", 1)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_five_join
Knowledge graph 'test_five_join' dropped.
