Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_reflexive
Knowledge graph 'test_reflexive' created.
Switched to knowledge graph: test_reflexive
> .kg use test_reflexive
Switched to knowledge graph: test_reflexive
> +matrix[(1, 1), (1, 2), (2, 1), (2, 2), (3, 3)].
Inserted 5 fact(s) into 'matrix'.
> diagonal(X) :- matrix(X, X).
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> ?- diagonal(X).
3 rows:
  (1)
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_reflexive
Knowledge graph 'test_reflexive' dropped.
