Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_reflexive_n06t41
Knowledge graph 'test_reflexive_n06t41' created.
Switched to knowledge graph: test_reflexive_n06t41
> .kg use test_reflexive_n06t41
Switched to knowledge graph: test_reflexive_n06t41
> +matrix[(1, 1), (1, 2), (2, 1), (2, 2), (3, 3)]
Inserted 5 fact(s) into 'matrix'.
> diagonal(X) <- matrix(X, X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    3 │
└──────┘
3 rows
(session: 1 rule(s))
> ?diagonal(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    3 │
└──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_reflexive_n06t41
Knowledge graph 'test_reflexive_n06t41' dropped.
