Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cross_filter
Knowledge graph 'test_cross_filter' created.
Switched to knowledge graph: test_cross_filter
> .kg use test_cross_filter
Switched to knowledge graph: test_cross_filter
> +nums[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'nums'.
> +letters[("a",), ("b",)].
Inserted 2 fact(s) into 'letters'.
> cross_even(N, L) :- nums(N), letters(L), N ?- cross_even(N, L).
No results.
(session: 1 rule(s))
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cross_filter
Knowledge graph 'test_cross_filter' dropped.
