Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cart
Knowledge graph 'test_cart' created.
Switched to knowledge graph: test_cart
> .kg use test_cart
Switched to knowledge graph: test_cart
> +colors[("red",), ("blue",)].
Inserted 2 fact(s) into 'colors'.
> +sizes[("S",), ("M",), ("L",)].
Inserted 3 fact(s) into 'sizes'.
> variants(Color, Size) :- colors(Color), sizes(Size).
6 rows:
  ("blue", "L")
  ("blue", "M")
  ("blue", "S")
  ("red", "L")
  ("red", "M")
  ("red", "S")
(session: 1 rule(s))
> ?- variants(C, S).
6 rows:
  ("blue", "L")
  ("blue", "M")
  ("blue", "S")
  ("red", "L")
  ("red", "M")
  ("red", "S")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cart
Knowledge graph 'test_cart' dropped.
