Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_equi
Knowledge graph 'test_equi' created.
Switched to knowledge graph: test_equi
> .kg use test_equi
Switched to knowledge graph: test_equi
> +table_a[(1, "x"), (2, "y"), (3, "z")].
Inserted 3 fact(s) into 'table_a'.
> +table_b[(1, 100), (2, 200), (4, 400)].
Inserted 3 fact(s) into 'table_b'.
> +joined(Key, ValA, ValB) :- table_a(Key, ValA), table_b(Key, ValB).
Rule 'joined' registered.
> ?- joined(K, A, B).
2 rows:
  (1, 100, "x")
  (2, 200, "y")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_equi
Knowledge graph 'test_equi' dropped.
