Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_multi_key_n06t60
Knowledge graph 'test_multi_key_n06t60' created.
Switched to knowledge graph: test_multi_key_n06t60
> .kg use test_multi_key_n06t60
Switched to knowledge graph: test_multi_key_n06t60
> +table_a[(1, "x", "A"), (1, "y", "B"), (2, "x", "C")]
Inserted 3 fact(s) into 'table_a'.
> +table_b[(1, "x", 100), (1, "y", 200), (3, "z", 300)]
Inserted 3 fact(s) into 'table_b'.
> +joined(K1, K2, ValA, ValB) <- table_a(K1, K2, ValA), table_b(K1, K2, ValB)
Rule 'joined' registered.
> ?joined(K1, K2, A, B)
┌────┬─────┬─────┬─────┐
│ K1 │ K2  │ A   │ B   │
├────┼─────┼─────┼─────┤
│  1 │ "x" │ "A" │ 100 │
│  1 │ "y" │ "B" │ 200 │
└────┴─────┴─────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_key_n06t60
Knowledge graph 'test_multi_key_n06t60' dropped.
