Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_left_join
Knowledge graph 'test_left_join' created.
Switched to knowledge graph: test_left_join
> .kg use test_left_join
Switched to knowledge graph: test_left_join
> +employees[(1, "Alice"), (2, "Bob"), (3, "Carol")].
Inserted 3 fact(s) into 'employees'.
> +salaries[(1, 50000), (2, 60000)].
Inserted 2 fact(s) into 'salaries'.
> +with_salary(Id, Name, Salary) :- employees(Id, Name), salaries(Id, Salary).
Rule 'with_salary' registered.
> +without_salary(Id, Name) :- employees(Id, Name), !salaries(Id, _).
Rule 'without_salary' registered.
> ?- with_salary(Id, N, S).
2 rows:
  (1, 50000, "Alice")
  (2, 60000, "Bob")
> ?- without_salary(Id, N).
1 rows:
  (3, "Carol")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_left_join
Knowledge graph 'test_left_join' dropped.
