Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_full_outer_n06t62
Knowledge graph 'test_full_outer_n06t62' created.
Switched to knowledge graph: test_full_outer_n06t62
> .kg use test_full_outer_n06t62
Switched to knowledge graph: test_full_outer_n06t62
> +left_t[(1, "A"), (2, "B")]
Inserted 2 fact(s) into 'left_t'.
> +right_t[(2, 100), (3, 200)]
Inserted 2 fact(s) into 'right_t'.
> +inner_matched(K, L, R) <- left_t(K, L), right_t(K, R)
Rule 'inner_matched' registered.
> +left_only(K, L) <- left_t(K, L), !right_t(K, _)
Rule 'left_only' registered.
> +right_only(K, R) <- right_t(K, R), !left_t(K, _)
Rule 'right_only' registered.
> ?inner_matched(K, L, R)
┌───┬─────┬─────┐
│ K │ L   │ R   │
├───┼─────┼─────┤
│ 2 │ "B" │ 100 │
└───┴─────┴─────┘
1 rows
> ?left_only(K, L)
┌───┬─────┐
│ K │ L   │
├───┼─────┤
│ 1 │ "A" │
└───┴─────┘
1 rows
> ?right_only(K, R)
┌───┬─────┐
│ K │ R   │
├───┼─────┤
│ 3 │ 200 │
└───┴─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_full_outer_n06t62
Knowledge graph 'test_full_outer_n06t62' dropped.
