Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_non_equi
Knowledge graph 'test_non_equi' created.
Switched to knowledge graph: test_non_equi
> .kg use test_non_equi
Switched to knowledge graph: test_non_equi
> +items[(1, 100), (2, 200), (3, 150)].
Inserted 3 fact(s) into 'items'.
> +thresholds[(1, 120, "low"), (2, 180, "medium")].
Inserted 2 fact(s) into 'thresholds'.
> +below_threshold(ItemId, Price, Label) :- items(ItemId, Price), thresholds(_, Thresh, Label), Price < Thresh.
Rule 'below_threshold' registered.
> ?- below_threshold(I, P, L).
3 rows:
  (1, 100, "low")
  (1, 100, "medium")
  (3, 150, "medium")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_non_equi
Knowledge graph 'test_non_equi' dropped.
