Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_chain
Knowledge graph 'test_chain' created.
Switched to knowledge graph: test_chain
> .kg use test_chain
Switched to knowledge graph: test_chain
> +a_to_b[(1, 10), (2, 20)].
Inserted 2 fact(s) into 'a_to_b'.
> +b_to_c[(10, 100), (20, 200)].
Inserted 2 fact(s) into 'b_to_c'.
> +c_to_d[(100, 1000), (200, 2000)].
Inserted 2 fact(s) into 'c_to_d'.
> +chain(A, D) :- a_to_b(A, B), b_to_c(B, C), c_to_d(C, D).
Rule 'chain' registered.
> ?- chain(A, D).
2 rows:
  (1, 1000)
  (2, 2000)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_chain
Knowledge graph 'test_chain' dropped.
