Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_triple_join_n06t72
Knowledge graph 'test_triple_join_n06t72' created.
Switched to knowledge graph: test_triple_join_n06t72
> .kg use test_triple_join_n06t72
Switched to knowledge graph: test_triple_join_n06t72
> +employees[(1, "Alice", "dev"), (2, "Bob", "sales"), (3, "Carol", "dev")].
Inserted 3 fact(s) into 'employees'.
> +departments[("dev", "Development", 100), ("sales", "Sales", 200)].
Inserted 2 fact(s) into 'departments'.
> +budgets[(100, 50000), (200, 30000)].
Inserted 2 fact(s) into 'budgets'.
> +employee_budget(Name, Dept, Budget) :- employees(_, Name, DeptId), departments(DeptId, Dept, BudgetId), budgets(BudgetId, Budget).
Rule 'employee_budget' registered.
> ?- employee_budget(Name, Dept, Budget).
3 rows:
  ("Alice", "Development", 50000)
  ("Bob", "Sales", 30000)
  ("Carol", "Development", 50000)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_triple_join_n06t72
Knowledge graph 'test_triple_join_n06t72' dropped.
