Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_self_join_n06t73
Knowledge graph 'test_self_join_n06t73' created.
Switched to knowledge graph: test_self_join_n06t73
> .kg use test_self_join_n06t73
Switched to knowledge graph: test_self_join_n06t73
> +employees[(1, "Alice", 3), (2, "Bob", 3), (3, "Carol", 5), (4, "Dave", 5), (5, "Eve", 0)]
Inserted 5 fact(s) into 'employees'.
> +reports_to(EmpName, MgrName) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> employees(EmpId, EmpName, MgrId),
Parse error: Expected parentheses: (EmpId, EmpName, MgrId),
> employees(MgrId, MgrName, _),
Parse error: Expected parentheses: (MgrId, MgrName, _),
> MgrId != 0
Parse error: Unrecognized statement: MgrId != 0
> ?reports_to(Emp, Mgr)
No results.
> +colleagues(Name1, Name2) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> employees(Id1, Name1, Mgr),
Parse error: Expected parentheses: (Id1, Name1, Mgr),
> employees(Id2, Name2, Mgr),
Parse error: Expected parentheses: (Id2, Name2, Mgr),
> Id1 < Id2,
Parse error: Unrecognized statement: Id1 < Id2,
> Mgr != 0
Parse error: Unrecognized statement: Mgr != 0
> ?colleagues(A, B)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_self_join_n06t73
Knowledge graph 'test_self_join_n06t73' dropped.
