Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_tc
Knowledge graph 'test_tc' created.
Switched to knowledge graph: test_tc
> .kg use test_tc
Switched to knowledge graph: test_tc
> +edge[(1,2), (2,3), (3,4), (4,5)].
Inserted 4 fact(s) into 'edge'.
> +connected(X, Y) :- edge(X, Y).
Rule 'connected' registered.
> +connected(X, Z) :- edge(X, Y), connected(Y, Z).
Rule 'connected' registered.
> ?- connected(X, Y).
10 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 4)
  (3, 5)
  (4, 5)
> ?- connected(1, 5).
1 rows:
  (1, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_tc
Knowledge graph 'test_tc' dropped.
