Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_tc_n09t01
Knowledge graph 'test_tc_n09t01' created.
Switched to knowledge graph: test_tc_n09t01
> .kg use test_tc_n09t01
Switched to knowledge graph: test_tc_n09t01
> +edge[(1,2), (2,3), (3,4), (4,5)]
Inserted 4 fact(s) into 'edge'.
> +connected(X, Y) <- edge(X, Y)
Rule 'connected' registered.
> +connected(X, Z) <- edge(X, Y), connected(Y, Z)
Rule 'connected' registered.
> ?connected(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 2 │ 5 │
│ 3 │ 4 │
│ 3 │ 5 │
│ 4 │ 5 │
└───┴───┘
10 rows
> ?connected(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 2 │ 5 │
│ 3 │ 4 │
│ 3 │ 5 │
│ 4 │ 5 │
└───┴───┘
10 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_tc_n09t01
Knowledge graph 'test_tc_n09t01' dropped.
