
> .db create test_sc
Database 'test_sc' created.
Switched to database: test_sc
> .db use test_sc
Switched to database: test_sc
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 facts into 'edge'.
> same_component(X, Y) := edge(X, Y).
View 'same_component' registered.
> same_component(X, Y) := edge(Y, X).
Rule added to view 'same_component' (2 rules total).
> same_component(X, Z) := same_component(X, Y), same_component(Y, Z), X != Z.
Rule added to view 'same_component' (3 rules total).
> ?- same_component(X, Y).
12 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 1)
  (2, 3)
  (2, 4)
  (3, 1)
  (3, 2)
  (3, 4)
  (4, 1)
  (4, 2)
  (4, 3)
> ?- same_component(1, 4).
1 rows:
  (1, 4)
> ?- same_component(4, 1).
1 rows:
  (4, 1)
> .db use default
Switched to database: default
> .db drop test_sc
Database 'test_sc' dropped.
