Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sc
Knowledge graph 'test_sc' created.
Switched to knowledge graph: test_sc
> .kg use test_sc
Switched to knowledge graph: test_sc
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> +same_component(X, Y) :- edge(X, Y).
Rule 'same_component' registered.
> +same_component(X, Y) :- edge(Y, X).
Rule 'same_component' registered.
> +same_component(X, Z) :- same_component(X, Y), same_component(Y, Z), X != Z.
Rule 'same_component' registered.
> ?- same_component(X, Y).
12 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 1)
  (2, 3)
  (2, 4)
  (3, 1)
  (3, 2)
  (3, 4)
  (4, 1)
  (4, 2)
  (4, 3)
> ?- same_component(1, 4).
1 rows:
  (1, 4)
> ?- same_component(4, 1).
1 rows:
  (4, 1)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sc
Knowledge graph 'test_sc' dropped.
