Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_conn_n09t03
Knowledge graph 'test_conn_n09t03' created.
Switched to knowledge graph: test_conn_n09t03
> .kg use test_conn_n09t03
Switched to knowledge graph: test_conn_n09t03
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> +connected(X, Y) <- edge(X, Y)
Rule 'connected' registered.
> +connected(X, Y) <- edge(X, Z), connected(Z, Y)
Rule 'connected' registered.
> .rule connected
Rule: connected
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
│    2 │    3 │
│    2 │    4 │
│    3 │    4 │
└──────┴──────┘
6 rows
> ?connected(1, 3)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
└──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_conn_n09t03
Knowledge graph 'test_conn_n09t03' dropped.
