Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_conn
Knowledge graph 'test_conn' created.
Switched to knowledge graph: test_conn
> .kg use test_conn
Switched to knowledge graph: test_conn
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> +connected(X, Y) :- edge(X, Y).
Rule 'connected' registered.
> +connected(X, Y) :- edge(X, Z), connected(Z, Y).
Rule 'connected' registered.
> .rule connected
Rule: connected
6 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 3)
  (2, 4)
  (3, 4)
> ?- connected(1, 3).
1 rows:
  (1, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_conn
Knowledge graph 'test_conn' dropped.
