Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sc2_n09t04
Knowledge graph 'test_sc2_n09t04' created.
Switched to knowledge graph: test_sc2_n09t04
> .kg use test_sc2_n09t04
Switched to knowledge graph: test_sc2_n09t04
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> +same_component(X, Y) <- edge(X, Y)
Rule 'same_component' registered.
> +same_component(X, Y) <- edge(Y, X)
Rule 'same_component' registered.
> +same_component(X, Z) <- same_component(X, Y), same_component(Y, Z), X != Z
Rule 'same_component' registered.
> .rule same_component
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
│    2 │    1 │
│    2 │    3 │
│    2 │    4 │
│    3 │    1 │
│    3 │    2 │
│    3 │    4 │
│    4 │    1 │
│    4 │    2 │
│    4 │    3 │
└──────┴──────┘
12 rows
> ?same_component(1, 4)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    4 │
└──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sc2_n09t04
Knowledge graph 'test_sc2_n09t04' dropped.
