Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_left_recursion
Knowledge graph 'test_left_recursion' created.
Switched to knowledge graph: test_left_recursion
> .kg use test_left_recursion
Switched to knowledge graph: test_left_recursion
> +edge[(1, 2), (2, 3), (3, 4), (4, 5)].
Inserted 4 fact(s) into 'edge'.
> +path(X, Y) :- edge(X, Y).
Rule 'path' registered.
> +path(X, Y) :- path(X, Z), edge(Z, Y).
Rule 'path' registered.
> ?- path(A, B).
10 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 4)
  (3, 5)
  (4, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_left_recursion
Knowledge graph 'test_left_recursion' dropped.
