Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_base
Knowledge graph 'test_multi_base' created.
Switched to knowledge graph: test_multi_base
> .kg use test_multi_base
Switched to knowledge graph: test_multi_base
> +edge[(1, 2), (2, 3), (10, 11), (11, 12), (20, 21), (21, 22), (22, 23)].
Inserted 7 fact(s) into 'edge'.
> +start[(1), (10), (20)].
Inserted 3 fact(s) into 'start'.
> +reachable(X) :- start(X).
Rule 'reachable' registered.
> +reachable(Y) :- reachable(X), edge(X, Y).
Rule 'reachable' registered.
> ?- reachable(X).
10 rows:
  (1)
  (2)
  (3)
  (10)
  (11)
  (12)
  (20)
  (21)
  (22)
  (23)
> +reachable_from(S, X) :- start(S), S = X.
Rule 'reachable_from' registered.
> +reachable_from(S, Y) :- reachable_from(S, X), edge(X, Y).
Rule 'reachable_from' registered.
> +count_from_start(S, count<X>) :- reachable_from(S, X).
Rule 'count_from_start' registered.
> ?- count_from_start(S, C).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_base
Knowledge graph 'test_multi_base' dropped.
