Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_base_n09t10
Knowledge graph 'test_multi_base_n09t10' created.
Switched to knowledge graph: test_multi_base_n09t10
> .kg use test_multi_base_n09t10
Switched to knowledge graph: test_multi_base_n09t10
> +edge[(1, 2), (2, 3), (10, 11), (11, 12), (20, 21), (21, 22), (22, 23)]
Inserted 7 fact(s) into 'edge'.
> +start[(1), (10), (20)]
Inserted 3 fact(s) into 'start'.
> +reachable(X) <- start(X)
Rule 'reachable' registered.
> +reachable(Y) <- reachable(X), edge(X, Y)
Rule 'reachable' registered.
> ?reachable(X)
┌────┐
│ X  │
├────┤
│  1 │
│  2 │
│  3 │
│ 10 │
│ 11 │
│ 12 │
│ 20 │
│ 21 │
│ 22 │
│ 23 │
└────┘
10 rows
> +reachable_from(S, S) <- start(S)
Rule 'reachable_from' registered.
> +reachable_from(S, Y) <- reachable_from(S, X), edge(X, Y)
Rule 'reachable_from' registered.
> +count_from_start(S, count<X>) <- reachable_from(S, X)
Rule 'count_from_start' registered.
> ?count_from_start(S, C)
┌────┬───┐
│ S  │ C │
├────┼───┤
│  1 │ 3 │
│ 10 │ 3 │
│ 20 │ 4 │
└────┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_base_n09t10
Knowledge graph 'test_multi_base_n09t10' dropped.
