Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_non_linear_n09t11
Knowledge graph 'test_non_linear_n09t11' created.
Switched to knowledge graph: test_non_linear_n09t11
> .kg use test_non_linear_n09t11
Switched to knowledge graph: test_non_linear_n09t11
> +parent[(2, 1), (3, 1), (4, 2), (5, 2), (6, 3), (7, 3)]
Inserted 6 fact(s) into 'parent'.
> +sibling(X, Y) <- parent(X, P), parent(Y, P), X != Y
Rule 'sibling' registered.
> ?sibling(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 2 │ 3 │
│ 3 │ 2 │
│ 4 │ 5 │
│ 5 │ 4 │
│ 6 │ 7 │
│ 7 │ 6 │
└───┴───┘
6 rows
> +cousin(X, Y) <- parent(X, PX), parent(Y, PY), sibling(PX, PY)
Rule 'cousin' registered.
> ?cousin(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 4 │ 6 │
│ 4 │ 7 │
│ 5 │ 6 │
│ 5 │ 7 │
│ 6 │ 4 │
│ 6 │ 5 │
│ 7 │ 4 │
│ 7 │ 5 │
└───┴───┘
8 rows
> +ancestor(X, A) <- parent(X, A)
Rule 'ancestor' registered.
> +ancestor(X, A) <- parent(X, P), ancestor(P, A)
Rule 'ancestor' registered.
> ?ancestor(X, A)
┌───┬───┐
│ X │ A │
├───┼───┤
│ 2 │ 1 │
│ 3 │ 1 │
│ 4 │ 1 │
│ 4 │ 2 │
│ 5 │ 1 │
│ 5 │ 2 │
│ 6 │ 1 │
│ 6 │ 3 │
│ 7 │ 1 │
│ 7 │ 3 │
└───┴───┘
10 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_non_linear_n09t11
Knowledge graph 'test_non_linear_n09t11' dropped.
