Executing script: examples/datalog/09_recursion/11_non_linear_recursion.dl

> .db create test_non_linear
Database 'test_non_linear' created.
Switched to database: test_non_linear
> .db use test_non_linear
Switched to database: test_non_linear
> +parent[(2, 1), (3, 1), (4, 2), (5, 2), (6, 3), (7, 3)].
Inserted 6 facts into 'parent'.
> sibling(X, Y) := parent(X, P), parent(Y, P), X != Y.
View 'sibling' registered.
> ?- sibling(A, B).
6 rows:
  (2, 3)
  (3, 2)
  (4, 5)
  (5, 4)
  (6, 7)
  (7, 6)
> cousin(X, Y) := parent(X, PX), parent(Y, PY), sibling(PX, PY).
View 'cousin' registered.
> ?- cousin(A, B).
8 rows:
  (4, 6)
  (4, 7)
  (5, 6)
  (5, 7)
  (6, 4)
  (6, 5)
  (7, 4)
  (7, 5)
> ancestor(X, A) := parent(X, A).
View 'ancestor' registered.
> ancestor(X, A) := parent(X, P), ancestor(P, A).
Rule added to view 'ancestor' (2 rules total).
> ?- ancestor(X, A).
10 rows:
  (2, 1)
  (3, 1)
  (4, 1)
  (4, 2)
  (5, 1)
  (5, 2)
  (6, 1)
  (6, 3)
  (7, 1)
  (7, 3)
> .db use default
Switched to database: default
> .db drop test_non_linear
Database 'test_non_linear' dropped.
