Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_termination_n09t12
Knowledge graph 'test_termination_n09t12' created.
Switched to knowledge graph: test_termination_n09t12
> .kg use test_termination_n09t12
Switched to knowledge graph: test_termination_n09t12
> +loop_edge[(1, 1), (1, 2), (2, 3)]
Inserted 3 fact(s) into 'loop_edge'.
> +path_loop(X, Y) <- loop_edge(X, Y)
Rule 'path_loop' registered.
> +path_loop(X, Z) <- loop_edge(X, Y), path_loop(Y, Z)
Rule 'path_loop' registered.
> ?path_loop(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
└───┴───┘
3 rows
> +cycle_edge[(1, 2), (2, 3), (3, 1)]
Inserted 3 fact(s) into 'cycle_edge'.
> +path_cycle(X, Y) <- cycle_edge(X, Y)
Rule 'path_cycle' registered.
> +path_cycle(X, Z) <- cycle_edge(X, Y), path_cycle(Y, Z)
Rule 'path_cycle' registered.
> ?path_cycle(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
└───┴───┘
3 rows
> +diamond_edge[(1, 2), (1, 3), (2, 4), (3, 4)]
Inserted 4 fact(s) into 'diamond_edge'.
> +path_diamond(X, Y) <- diamond_edge(X, Y)
Rule 'path_diamond' registered.
> +path_diamond(X, Z) <- diamond_edge(X, Y), path_diamond(Y, Z)
Rule 'path_diamond' registered.
> +to_four(X) <- path_diamond(1, X), X = 4
Rule 'to_four' registered.
> ?to_four(X)
┌───┐
│ X │
├───┤
│ 4 │
└───┘
1 rows
> +empty_edge[]
Inserted 0 fact(s) into 'empty_edge'.
> +empty_start[(1)]
Inserted 1 fact(s) into 'empty_start'.
> +path_empty(X, Y) <- empty_edge(X, Y)
Rule 'path_empty' registered.
> +path_empty(X, Z) <- empty_edge(X, Y), path_empty(Y, Z)
Rule 'path_empty' registered.
> +reachable_empty(Y) <- empty_start(X), path_empty(X, Y)
Rule 'reachable_empty' registered.
> ?reachable_empty(X)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_termination_n09t12
Knowledge graph 'test_termination_n09t12' dropped.
