Executing script: examples/datalog/09_recursion/13_empty_base_case.dl

> .db create test_empty_base
Database 'test_empty_base' created.
Switched to database: test_empty_base
> .db use test_empty_base
Switched to database: test_empty_base
> path(X, Y) :- edge(X, Y).
No results for 'path'.
(session: 1 rule(s))
> path(X, Z) :- edge(X, Y), path(Y, Z).
No results for 'path'.
(session: 2 rule(s))
> ?- path(X, Y).
No results.
> +edge[(1, 2), (2, 3)].
Inserted 2 facts into 'edge'.
> ?- path(X, Y).
3 rows:
  (1, 2)
  (1, 3)
  (2, 3)
> -edge(X, Y) :- edge(X, Y).
Deleted 2 facts from 'edge'.
> ?- path(X, Y).
No results.
> .db use default
Switched to database: default
(Cleared 2 session rule(s))
> .db drop test_empty_base
Database 'test_empty_base' dropped.
