Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_hop
Knowledge graph 'test_multi_hop' created.
Switched to knowledge graph: test_multi_hop
> .kg use test_multi_hop
Switched to knowledge graph: test_multi_hop
> +direct[(1, 2), (2, 3), (3, 4), (4, 5)].
Inserted 4 fact(s) into 'direct'.
> +hop[(1, 3), (2, 4), (3, 5)].
Inserted 3 fact(s) into 'hop'.
> +path(X, Y) :- direct(X, Y).
Rule 'path' registered.
> +path(X, Y) :- hop(X, Y).
Rule 'path' registered.
> +path(X, Z) :- path(X, Y), direct(Y, Z).
Rule 'path' registered.
> ?- path(1, Y).
4 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_hop
Knowledge graph 'test_multi_hop' dropped.
