Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_nested_rec
Knowledge graph 'test_nested_rec' created.
Switched to knowledge graph: test_nested_rec
> .kg use test_nested_rec
Switched to knowledge graph: test_nested_rec
> +edge[(1, 2), (2, 3), (3, 4), (4, 5)].
Inserted 4 fact(s) into 'edge'.
> +path(X, Y) :- edge(X, Y).
Rule 'path' registered.
> +path(X, Z) :- path(X, Y), edge(Y, Z).
Rule 'path' registered.
> +extended_path(X, Y) :- path(X, Y).
Rule 'extended_path' registered.
> +extended_path(X, Z) :- extended_path(X, Y), path(Y, Z).
Rule 'extended_path' registered.
> ?- extended_path(1, Y).
4 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_nested_rec
Knowledge graph 'test_nested_rec' dropped.
