Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_loop
Knowledge graph 'test_self_loop' created.
Switched to knowledge graph: test_self_loop
> .kg use test_self_loop
Switched to knowledge graph: test_self_loop
> +edge(1, 1).
Inserted 1 fact(s) into 'edge'.
> path(X, Y) :- edge(X, Y).
1 rows:
  (1, 1)
(session: 1 rule(s))
> path(X, Z) :- path(X, Y), edge(Y, Z).
1 rows:
  (1, 1)
(session: 2 rule(s))
> ?- path(X, Y).
1 rows:
  (1, 1)
> +edge(2, 2).
Inserted 1 fact(s) into 'edge'.
> ?- path(X, Y).
2 rows:
  (1, 1)
  (2, 2)
> +edge(1, 2).
Inserted 1 fact(s) into 'edge'.
> ?- path(X, Y).
3 rows:
  (1, 1)
  (1, 2)
  (2, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_self_loop
Knowledge graph 'test_self_loop' dropped.
