Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_linear_rec_n09t17
Knowledge graph 'test_linear_rec_n09t17' created.
Switched to knowledge graph: test_linear_rec_n09t17
> .kg use test_linear_rec_n09t17
Switched to knowledge graph: test_linear_rec_n09t17
> +link[(1, 2), (2, 3), (3, 4), (4, 5), (5, 6)].
Inserted 5 fact(s) into 'link'.
> +chain(X, Y) :- link(X, Y).
Rule 'chain' registered.
> +chain(X, Z) :- link(X, Y), chain(Y, Z).
Rule 'chain' registered.
> ?- chain(1, Y).
5 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (1, 6)
> ?- chain(1, 6).
1 rows:
  (1, 6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_linear_rec_n09t17
Knowledge graph 'test_linear_rec_n09t17' dropped.
