Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cycle_det
Knowledge graph 'test_cycle_det' created.
Switched to knowledge graph: test_cycle_det
> .kg use test_cycle_det
Switched to knowledge graph: test_cycle_det
> +edge[(1, 2), (2, 3), (3, 1), (4, 5)].
Inserted 4 fact(s) into 'edge'.
> +reaches(X, Y) :- edge(X, Y).
Rule 'reaches' registered.
> +reaches(X, Z) :- edge(X, Y), reaches(Y, Z).
Rule 'reaches' registered.
> in_cycle(X) :- reaches(X, X).
4 rows:
  (1)
  (2)
  (3)
  (4)
(session: 1 rule(s))
> ?- in_cycle(X).
4 rows:
  (1)
  (2)
  (3)
  (4)
> not_in_cycle(X) :- edge(X, _), !reaches(X, X).
1 rows:
  (4)
(session: 2 rule(s))
> ?- not_in_cycle(X).
1 rows:
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_cycle_det
Knowledge graph 'test_cycle_det' dropped.
