Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_path
Knowledge graph 'test_multi_path' created.
Switched to knowledge graph: test_multi_path
> .kg use test_multi_path
Switched to knowledge graph: test_multi_path
> +edge[(1, 2), (1, 3), (2, 4), (3, 4)].
Inserted 4 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> ?- reachable(X, Y).
5 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 4)
  (3, 4)
> intermediate(M) :- reachable(1, M), reachable(M, 4).
2 rows:
  (2)
  (3)
(session: 1 rule(s))
> ?- intermediate(M).
2 rows:
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multi_path
Knowledge graph 'test_multi_path' dropped.
