Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_shortest_n09t24
Knowledge graph 'test_shortest_n09t24' created.
Switched to knowledge graph: test_shortest_n09t24
> .kg use test_shortest_n09t24
Switched to knowledge graph: test_shortest_n09t24
> +edge[(1, 2), (2, 3), (3, 5), (1, 4), (4, 5)]
Inserted 5 fact(s) into 'edge'.
> +path_len(X, Y, 1) <- edge(X, Y)
Rule 'path_len' registered.
> +path_len(X, Z, L) <- path_len(X, Y, L1), edge(Y, Z), L = L1 + 1
Rule 'path_len' registered.
> ?path_len(X, Y, Len)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    2 │    1 │
│    1 │    3 │    2 │
│    1 │    4 │    1 │
│    1 │    5 │    2 │
│    1 │    5 │    3 │
│    2 │    3 │    1 │
│    2 │    5 │    2 │
│    3 │    5 │    1 │
│    4 │    5 │    1 │
└──────┴──────┴──────┘
9 rows
> +shortest(X, Y, min<L>) <- path_len(X, Y, L)
Rule 'shortest' registered.
> ?shortest(X, Y, Len)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    2 │    1 │
│    1 │    3 │    2 │
│    1 │    4 │    1 │
│    1 │    5 │    2 │
│    2 │    3 │    1 │
│    2 │    5 │    2 │
│    3 │    5 │    1 │
│    4 │    5 │    1 │
└──────┴──────┴──────┘
8 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_shortest_n09t24
Knowledge graph 'test_shortest_n09t24' dropped.
