Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_count_paths_n09t25
Knowledge graph 'test_count_paths_n09t25' created.
Switched to knowledge graph: test_count_paths_n09t25
> .kg use test_count_paths_n09t25
Switched to knowledge graph: test_count_paths_n09t25
> +edge[(1, 2), (1, 3), (2, 4), (3, 4), (2, 5), (4, 5)]
Inserted 6 fact(s) into 'edge'.
> +path(X, Y) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- path(X, Y), edge(Y, Z)
Rule 'path' registered.
> ?path(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
│    1 │    5 │
│    2 │    4 │
│    2 │    5 │
│    3 │    4 │
│    3 │    5 │
│    4 │    5 │
└──────┴──────┘
9 rows
> +incoming(Node, count<Src>) <- path(Src, Node)
Rule 'incoming' registered.
> ?incoming(Node, Count)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    2 │    1 │
│    3 │    1 │
│    4 │    3 │
│    5 │    4 │
└──────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_count_paths_n09t25
Knowledge graph 'test_count_paths_n09t25' dropped.
