Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_tree_depth_n09t26
Knowledge graph 'test_tree_depth_n09t26' created.
Switched to knowledge graph: test_tree_depth_n09t26
> .kg use test_tree_depth_n09t26
Switched to knowledge graph: test_tree_depth_n09t26
> +parent[(2, 1), (3, 1), (4, 2), (5, 2), (6, 3), (7, 4)]
Inserted 6 fact(s) into 'parent'.
> +root(1)
Inserted 1 fact(s) into 'root'.
> +depth(N, 0) <- root(N)
Rule 'depth' registered.
> +depth(Node, D) <- parent(Node, Parent), depth(Parent, PD), D = PD + 1
Rule 'depth' registered.
> ?depth(Node, Depth)
┌──────┬───────┐
│ Node │ Depth │
├──────┼───────┤
│    1 │     0 │
│    2 │     1 │
│    3 │     1 │
│    4 │     2 │
│    5 │     2 │
│    6 │     2 │
│    7 │     3 │
└──────┴───────┘
7 rows
> +max_depth(max<D>) <- depth(_, D)
Rule 'max_depth' registered.
> ?max_depth(M)
┌───┐
│ M │
├───┤
│ 3 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_tree_depth_n09t26
Knowledge graph 'test_tree_depth_n09t26' dropped.
