Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_leaves_n09t27
Knowledge graph 'test_leaves_n09t27' created.
Switched to knowledge graph: test_leaves_n09t27
> .kg use test_leaves_n09t27
Switched to knowledge graph: test_leaves_n09t27
> +edge[(1, 2), (1, 3), (2, 4), (2, 5), (3, 6)]
Inserted 5 fact(s) into 'edge'.
> node(X) <- edge(X, _)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
(session: 1 rule(s))
> node(Y) <- edge(_, Y)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
│ 4 │
│ 5 │
│ 6 │
└───┘
6 rows
(session: 2 rule(s))
> ?node(N)
┌───┐
│ N │
├───┤
│ 1 │
│ 2 │
│ 3 │
│ 4 │
│ 5 │
│ 6 │
└───┘
6 rows
> has_children(X) <- edge(X, _)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
(session: 3 rule(s))
> leaf(X) <- node(X), !has_children(X)
┌───┐
│ X │
├───┤
│ 4 │
│ 5 │
│ 6 │
└───┘
3 rows
(session: 4 rule(s))
> ?leaf(L)
┌───┐
│ L │
├───┤
│ 4 │
│ 5 │
│ 6 │
└───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_leaves_n09t27
Knowledge graph 'test_leaves_n09t27' dropped.
