Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_leaves
Knowledge graph 'test_leaves' created.
Switched to knowledge graph: test_leaves
> .kg use test_leaves
Switched to knowledge graph: test_leaves
> +edge[(1, 2), (1, 3), (2, 4), (2, 5), (3, 6)].
Inserted 5 fact(s) into 'edge'.
> node(X) :- edge(X, _).
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> node(Y) :- edge(_, Y).
6 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
  (6)
(session: 2 rule(s))
> ?- node(N).
6 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
  (6)
> has_children(X) :- edge(X, _).
3 rows:
  (1)
  (2)
  (3)
(session: 3 rule(s))
> leaf(X) :- node(X), !has_children(X).
3 rows:
  (4)
  (5)
  (6)
(session: 4 rule(s))
> ?- leaf(L).
3 rows:
  (4)
  (5)
  (6)
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_leaves
Knowledge graph 'test_leaves' dropped.
