Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_right_linear_n09t29
Knowledge graph 'test_right_linear_n09t29' created.
Switched to knowledge graph: test_right_linear_n09t29
> .kg use test_right_linear_n09t29
Switched to knowledge graph: test_right_linear_n09t29
> +edge[(1, 2), (2, 3), (3, 4), (4, 5)]
Inserted 4 fact(s) into 'edge'.
> +right_reach(X, Y) <- edge(X, Y)
Rule 'right_reach' registered.
> +right_reach(X, Z) <- edge(X, Y), right_reach(Y, Z)
Rule 'right_reach' registered.
> ?right_reach(1, Y)
┌───┬───┐
│ 1 │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
└───┴───┘
4 rows
> +left_reach(X, Y) <- edge(X, Y)
Rule 'left_reach' registered.
> +left_reach(X, Z) <- left_reach(X, Y), edge(Y, Z)
Rule 'left_reach' registered.
> ?left_reach(1, Y)
┌───┬───┐
│ 1 │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
└───┴───┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_right_linear_n09t29
Knowledge graph 'test_right_linear_n09t29' dropped.
