Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_depth_limit_n09t30
Knowledge graph 'test_depth_limit_n09t30' created.
Switched to knowledge graph: test_depth_limit_n09t30
> .kg use test_depth_limit_n09t30
Switched to knowledge graph: test_depth_limit_n09t30
> +edge[(1, 2), (2, 3), (3, 4), (4, 5), (5, 6), (6, 7)]
Inserted 6 fact(s) into 'edge'.
> +path(X, Y, 1) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z, D) <- path(X, Y, D1), edge(Y, Z), D = D1 + 1, D <= 3
Rule 'path' registered.
> ?path(1, Y, D)
┌───┬───┬───┐
│ 1 │ Y │ D │
├───┼───┼───┤
│ 1 │ 2 │ 1 │
│ 1 │ 3 │ 2 │
│ 1 │ 4 │ 3 │
└───┴───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_depth_limit_n09t30
Knowledge graph 'test_depth_limit_n09t30' dropped.
