Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cycle
Knowledge graph 'test_cycle' created.
Switched to knowledge graph: test_cycle
> .kg use test_cycle
Switched to knowledge graph: test_cycle
> +edge[(1, 2), (2, 3), (3, 1), (4, 5)].
Inserted 4 fact(s) into 'edge'.
> +reach(X, Y) :- edge(X, Y).
Rule 'reach' registered.
> +reach(X, Z) :- reach(X, Y), edge(Y, Z).
Rule 'reach' registered.
> in_cycle(X) :- reach(X, X).
4 rows:
  (1)
  (2)
  (3)
  (4)
(session: 1 rule(s))
> ?- in_cycle(X).
4 rows:
  (1)
  (2)
  (3)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cycle
Knowledge graph 'test_cycle' dropped.
