Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_roots_n09t37
Knowledge graph 'test_roots_n09t37' created.
Switched to knowledge graph: test_roots_n09t37
> .kg use test_roots_n09t37
Switched to knowledge graph: test_roots_n09t37
> +parent[(1, 2), (1, 3), (2, 4), (2, 5), (3, 6)].
Inserted 5 fact(s) into 'parent'.
> +all_nodes(X) :- parent(X, _).
Rule 'all_nodes' registered.
> +all_nodes(X) :- parent(_, X).
Rule 'all_nodes' registered.
> root(X) :- all_nodes(X), !parent(_, X).
1 rows:
  (1)
(session: 1 rule(s))
> ?- root(X).
1 rows:
  (1)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_roots_n09t37
Knowledge graph 'test_roots_n09t37' dropped.
