Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_fib_n09t38
Knowledge graph 'test_fib_n09t38' created.
Switched to knowledge graph: test_fib_n09t38
> .kg use test_fib_n09t38
Switched to knowledge graph: test_fib_n09t38
> +fib(0, 0)
Inserted 1 fact(s) into 'fib'.
> +fib(1, 1)
Inserted 1 fact(s) into 'fib'.
> +fib(N, V) <- fib(N1, V1), fib(N2, V2), N = N1 + 1, N2 = N1 - 1, V = V1 + V2, N <= 10
Rule 'fib' registered.
> ?fib(N, V)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    0 │
│    1 │    1 │
│    2 │    1 │
│    2 │    2 │
└──────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_fib_n09t38
Knowledge graph 'test_fib_n09t38' dropped.
