Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sibling
Knowledge graph 'test_sibling' created.
Switched to knowledge graph: test_sibling
> .kg use test_sibling
Switched to knowledge graph: test_sibling
> +parent[(1, 2), (1, 3), (1, 4), (2, 5), (2, 6)].
Inserted 5 fact(s) into 'parent'.
> sibling(A, B) :- parent(P, A), parent(P, B), A < B.
4 rows:
  (2, 3)
  (2, 4)
  (3, 4)
  (5, 6)
(session: 1 rule(s))
> ?- sibling(A, B).
4 rows:
  (2, 3)
  (2, 4)
  (3, 4)
  (5, 6)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_sibling
Knowledge graph 'test_sibling' dropped.
