Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_level_track_n09t41
Knowledge graph 'test_level_track_n09t41' created.
Switched to knowledge graph: test_level_track_n09t41
> .kg use test_level_track_n09t41
Switched to knowledge graph: test_level_track_n09t41
> +edge[("root", "a"), ("root", "b"), ("a", "c"), ("a", "d"), ("c", "e")]
Inserted 5 fact(s) into 'edge'.
> +level("root", 0)
Inserted 1 fact(s) into 'level'.
> +level(Child, Depth) <- level(Parent, D), edge(Parent, Child), Depth = D + 1
Rule 'level' registered.
> ?level(Node, Depth)
┌──────┬───────┐
│ Node │ Depth │
├──────┼───────┤
│ "a"  │     1 │
│ "b"  │     1 │
└──────┴───────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_level_track_n09t41
Knowledge graph 'test_level_track_n09t41' dropped.
