Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_path_cost_n09t42
Knowledge graph 'test_path_cost_n09t42' created.
Switched to knowledge graph: test_path_cost_n09t42
> .kg use test_path_cost_n09t42
Switched to knowledge graph: test_path_cost_n09t42
> +weighted_edge[("a", "b", 10), ("b", "c", 20), ("c", "d", 15), ("a", "d", 100)]
Inserted 4 fact(s) into 'weighted_edge'.
> +path_cost(From, To, Cost) <- weighted_edge(From, To, Cost)
Rule 'path_cost' registered.
> +path_cost(From, To, Total) <- path_cost(From, Mid, C1), weighted_edge(Mid, To, C2), Total = C1 + C2
Rule 'path_cost' registered.
> ?path_cost(From, To, Cost)
┌──────┬─────┬──────┐
│ From │ To  │ Cost │
├──────┼─────┼──────┤
│ "a"  │ "b" │   10 │
│ "a"  │ "c" │   30 │
│ "a"  │ "d" │   45 │
│ "a"  │ "d" │  100 │
│ "b"  │ "c" │   20 │
│ "b"  │ "d" │   35 │
│ "c"  │ "d" │   15 │
└──────┴─────┴──────┘
7 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_path_cost_n09t42
Knowledge graph 'test_path_cost_n09t42' dropped.
