Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rec_depth_n09t47
Knowledge graph 'test_rec_depth_n09t47' created.
Switched to knowledge graph: test_rec_depth_n09t47
> .kg use test_rec_depth_n09t47
Switched to knowledge graph: test_rec_depth_n09t47
> +link[("a", "b"), ("b", "c"), ("c", "d"), ("a", "d")]
Inserted 4 fact(s) into 'link'.
> +path_depth(X, X, 0)
Cannot insert variable 'X' - use constants only
> +path_depth(X, Z, D) <- path_depth(X, Y, D1), link(Y, Z), D = D1 + 1, D < 5
Rule 'path_depth' registered.
> ?path_depth("a", Y, D)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rec_depth_n09t47
Knowledge graph 'test_rec_depth_n09t47' dropped.
