Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_linear_rec
Knowledge graph 'test_linear_rec' created.
Switched to knowledge graph: test_linear_rec
> .kg use test_linear_rec
Switched to knowledge graph: test_linear_rec
> +link[("a", "b"), ("b", "c"), ("c", "d"), ("d", "e")].
Inserted 4 fact(s) into 'link'.
> +chain(X, Y) :- link(X, Y).
Rule 'chain' registered.
> +chain(X, Z) :- chain(X, Y), link(Y, Z).
Rule 'chain' registered.
> ?- chain("a", Y).
4 rows:
  ("a", "b")
  ("a", "c")
  ("a", "d")
  ("a", "e")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_linear_rec
Knowledge graph 'test_linear_rec' dropped.
