Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_nonlinear
Knowledge graph 'test_nonlinear' created.
Switched to knowledge graph: test_nonlinear
> .kg use test_nonlinear
Switched to knowledge graph: test_nonlinear
> +tree[("root", "a"), ("root", "b"), ("a", "c"), ("a", "d"), ("b", "e")].
Inserted 5 fact(s) into 'tree'.
> +descendant(Anc, Desc) :- tree(Anc, Desc).
Rule 'descendant' registered.
> +descendant(Anc, Desc) :- tree(Anc, Mid), descendant(Mid, Desc).
Rule 'descendant' registered.
> ?- descendant("root", D).
5 rows:
  ("root", "a")
  ("root", "b")
  ("root", "c")
  ("root", "d")
  ("root", "e")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_nonlinear
Knowledge graph 'test_nonlinear' dropped.
