Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_path_exists
Knowledge graph 'test_path_exists' created.
Switched to knowledge graph: test_path_exists
> .kg use test_path_exists
Switched to knowledge graph: test_path_exists
> +edge[("a", "b"), ("b", "c"), ("c", "d"), ("x", "y")].
Inserted 4 fact(s) into 'edge'.
> +reaches(X, Y) :- edge(X, Y).
Rule 'reaches' registered.
> +reaches(X, Z) :- reaches(X, Y), edge(Y, Z).
Rule 'reaches' registered.
> ?- reaches("a", "d").
1 rows:
  ("a", "d")
> ?- reaches("a", "y").
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_path_exists
Knowledge graph 'test_path_exists' dropped.
