Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_acyclic_path_n09t70
Knowledge graph 'test_acyclic_path_n09t70' created.
Switched to knowledge graph: test_acyclic_path_n09t70
> .kg use test_acyclic_path_n09t70
Switched to knowledge graph: test_acyclic_path_n09t70
> +edge[(1, 2), (2, 3), (3, 4), (2, 4), (4, 1)]
Inserted 5 fact(s) into 'edge'.
> +acyclic_path(X, Y, 1) <- edge(X, Y)
Rule 'acyclic_path' registered.
> +acyclic_path(X, Z, D2) <- acyclic_path(X, Y, D), edge(Y, Z), D2 = D + 1, D < 4
Rule 'acyclic_path' registered.
> ?acyclic_path(X, Y, D)
┌───┬───┬───┐
│ X │ Y │ D │
├───┼───┼───┤
│ 1 │ 1 │ 3 │
│ 1 │ 1 │ 4 │
│ 1 │ 2 │ 1 │
│ 1 │ 2 │ 4 │
│ 1 │ 3 │ 2 │
│ 1 │ 4 │ 2 │
│ 1 │ 4 │ 3 │
│ 2 │ 1 │ 2 │
│ 2 │ 1 │ 3 │
│ 2 │ 2 │ 3 │
│ 2 │ 2 │ 4 │
│ 2 │ 3 │ 1 │
│ 2 │ 3 │ 4 │
│ 2 │ 4 │ 1 │
│ 2 │ 4 │ 2 │
│ 2 │ 4 │ 4 │
│ 3 │ 1 │ 2 │
│ 3 │ 2 │ 3 │
│ 3 │ 3 │ 4 │
│ 3 │ 4 │ 1 │
│ 3 │ 4 │ 4 │
│ 4 │ 1 │ 1 │
│ 4 │ 1 │ 4 │
│ 4 │ 2 │ 2 │
│ 4 │ 3 │ 3 │
│ 4 │ 4 │ 3 │
│ 4 │ 4 │ 4 │
└───┴───┴───┘
27 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_acyclic_path_n09t70
Knowledge graph 'test_acyclic_path_n09t70' dropped.
