Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_closure_data
Knowledge graph 'test_closure_data' created.
Switched to knowledge graph: test_closure_data
> .kg use test_closure_data
Switched to knowledge graph: test_closure_data
> +edge[(1, 2, "road"), (2, 3, "highway"), (3, 4, "road")].
Inserted 3 fact(s) into 'edge'.
> +connected(X, Y, Type) :- edge(X, Y, Type).
Rule 'connected' registered.
> +connected(X, Z, Type) :- connected(X, Y, _), edge(Y, Z, Type).
Rule 'connected' registered.
> ?- connected(X, Y, Type).
6 rows:
  (1, 2, "road")
  (1, 3, "highway")
  (1, 4, "road")
  (2, 3, "highway")
  (2, 4, "road")
  (3, 4, "road")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_closure_data
Knowledge graph 'test_closure_data' dropped.
