Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mutual
Knowledge graph 'test_mutual' created.
Switched to knowledge graph: test_mutual
> .kg use test_mutual
Switched to knowledge graph: test_mutual
> +start[(1,)].
Inserted 1 fact(s) into 'start'.
> +step_a[(1, 2), (3, 4)].
Inserted 2 fact(s) into 'step_a'.
> +step_b[(2, 3), (4, 5)].
Inserted 2 fact(s) into 'step_b'.
> +even_reach(X) :- start(X).
Rule 'even_reach' registered.
> +odd_reach(Y) :- even_reach(X), step_a(X, Y).
Rule 'odd_reach' registered.
> +even_reach(Z) :- odd_reach(Y), step_b(Y, Z).
Rule 'even_reach' registered.
> ?- even_reach(X).
1 rows:
  (1)
> ?- odd_reach(Y).
1 rows:
  (2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_mutual
Knowledge graph 'test_mutual' dropped.
