Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_linear
Knowledge graph 'test_linear' created.
Switched to knowledge graph: test_linear
> .kg use test_linear
Switched to knowledge graph: test_linear
> +succ[(1, 2), (2, 3), (3, 4), (4, 5)].
Inserted 4 fact(s) into 'succ'.
> +gte(X, X) :- succ(X, _).
Rule 'gte' registered.
> +gte(X, X) :- succ(_, X).
Rule 'gte' registered.
> +gte(X, Z) :- gte(X, Y), succ(Y, Z).
Rule 'gte' registered.
> ?- gte(1, X).
5 rows:
  (1, 1)
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
> ?- gte(3, X).
3 rows:
  (3, 3)
  (3, 4)
  (3, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_linear
Knowledge graph 'test_linear' dropped.
