Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_tree
Knowledge graph 'test_tree' created.
Switched to knowledge graph: test_tree
> .kg use test_tree
Switched to knowledge graph: test_tree
> +parent[(1, 2), (1, 3), (2, 4), (2, 5), (3, 6)].
Inserted 5 fact(s) into 'parent'.
> +descendant(P, C) :- parent(P, C).
Rule 'descendant' registered.
> +descendant(P, D) :- parent(P, C), descendant(C, D).
Rule 'descendant' registered.
> ?- descendant(1, D).
5 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (1, 6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_tree
Knowledge graph 'test_tree' dropped.
