Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_reach
Knowledge graph 'test_reach' created.
Switched to knowledge graph: test_reach
> .kg use test_reach
Switched to knowledge graph: test_reach
> +edge[(1, 2), (2, 3), (3, 4)].
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> ?- reachable(1, X).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> ?- reachable(2, X).
2 rows:
  (2, 3)
  (2, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_reach
Knowledge graph 'test_reach' dropped.
