Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sibling_n09t80
Knowledge graph 'test_sibling_n09t80' created.
Switched to knowledge graph: test_sibling_n09t80
> .kg use test_sibling_n09t80
Switched to knowledge graph: test_sibling_n09t80
> +parent[(1, 2), (1, 3), (1, 4), (2, 5), (2, 6)].
Inserted 5 fact(s) into 'parent'.
> +sibling(X, Y) :- parent(P, X), parent(P, Y), X < Y.
Rule 'sibling' registered.
> ?- sibling(X, Y).
4 rows:
  (2, 3)
  (2, 4)
  (3, 4)
  (5, 6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sibling_n09t80
Knowledge graph 'test_sibling_n09t80' dropped.
