Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_leaf
Knowledge graph 'test_leaf' created.
Switched to knowledge graph: test_leaf
> .kg use test_leaf
Switched to knowledge graph: test_leaf
> +parent[(1, 2), (1, 3), (2, 4), (2, 5)].
Inserted 4 fact(s) into 'parent'.
> +node(X) :- parent(X, _).
Rule 'node' registered.
> +node(Y) :- parent(_, Y).
Rule 'node' registered.
> +leaf(X) :- node(X), !parent(X, _).
Rule 'leaf' registered.
> ?- leaf(X).
3 rows:
  (3)
  (4)
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_leaf
Knowledge graph 'test_leaf' dropped.
