Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_root
Knowledge graph 'test_root' created.
Switched to knowledge graph: test_root
> .kg use test_root
Switched to knowledge graph: test_root
> +parent[(1, 2), (1, 3), (2, 4), (2, 5), (6, 7)].
Inserted 5 fact(s) into 'parent'.
> +node(X) :- parent(X, _).
Rule 'node' registered.
> +node(Y) :- parent(_, Y).
Rule 'node' registered.
> +root(X) :- node(X), !parent(_, X).
Rule 'root' registered.
> ?- root(X).
2 rows:
  (1)
  (6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_root
Knowledge graph 'test_root' dropped.
