Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_path_exists
Knowledge graph 'test_path_exists' created.
Switched to knowledge graph: test_path_exists
> .kg use test_path_exists
Switched to knowledge graph: test_path_exists
> +edge[(1, 2), (2, 3), (4, 5)].
Inserted 3 fact(s) into 'edge'.
> +path(X, Y) :- edge(X, Y).
Rule 'path' registered.
> +path(X, Z) :- path(X, Y), edge(Y, Z).
Rule 'path' registered.
> ?- path(1, 3).
1 rows:
  (1, 3)
> ?- path(1, 5).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_path_exists
Knowledge graph 'test_path_exists' dropped.
