Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_indirect_n09t87
Knowledge graph 'test_indirect_n09t87' created.
Switched to knowledge graph: test_indirect_n09t87
> .kg use test_indirect_n09t87
Switched to knowledge graph: test_indirect_n09t87
> +direct[(1, 2), (2, 3), (3, 4), (1, 4)]
Inserted 4 fact(s) into 'direct'.
> +indirect(X, Z) <- direct(X, Y), direct(Y, Z)
Rule 'indirect' registered.
> ?indirect(X, Z)
┌───┬───┐
│ X │ Z │
├───┼───┤
│ 1 │ 3 │
│ 2 │ 4 │
└───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_indirect_n09t87
Knowledge graph 'test_indirect_n09t87' dropped.
