Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_indirect
Knowledge graph 'test_indirect' created.
Switched to knowledge graph: test_indirect
> .kg use test_indirect
Switched to knowledge graph: test_indirect
> +direct[(1, 2), (2, 3), (3, 4), (1, 4)].
Inserted 4 fact(s) into 'direct'.
> +indirect(X, Z) :- direct(X, Y), direct(Y, Z).
Rule 'indirect' registered.
> ?- indirect(X, Z).
2 rows:
  (1, 3)
  (2, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_indirect
Knowledge graph 'test_indirect' dropped.
