Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bidir
Knowledge graph 'test_bidir' created.
Switched to knowledge graph: test_bidir
> .kg use test_bidir
Switched to knowledge graph: test_bidir
> +edge[(1, 2), (2, 3), (4, 3)].
Inserted 3 fact(s) into 'edge'.
> +undirected(X, Y) :- edge(X, Y).
Rule 'undirected' registered.
> +undirected(X, Y) :- edge(Y, X).
Rule 'undirected' registered.
> ?- undirected(X, Y).
6 rows:
  (1, 2)
  (2, 1)
  (2, 3)
  (3, 2)
  (3, 4)
  (4, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_bidir
Knowledge graph 'test_bidir' dropped.
