Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_all_paths
Knowledge graph 'test_all_paths' created.
Switched to knowledge graph: test_all_paths
> .kg use test_all_paths
Switched to knowledge graph: test_all_paths
> +edge[(1, 2), (2, 3), (1, 3)].
Inserted 3 fact(s) into 'edge'.
> +path(X, Y) :- edge(X, Y).
Rule 'path' registered.
> +path(X, Z) :- path(X, Y), edge(Y, Z).
Rule 'path' registered.
> ?- path(X, Y).
3 rows:
  (1, 2)
  (1, 3)
  (2, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_all_paths
Knowledge graph 'test_all_paths' dropped.
