Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_reverse_n09t90
Knowledge graph 'test_reverse_n09t90' created.
Switched to knowledge graph: test_reverse_n09t90
> .kg use test_reverse_n09t90
Switched to knowledge graph: test_reverse_n09t90
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> +forward(X, Y) <- edge(X, Y)
Rule 'forward' registered.
> +forward(X, Z) <- forward(X, Y), edge(Y, Z)
Rule 'forward' registered.
> +reverse(Y, X) <- edge(X, Y)
Rule 'reverse' registered.
> ?forward(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 4 │
└───┴───┘
6 rows
> ?reverse(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 2 │ 1 │
│ 3 │ 2 │
│ 4 │ 3 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_reverse_n09t90
Knowledge graph 'test_reverse_n09t90' dropped.
