Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_two_hop
Knowledge graph 'test_two_hop' created.
Switched to knowledge graph: test_two_hop
> .kg use test_two_hop
Switched to knowledge graph: test_two_hop
> +edge[(1, 2), (2, 3), (3, 4), (1, 3)].
Inserted 4 fact(s) into 'edge'.
> +two_hop(X, Z) :- edge(X, Y), edge(Y, Z).
Rule 'two_hop' registered.
> ?- two_hop(X, Z).
3 rows:
  (1, 3)
  (1, 4)
  (2, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_two_hop
Knowledge graph 'test_two_hop' dropped.
