Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rec_filter_n09t93
Knowledge graph 'test_rec_filter_n09t93' created.
Switched to knowledge graph: test_rec_filter_n09t93
> .kg use test_rec_filter_n09t93
Switched to knowledge graph: test_rec_filter_n09t93
> +edge[(1, 2, 10), (2, 3, 20), (3, 4, 5), (4, 5, 15), (1, 3, 100)]
Inserted 5 fact(s) into 'edge'.
> +light_edge(X, Y, W) <- edge(X, Y, W), W < 50
Rule 'light_edge' registered.
> +light_reach(X, Y) <- light_edge(X, Y, _)
Rule 'light_reach' registered.
> +light_reach(X, Z) <- light_reach(X, Y), light_edge(Y, Z, _)
Rule 'light_reach' registered.
> ?light_reach(1, Y)
┌───┬───┐
│ 1 │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
└───┴───┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rec_filter_n09t93
Knowledge graph 'test_rec_filter_n09t93' dropped.
