Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_loop_n09t94
Knowledge graph 'test_self_loop_n09t94' created.
Switched to knowledge graph: test_self_loop_n09t94
> .kg use test_self_loop_n09t94
Switched to knowledge graph: test_self_loop_n09t94
> +edge(1, 1)
Inserted 1 fact(s) into 'edge'.
> path(X, Y) <- edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
└──────┴──────┘
1 rows
(session: 1 rule(s))
> path(X, Z) <- path(X, Y), edge(Y, Z)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
└──────┴──────┘
1 rows
(session: 2 rule(s))
> ?path(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
└──────┴──────┘
1 rows
> +edge(2, 2)
Inserted 1 fact(s) into 'edge'.
> ?path(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
│    2 │    2 │
└──────┴──────┘
2 rows
> +edge(1, 2)
Inserted 1 fact(s) into 'edge'.
> ?path(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
│    1 │    2 │
│    2 │    2 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_self_loop_n09t94
Knowledge graph 'test_self_loop_n09t94' dropped.
