Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_magic_tc_n09t95
Knowledge graph 'test_magic_tc_n09t95' created.
Switched to knowledge graph: test_magic_tc_n09t95
> .kg use test_magic_tc_n09t95
Switched to knowledge graph: test_magic_tc_n09t95
> +edge[(1,2), (2,3), (3,4), (4,5), (10,11), (11,12)]
Inserted 6 fact(s) into 'edge'.
> +reach(X, Y) <- edge(X, Y)
Rule 'reach' registered.
> +reach(X, Z) <- reach(X, Y), edge(Y, Z)
Rule 'reach' registered.
> ?reach(1, Y)
┌───┬───┐
│ 1 │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
└───┴───┘
4 rows
> ?reach(10, Y)
┌────┬────┐
│ 10 │ Y  │
├────┼────┤
│ 10 │ 11 │
│ 10 │ 12 │
└────┴────┘
2 rows
> ?reach(1, 4)
┌───┬───┐
│ 1 │ 4 │
├───┼───┤
│ 1 │ 4 │
└───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_magic_tc_n09t95
Knowledge graph 'test_magic_tc_n09t95' dropped.
