Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_magic_ub_n09t96
Knowledge graph 'test_magic_ub_n09t96' created.
Switched to knowledge graph: test_magic_ub_n09t96
> .kg use test_magic_ub_n09t96
Switched to knowledge graph: test_magic_ub_n09t96
> +edge[(1,2), (2,3)]
Inserted 2 fact(s) into 'edge'.
> +reach(X, Y) <- edge(X, Y)
Rule 'reach' registered.
> +reach(X, Z) <- reach(X, Y), edge(Y, Z)
Rule 'reach' registered.
> ?reach(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 3 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_magic_ub_n09t96
Knowledge graph 'test_magic_ub_n09t96' dropped.
