Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rbac_deny
Knowledge graph 'test_rbac_deny' created.
Switched to knowledge graph: test_rbac_deny
> .kg use test_rbac_deny
Switched to knowledge graph: test_rbac_deny
> +user_role[(1, 100), (2, 100), (3, 101), (4, 102)].
Inserted 4 fact(s) into 'user_role'.
> +role_allow[(100, 1), (100, 2), (100, 3), (101, 1), (101, 2), (102, 1)].
Inserted 6 fact(s) into 'role_allow'.
> +user_deny[(2, 3), (3, 2)].
Inserted 2 fact(s) into 'user_deny'.
> +base_permission(User, Perm) :- user_role(User, Role), role_allow(Role, Perm).
Rule 'base_permission' registered.
> +effective_permission(User, Perm) :- base_permission(User, Perm), !user_deny(User, Perm).
Rule 'effective_permission' registered.
> ?- base_permission(U, P).
9 rows:
  (1, 1)
  (1, 2)
  (1, 3)
  (2, 1)
  (2, 2)
  (2, 3)
  (3, 1)
  (3, 2)
  (4, 1)
> ?- effective_permission(U, P).
7 rows:
  (1, 1)
  (1, 2)
  (1, 3)
  (2, 1)
  (2, 2)
  (3, 1)
  (4, 1)
> +denied(User, Perm) :- base_permission(User, Perm), user_deny(User, Perm).
Rule 'denied' registered.
> ?- denied(U, P).
2 rows:
  (2, 3)
  (3, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rbac_deny
Knowledge graph 'test_rbac_deny' dropped.
