Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_social
Knowledge graph 'test_social' created.
Switched to knowledge graph: test_social
> .kg use test_social
Switched to knowledge graph: test_social
> +friend[(1, 2), (1, 3), (2, 4), (2, 5), (3, 6), (4, 7), (5, 6), (6, 8)].
Inserted 8 fact(s) into 'friend'.
> +symmetric_friend(A, B) :- friend(A, B).
Rule 'symmetric_friend' registered.
> +symmetric_friend(A, B) :- friend(B, A).
Rule 'symmetric_friend' registered.
> +direct_friends_of_1(F) :- symmetric_friend(1, F).
Rule 'direct_friends_of_1' registered.
> ?- direct_friends_of_1(F).
2 rows:
  (2)
  (3)
> +fof(User, Fof) :- symmetric_friend(User, F), symmetric_friend(F, Fof), User != Fof, !symmetric_friend(User, Fof).
Rule 'fof' registered.
> +fof_of_1(Fof) :- fof(1, Fof).
Rule 'fof_of_1' registered.
> ?- fof_of_1(F).
3 rows:
  (4)
  (5)
  (6)
> +friend_count(User, count<Friend>) :- symmetric_friend(User, Friend).
Rule 'friend_count' registered.
> ?- friend_count(U, C).
8 rows:
  (1, 2)
  (2, 3)
  (3, 2)
  (4, 2)
  (5, 2)
  (6, 3)
  (7, 1)
  (8, 1)
> +max_friends(max<C>) :- friend_count(_, C).
Rule 'max_friends' registered.
> ?- max_friends(M).
1 rows:
  (3)
> +popular(User) :- friend_count(User, C), C >= 3.
Rule 'popular' registered.
> ?- popular(U).
2 rows:
  (2)
  (6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_social
Knowledge graph 'test_social' dropped.
