Executing script: examples/datalog/20_applications/03_friends_of_friends.dl

> .db create test_social
Database 'test_social' created.
Switched to database: test_social
> .db use test_social
Switched to database: test_social
> +friend[(1, 2), (1, 3), (2, 4), (2, 5), (3, 6), (4, 7), (5, 6), (6, 8)].
Inserted 8 facts into 'friend'.
> +symmetric_friend(A, B) :- friend(A, B).
Rule 'symmetric_friend' registered.
> +symmetric_friend(A, B) :- friend(B, A).
Rule added to 'symmetric_friend' (2 rules total).
> +direct_friends_of_1(F) :- symmetric_friend(1, F).
Rule 'direct_friends_of_1' registered.
> ?- direct_friends_of_1(F).
2 rows:
  (2)
  (3)
> +fof(User, Fof) :- symmetric_friend(User, F), symmetric_friend(F, Fof), User != Fof, !symmetric_friend(User, Fof).
Rule 'fof' registered.
> +fof_of_1(Fof) :- fof(1, Fof).
Rule 'fof_of_1' registered.
> ?- fof_of_1(F).
3 rows:
  (4)
  (5)
  (6)
> +friend_count(User, count<Friend>) :- symmetric_friend(User, Friend).
Script error: Line 29: Parse error: Invalid term: 'count<Friend>'
