Executing script: examples/datalog/20_applications/03_friends_of_friends.dl

> .db create test_social
Database 'test_social' created.
Switched to database: test_social
> .db use test_social
Switched to database: test_social
> +friend[(1, 2), (1, 3), (2, 4), (2, 5), (3, 6), (4, 7), (5, 6), (6, 8)].
Inserted 8 facts into 'friend'.
> view symmetric_friend(A: int, B: int) :- friend(A, B).
View 'symmetric_friend' registered.
> view symmetric_friend(A: int, B: int) :- friend(B, A).
Rule added to view 'symmetric_friend' (2 rules total).
> view direct_friends_of_1(F: int) :- symmetric_friend(1, F).
View 'direct_friends_of_1' registered.
> ?- direct_friends_of_1(F).
2 rows:
  (2)
  (3)
> view fof(User: int, Fof: int) :- symmetric_friend(User, F), symmetric_friend(F, Fof), User != Fof, !symmetric_friend(User, Fof).
View 'fof' registered.
> view fof_of_1(Fof: int) :- fof(1, Fof).
View 'fof_of_1' registered.
> ?- fof_of_1(F).
3 rows:
  (4)
  (5)
  (6)
> view friend_count(User: int, count<Friend>: int) :- symmetric_friend(User, Friend).
View 'friend_count' registered.
> ?- friend_count(U, C).
8 rows:
  (1, 2)
  (2, 3)
  (3, 2)
  (4, 2)
  (5, 2)
  (6, 3)
  (7, 1)
  (8, 1)
> view max_friends(max<C>: int) :- friend_count(_, C).
View 'max_friends' registered.
> ?- max_friends(M).
1 rows:
  (3)
> view popular(User: int) :- friend_count(User, C), C >= 3.
View 'popular' registered.
> ?- popular(U).
2 rows:
  (2)
  (6)
> .db use default
Switched to database: default
> .db drop test_social
Database 'test_social' dropped.
