Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_influence_n20t04
Knowledge graph 'test_influence_n20t04' created.
Switched to knowledge graph: test_influence_n20t04
> .kg use test_influence_n20t04
Switched to knowledge graph: test_influence_n20t04
> +follows[(1, 2), (1, 3), (2, 4), (3, 4), (4, 5), (5, 6), (6, 7), (3, 7)]
Inserted 8 fact(s) into 'follows'.
> +influencer[(1)]
Inserted 1 fact(s) into 'influencer'.
> +influenced(X) <- influencer(X)
Rule 'influenced' registered.
> +influenced(Y) <- influenced(X), follows(Y, X)
Rule 'influenced' registered.
> ?influenced(U)
┌───┐
│ U │
├───┤
│ 1 │
└───┘
1 rows
> +influence_reach(count<U>) <- influenced(U)
Rule 'influence_reach' registered.
> ?influence_reach(C)
┌───┐
│ C │
├───┤
│ 1 │
└───┘
1 rows
> +influence_dist(X, 0) <- influencer(X)
Rule 'influence_dist' registered.
> +influence_dist(Y, D+1) <- influence_dist(X, D), follows(Y, X), D < 10
Rule 'influence_dist' registered.
> +min_dist(User, min<D>) <- influence_dist(User, D)
Rule 'min_dist' registered.
> ?min_dist(U, D)
┌───┬───┐
│ U │ D │
├───┼───┤
│ 1 │ 0 │
└───┴───┘
1 rows
> +at_distance(D, count<U>) <- min_dist(U, D)
Rule 'at_distance' registered.
> ?at_distance(D, C)
┌───┬───┐
│ D │ C │
├───┼───┤
│ 0 │ 1 │
└───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_influence_n20t04
Knowledge graph 'test_influence_n20t04' dropped.
