Executing script: examples/datalog/20_applications/05_bom_explosion.dl

> .db create test_bom
Database 'test_bom' created.
Switched to database: test_bom
> .db use test_bom
Switched to database: test_bom
> +part_of[(100, 1, 1), (200, 1, 1), (300, 1, 4), (101, 100, 4), (102, 100, 1), (103, 100, 1), (201, 200, 1), (202, 200, 2)].
Inserted 8 facts into 'part_of'.
> +part_name[(1, 1000), (100, 1001), (200, 1002), (300, 1003), (101, 1004), (102, 1005), (103, 1006), (201, 1007), (202, 1008)].
Inserted 9 facts into 'part_name'.
> view direct_component(Assembly: int, Component: int, Qty: int) :- part_of(Component, Assembly, Qty).
View 'direct_component' registered.
> view all_components(Assembly: int, Component: int) :- direct_component(Assembly, Component, _).
View 'all_components' registered.
> view all_components(Assembly: int, SubComponent: int) :- direct_component(Assembly, Component, _), all_components(Component, SubComponent).
Rule added to view 'all_components' (2 rules total).
> view car_components(C: int) :- all_components(1, C).
View 'car_components' registered.
> ?- car_components(C).
8 rows:
  (100)
  (101)
  (102)
  (103)
  (200)
  (201)
  (202)
  (300)
> view part_count(count<P>: int) :- car_components(P).
View 'part_count' registered.
> ?- part_count(C).
1 rows:
  (8)
> ?- direct_component(1, Component, Qty).
3 rows:
  (1, 100, 1)
  (1, 200, 1)
  (1, 300, 4)
> view has_children(P: int) :- part_of(_, P, _).
View 'has_children' registered.
> view leaf_part(P: int) :- car_components(P), !has_children(P).
View 'leaf_part' registered.
> ?- leaf_part(P).
6 rows:
  (101)
  (102)
  (103)
  (201)
  (202)
  (300)
> .db use default
Switched to database: default
> .db drop test_bom
Database 'test_bom' dropped.
