Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_deps
Knowledge graph 'test_deps' created.
Switched to knowledge graph: test_deps
> .kg use test_deps
Switched to knowledge graph: test_deps
> +depends[(1, 2), (1, 3), (2, 4), (2, 5), (3, 5), (3, 6), (4, 7), (5, 7), (5, 8), (6, 8)].
Inserted 10 fact(s) into 'depends'.
> +all_deps(Pkg, Dep) :- depends(Pkg, Dep).
Rule 'all_deps' registered.
> +all_deps(Pkg, TransDep) :- depends(Pkg, Dep), all_deps(Dep, TransDep).
Rule 'all_deps' registered.
> +deps_of_1(D) :- all_deps(1, D).
Rule 'deps_of_1' registered.
> ?- deps_of_1(D).
7 rows:
  (2)
  (3)
  (4)
  (5)
  (6)
  (7)
  (8)
> +dep_count(Pkg, count<D>) :- all_deps(Pkg, D).
Rule 'dep_count' registered.
> ?- dep_count(P, C).
6 rows:
  (1, 7)
  (2, 4)
  (3, 4)
  (4, 1)
  (5, 2)
  (6, 1)
> +has_deps(P) :- depends(P, _).
Rule 'has_deps' registered.
> +leaf_pkg(P) :- depends(_, P), !has_deps(P).
Rule 'leaf_pkg' registered.
> ?- leaf_pkg(P).
2 rows:
  (7)
  (8)
> +reverse_dep(7, Pkg) :- all_deps(Pkg, 7).
Rule 'reverse_dep' registered.
> ?- reverse_dep(7, P).
5 rows:
  (7, 1)
  (7, 2)
  (7, 3)
  (7, 4)
  (7, 5)
> +used_by(Dep, Pkg) :- all_deps(Pkg, Dep).
Rule 'used_by' registered.
> +use_count(Dep, count<P>) :- used_by(Dep, P).
Rule 'use_count' registered.
> ?- use_count(D, C).
7 rows:
  (2, 1)
  (3, 1)
  (4, 2)
  (5, 3)
  (6, 2)
  (7, 5)
  (8, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_deps
Knowledge graph 'test_deps' dropped.
