Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_conflicts_n20t08
Knowledge graph 'test_conflicts_n20t08' created.
Switched to knowledge graph: test_conflicts_n20t08
> .kg use test_conflicts_n20t08
Switched to knowledge graph: test_conflicts_n20t08
> +requires[(1, 100, 1, 3), (1, 101, 2, 5), (2, 100, 2, 4), (2, 101, 1, 2), (3, 100, 4, 6), (3, 102, 1, 10)].
Inserted 6 fact(s) into 'requires'.
> +root_pkg[(1), (2)].
Inserted 2 fact(s) into 'root_pkg'.
> +root_requires(Dep, MinV, MaxV) :- root_pkg(Pkg), requires(Pkg, Dep, MinV, MaxV).
Rule 'root_requires' registered.
> ?- root_requires(D, Min, Max).
4 rows:
  (100, 1, 3)
  (100, 2, 4)
  (101, 1, 2)
  (101, 2, 5)
> +version_conflict(Dep, Pkg1, Pkg2) :- requires(Pkg1, Dep, Min1, Max1), requires(Pkg2, Dep, Min2, Max2), Pkg1 < Pkg2, Max1 < Min2.
Rule 'version_conflict' registered.
> +version_conflict(Dep, Pkg1, Pkg2) :- requires(Pkg1, Dep, Min1, Max1), requires(Pkg2, Dep, Min2, Max2), Pkg1 < Pkg2, Max2 < Min1.
Rule 'version_conflict' registered.
> ?- version_conflict(Dep, P1, P2).
14 rows:
  (1, 100, 1, 3, 1, 1, 3)
  (1, 100, 1, 3, 2, 2, 4)
  (1, 100, 1, 3, 3, 4, 6)
  (1, 101, 2, 5, 1, 2, 5)
  (1, 101, 2, 5, 2, 1, 2)
  (2, 100, 2, 4, 1, 1, 3)
  (2, 100, 2, 4, 2, 2, 4)
  (2, 100, 2, 4, 3, 4, 6)
  (2, 101, 1, 2, 1, 2, 5)
  (2, 101, 1, 2, 2, 1, 2)
  (3, 100, 4, 6, 1, 1, 3)
  (3, 100, 4, 6, 2, 2, 4)
  (3, 100, 4, 6, 3, 4, 6)
  (3, 102, 1, 10, 3, 1, 10)
> +compatible(Dep, Pkg1, Pkg2) :- requires(Pkg1, Dep, Min1, Max1), requires(Pkg2, Dep, Min2, Max2), Pkg1 < Pkg2, Max1 >= Min2, Max2 >= Min1.
Rule 'compatible' registered.
> ?- compatible(Dep, P1, P2).
3 rows:
  (100, 1, 2)
  (100, 2, 3)
  (101, 1, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_conflicts_n20t08
Knowledge graph 'test_conflicts_n20t08' dropped.
