Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_conflicts
Knowledge graph 'test_conflicts' created.
Switched to knowledge graph: test_conflicts
> .kg use test_conflicts
Switched to knowledge graph: test_conflicts
> +requires[(1, 100, 1, 3), (1, 101, 2, 5), (2, 100, 2, 4), (2, 101, 1, 2), (3, 100, 4, 6), (3, 102, 1, 10)].
Inserted 6 fact(s) into 'requires'.
> +root_pkg[(1), (2)].
Inserted 2 fact(s) into 'root_pkg'.
> +root_requires(Dep, MinV, MaxV) :- root_pkg(Pkg), requires(Pkg, Dep, MinV, MaxV).
Rule 'root_requires' registered.
> ?- root_requires(D, Min, Max).
4 rows:
  (100, 1, 3)
  (100, 2, 4)
  (101, 1, 2)
  (101, 2, 5)
> +version_conflict(Dep, Pkg1, Pkg2) :- requires(Pkg1, Dep, Min1, Max1), requires(Pkg2, Dep, Min2, Max2), Pkg1 < Pkg2, Max1 < Min2.
Rule 'version_conflict' registered.
> +version_conflict(Dep, Pkg1, Pkg2) :- requires(Pkg1, Dep, Min1, Max1), requires(Pkg2, Dep, Min2, Max2), Pkg1 < Pkg2, Max2 < Min1.
Rule 'version_conflict' registered.
> ?- version_conflict(Dep, P1, P2).
No results.
> +compatible(Dep, Pkg1, Pkg2) :- requires(Pkg1, Dep, Min1, Max1), requires(Pkg2, Dep, Min2, Max2), Pkg1 < Pkg2, Max1 >= Min2, Max2 >= Min1.
Rule 'compatible' registered.
> ?- compatible(Dep, P1, P2).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_conflicts
Knowledge graph 'test_conflicts' dropped.
