Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_org_n20t09
Knowledge graph 'test_org_n20t09' created.
Switched to knowledge graph: test_org_n20t09
> .kg use test_org_n20t09
Switched to knowledge graph: test_org_n20t09
> +reports_to[(2, 1), (3, 1), (4, 1), (5, 2), (6, 2), (7, 3), (8, 3), (9, 3), (10, 4), (11, 5), (12, 6), (13, 7), (14, 8)].
Inserted 13 fact(s) into 'reports_to'.
> +ceo[(1)].
Inserted 1 fact(s) into 'ceo'.
> +level(E, 0) :- ceo(E).
Rule 'level' registered.
> +level(E, L+1) :- reports_to(E, M), level(M, L).
Rule 'level' registered.
> ?- level(E, L).
14 rows:
  (1, 0)
  (2, 1)
  (3, 1)
  (4, 1)
  (5, 2)
  (6, 2)
  (7, 2)
  (8, 2)
  (9, 2)
  (10, 2)
  (11, 3)
  (12, 3)
  (13, 3)
  (14, 3)
> +level_count(L, count<E>) :- level(E, L).
Rule 'level_count' registered.
> ?- level_count(L, C).
4 rows:
  (0, 1)
  (1, 3)
  (2, 6)
  (3, 4)
> +subordinate(Mgr, Emp) :- reports_to(Emp, Mgr).
Rule 'subordinate' registered.
> +subordinate(Mgr, Emp) :- reports_to(Emp, Mid), subordinate(Mgr, Mid).
Rule 'subordinate' registered.
> +sub_count(Mgr, count<E>) :- subordinate(Mgr, E).
Rule 'sub_count' registered.
> ?- sub_count(M, C).
8 rows:
  (1, 13)
  (2, 4)
  (3, 5)
  (4, 1)
  (5, 1)
  (6, 1)
  (7, 1)
  (8, 1)
> +large_team(Mgr) :- sub_count(Mgr, C), C >= 3.
Rule 'large_team' registered.
> ?- large_team(M).
3 rows:
  (1)
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_org_n20t09
Knowledge graph 'test_org_n20t09' dropped.
