Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ancestor_n20t10
Knowledge graph 'test_ancestor_n20t10' created.
Switched to knowledge graph: test_ancestor_n20t10
> .kg use test_ancestor_n20t10
Switched to knowledge graph: test_ancestor_n20t10
> +parent[(2, 1), (3, 1), (4, 2), (5, 2), (6, 3), (7, 3), (8, 4), (9, 4), (10, 6)]
Inserted 9 fact(s) into 'parent'.
> +ancestor(X, A) <- parent(X, A)
Rule 'ancestor' registered.
> +ancestor(X, A) <- parent(X, P), ancestor(P, A)
Rule 'ancestor' registered.
> +ancestors_of_8(A) <- ancestor(8, A)
Rule 'ancestors_of_8' registered.
> ?ancestors_of_8(A)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    4 │
└──────┘
3 rows
> +ancestors_of_10(A) <- ancestor(10, A)
Rule 'ancestors_of_10' registered.
> ?ancestors_of_10(A)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
│    6 │
└──────┘
3 rows
> +common_ancestor(A) <- ancestor(8, A), ancestor(10, A)
Rule 'common_ancestor' registered.
> ?common_ancestor(A)
┌──────┐
│ col0 │
├──────┤
│    1 │
└──────┘
1 rows
> +ancestor_dist(X, A, 1) <- parent(X, A)
Rule 'ancestor_dist' registered.
> +ancestor_dist(X, A, D+1) <- parent(X, P), ancestor_dist(P, A, D)
Rule 'ancestor_dist' registered.
> +dist_from_8(A, min<D>) <- ancestor_dist(8, A, D)
Rule 'dist_from_8' registered.
> ?dist_from_8(A, D)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
│    2 │    2 │
│    4 │    1 │
└──────┴──────┘
3 rows
> +dist_from_10(A, min<D>) <- ancestor_dist(10, A, D)
Rule 'dist_from_10' registered.
> ?dist_from_10(A, D)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
│    3 │    2 │
│    6 │    1 │
└──────┴──────┘
3 rows
> +common_dist(A, D1+D2) <- dist_from_8(A, D1), dist_from_10(A, D2)
Rule 'common_dist' registered.
> ?common_dist(A, D)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    6 │
└──────┴──────┘
1 rows
> +min_common_dist(min<D>) <- common_dist(_, D)
Rule 'min_common_dist' registered.
> ?min_common_dist(D)
┌──────┐
│ col0 │
├──────┤
│    6 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_ancestor_n20t10
Knowledge graph 'test_ancestor_n20t10' dropped.
