Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_atomic_update_n27t01
Knowledge graph 'test_atomic_update_n27t01' created.
Switched to knowledge graph: test_atomic_update_n27t01
> .kg use test_atomic_update_n27t01
Switched to knowledge graph: test_atomic_update_n27t01
> +counter[(1, 0), (2, 10), (3, 20)]
Inserted 3 fact(s) into 'counter'.
> ?counter(Id, Value)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    0 │
│    2 │   10 │
│    3 │   20 │
└──────┴──────┘
3 rows
> -counter(1, 0)
Deleted 1 facts from 'counter'.
> +counter(1, 5)
Inserted 1 fact(s) into 'counter'.
> ?counter(Id, Value)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    5 │
│    2 │   10 │
│    3 │   20 │
└──────┴──────┘
3 rows
> -counter(2, 10)
Deleted 1 facts from 'counter'.
> +counter(2, 20)
Inserted 1 fact(s) into 'counter'.
> ?counter(Id, Value)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    5 │
│    2 │   20 │
│    3 │   20 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_atomic_update_n27t01
Knowledge graph 'test_atomic_update_n27t01' dropped.
