Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_bulk_delete_n27t03
Knowledge graph 'test_bulk_delete_n27t03' created.
Switched to knowledge graph: test_bulk_delete_n27t03
> .kg use test_bulk_delete_n27t03
Switched to knowledge graph: test_bulk_delete_n27t03
> +entry(1, 1)
Inserted 1 fact(s) into 'entry'.
> +entry(2, 2)
Inserted 1 fact(s) into 'entry'.
> +entry(3, 1)
Inserted 1 fact(s) into 'entry'.
> +entry(4, 2)
Inserted 1 fact(s) into 'entry'.
> +entry(5, 1)
Inserted 1 fact(s) into 'entry'.
> +entry(6, 3)
Inserted 1 fact(s) into 'entry'.
> ?entry(Id, Type)
┌────┬──────┐
│ Id │ Type │
├────┼──────┤
│  1 │    1 │
│  2 │    2 │
│  3 │    1 │
│  4 │    2 │
│  5 │    1 │
│  6 │    3 │
└────┴──────┘
6 rows
> -entry(Id, Type) <- entry(Id, Type), Type = 2
Conditional delete: 2 fact(s) deleted from 'entry'.
> ?entry(Id, Type)
┌────┬──────┐
│ Id │ Type │
├────┼──────┤
│  1 │    1 │
│  3 │    1 │
│  5 │    1 │
│  6 │    3 │
└────┴──────┘
4 rows
> -entry(Id, Type) <- entry(Id, Type), Id > 4
Conditional delete: 2 fact(s) deleted from 'entry'.
> ?entry(Id, Type)
┌────┬──────┐
│ Id │ Type │
├────┼──────┤
│  1 │    1 │
│  3 │    1 │
└────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_bulk_delete_n27t03
Knowledge graph 'test_bulk_delete_n27t03' dropped.
