Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create bulk_delete_test
Knowledge graph 'bulk_delete_test' created.
Switched to knowledge graph: bulk_delete_test
> .kg use bulk_delete_test
Switched to knowledge graph: bulk_delete_test
> +entry(1, 1).
Inserted 1 fact(s) into 'entry'.
> +entry(2, 2).
Inserted 1 fact(s) into 'entry'.
> +entry(3, 1).
Inserted 1 fact(s) into 'entry'.
> +entry(4, 2).
Inserted 1 fact(s) into 'entry'.
> +entry(5, 1).
Inserted 1 fact(s) into 'entry'.
> +entry(6, 3).
Inserted 1 fact(s) into 'entry'.
> ?- entry(Id, Type).
6 rows:
  (1, 1)
  (2, 2)
  (3, 1)
  (4, 2)
  (5, 1)
  (6, 3)
> -entry(Id, Type) :- entry(Id, Type), Type = 2.
Conditional delete: 2 fact(s) deleted from 'entry'.
> ?- entry(Id, Type).
4 rows:
  (1, 1)
  (3, 1)
  (5, 1)
  (6, 3)
> -entry(Id, Type) :- entry(Id, Type), Id > 4.
Conditional delete: 2 fact(s) deleted from 'entry'.
> ?- entry(Id, Type).
2 rows:
  (1, 1)
  (3, 1)
> .kg use default
Switched to knowledge graph: default
> .kg drop bulk_delete_test
Knowledge graph 'bulk_delete_test' dropped.
