Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_delete_all_n27t04
Knowledge graph 'test_delete_all_n27t04' created.
Switched to knowledge graph: test_delete_all_n27t04
> .kg use test_delete_all_n27t04
Switched to knowledge graph: test_delete_all_n27t04
> +temp_data(1, 100).
Inserted 1 fact(s) into 'temp_data'.
> +temp_data(2, 200).
Inserted 1 fact(s) into 'temp_data'.
> +temp_data(3, 300).
Inserted 1 fact(s) into 'temp_data'.
> ?- temp_data(Id, Value).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> -temp_data(Id, Value) :- temp_data(Id, Value).
Conditional delete: 3 fact(s) deleted from 'temp_data'.
> ?- temp_data(Id, Value).
No results.
> +temp_data(10, 999).
Inserted 1 fact(s) into 'temp_data'.
> ?- temp_data(Id, Value).
1 rows:
  (10, 999)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_delete_all_n27t04
Knowledge graph 'test_delete_all_n27t04' dropped.
