Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create delete_all_test
Knowledge graph 'delete_all_test' created.
Switched to knowledge graph: delete_all_test
> .kg use delete_all_test
Switched to knowledge graph: delete_all_test
> +temp_data(1, 100).
Inserted 1 fact(s) into 'temp_data'.
> +temp_data(2, 200).
Inserted 1 fact(s) into 'temp_data'.
> +temp_data(3, 300).
Inserted 1 fact(s) into 'temp_data'.
> ?- temp_data(Id, Value).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> -temp_data(Id, Value) :- temp_data(Id, Value).
Conditional delete not yet supported over HTTP. Use query API.
> ?- temp_data(Id, Value).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> +temp_data(10, 999).
Inserted 1 fact(s) into 'temp_data'.
> ?- temp_data(Id, Value).
4 rows:
  (1, 100)
  (2, 200)
  (3, 300)
  (10, 999)
> .kg use default
Switched to knowledge graph: default
> .kg drop delete_all_test
Knowledge graph 'delete_all_test' dropped.
