Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_cond_del_all_n27t07
Knowledge graph 'test_cond_del_all_n27t07' created.
Switched to knowledge graph: test_cond_del_all_n27t07
> .kg use test_cond_del_all_n27t07
Switched to knowledge graph: test_cond_del_all_n27t07
> +items[(1, "a"), (2, "b"), (3, "c"), (4, "d")]
Inserted 4 fact(s) into 'items'.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │ "a" │
│  2 │ "b" │
│  3 │ "c" │
│  4 │ "d" │
└────┴─────┘
4 rows
> -items(X, Y) <- items(X, Y)
Conditional delete: 4 fact(s) deleted from 'items'.
> ?items(Id, Val)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cond_del_all_n27t07
Knowledge graph 'test_cond_del_all_n27t07' dropped.
