Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cond_del_join
Knowledge graph 'test_cond_del_join' created.
Switched to knowledge graph: test_cond_del_join
> .kg use test_cond_del_join
Switched to knowledge graph: test_cond_del_join
> +products[(1, "apple", 100), (2, "banana", 50), (3, "cherry", 200)].
Inserted 3 fact(s) into 'products'.
> +remove_list[(1), (3)].
Inserted 2 fact(s) into 'remove_list'.
> ?- products(Id, Name, Price).
3 rows:
  (1, "apple", 100)
  (2, "banana", 50)
  (3, "cherry", 200)
> -products(Id, Name, Price) :- remove_list(Id), products(Id, Name, Price).
Conditional delete: 2 fact(s) deleted from 'products'.
> ?- products(Id, Name, Price).
1 rows:
  (2, "banana", 50)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cond_del_join
Knowledge graph 'test_cond_del_join' dropped.
