Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_del_ins
Knowledge graph 'test_del_ins' created.
Switched to knowledge graph: test_del_ins
> .kg use test_del_ins
Switched to knowledge graph: test_del_ins
> +inventory[(1, "Widget", 100), (2, "Gadget", 50)].
Inserted 2 fact(s) into 'inventory'.
> ?- inventory(Id, Name, Qty).
2 rows:
  (1, "Widget", 100)
  (2, "Gadget", 50)
> -inventory(1, "Widget", 100).
Deleted 1 facts from 'inventory'.
> +inventory[(1, "Widget", 150)].
Inserted 1 fact(s) into 'inventory'.
> ?- inventory(Id, Name, Qty).
2 rows:
  (1, "Widget", 150)
  (2, "Gadget", 50)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del_ins
Knowledge graph 'test_del_ins' dropped.
