Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_del_join_n27t12
Knowledge graph 'test_del_join_n27t12' created.
Switched to knowledge graph: test_del_join_n27t12
> .kg use test_del_join_n27t12
Switched to knowledge graph: test_del_join_n27t12
> +products[(1, "Widget", 100), (2, "Gadget", 200), (3, "Gizmo", 150)]
Inserted 3 fact(s) into 'products'.
> +discontinued[(1,), (3,)]
Inserted 2 fact(s) into 'discontinued'.
> ?products(Id, Name, Price)
┌──────┬──────────┬──────┐
│ col0 │ col1     │ col2 │
├──────┼──────────┼──────┤
│    1 │ "Widget" │  100 │
│    2 │ "Gadget" │  200 │
│    3 │ "Gizmo"  │  150 │
└──────┴──────────┴──────┘
3 rows
> -products(Id, Name, Price) <- products(Id, Name, Price), discontinued(Id)
Conditional delete: 2 fact(s) deleted from 'products'.
> ?products(Id, Name, Price)
┌──────┬──────────┬──────┐
│ col0 │ col1     │ col2 │
├──────┼──────────┼──────┤
│    2 │ "Gadget" │  200 │
└──────┴──────────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del_join_n27t12
Knowledge graph 'test_del_join_n27t12' dropped.
