Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cond_update_n27t20
Knowledge graph 'test_cond_update_n27t20' created.
Switched to knowledge graph: test_cond_update_n27t20
> .kg use test_cond_update_n27t20
Switched to knowledge graph: test_cond_update_n27t20
> +inventory[(1, "Widget", 10), (2, "Gadget", 5), (3, "Gizmo", 20)]
Inserted 3 fact(s) into 'inventory'.
> ?inventory(Id, Name, Qty)
┌────┬──────────┬─────┐
│ Id │ Name     │ Qty │
├────┼──────────┼─────┤
│  1 │ "Widget" │  10 │
│  2 │ "Gadget" │   5 │
│  3 │ "Gizmo"  │  20 │
└────┴──────────┴─────┘
3 rows
> -inventory(Id, Name, Qty) <- inventory(Id, Name, Qty), Qty < 10
Conditional delete: 1 fact(s) deleted from 'inventory'.
> ?inventory(Id, Name, Qty)
┌────┬──────────┬─────┐
│ Id │ Name     │ Qty │
├────┼──────────┼─────┤
│  1 │ "Widget" │  10 │
│  3 │ "Gizmo"  │  20 │
└────┴──────────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cond_update_n27t20
Knowledge graph 'test_cond_update_n27t20' dropped.
