Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_insert_query_n27t21
Knowledge graph 'test_insert_query_n27t21' created.
Switched to knowledge graph: test_insert_query_n27t21
> .kg use test_insert_query_n27t21
Switched to knowledge graph: test_insert_query_n27t21
> +source[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'source'.
> +doubled(Id, Val) <- source(Id, V), Val = V * 2
Rule 'doubled' registered.
> ?doubled(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │  20 │
│  2 │  40 │
│  3 │  60 │
└────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_insert_query_n27t21
Knowledge graph 'test_insert_query_n27t21' dropped.
