Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_del_all_n27t22
Knowledge graph 'test_del_all_n27t22' created.
Switched to knowledge graph: test_del_all_n27t22
> .kg use test_del_all_n27t22
Switched to knowledge graph: test_del_all_n27t22
> +items[(1, "A", 100), (2, "B", 200), (3, "A", 150), (4, "C", 50)]
Inserted 4 fact(s) into 'items'.
> ?items(Id, Cat, Val)
┌────┬─────┬─────┐
│ Id │ Cat │ Val │
├────┼─────┼─────┤
│  1 │ "A" │ 100 │
│  2 │ "B" │ 200 │
│  3 │ "A" │ 150 │
│  4 │ "C" │  50 │
└────┴─────┴─────┘
4 rows
> -items(Id, Cat, Val) <- items(Id, Cat, Val), Cat = "A"
Conditional delete: 2 fact(s) deleted from 'items'.
> ?items(Id, Cat, Val)
┌────┬─────┬─────┐
│ Id │ Cat │ Val │
├────┼─────┼─────┤
│  2 │ "B" │ 200 │
│  4 │ "C" │  50 │
└────┴─────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del_all_n27t22
Knowledge graph 'test_del_all_n27t22' dropped.
