Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_upsert
Knowledge graph 'test_upsert' created.
Switched to knowledge graph: test_upsert
> .kg use test_upsert
Switched to knowledge graph: test_upsert
> +data[(1, "old1"), (2, "old2")].
Inserted 2 fact(s) into 'data'.
> ?- data(Id, Val).
2 rows:
  (1, "old1")
  (2, "old2")
> +data[(2, "new2"), (3, "new3")].
Inserted 2 fact(s) into 'data'.
> ?- data(Id, Val).
4 rows:
  (1, "old1")
  (2, "new2")
  (2, "old2")
  (3, "new3")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_upsert
Knowledge graph 'test_upsert' dropped.
