Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cascade_n27t30
Knowledge graph 'test_cascade_n27t30' created.
Switched to knowledge graph: test_cascade_n27t30
> .kg use test_cascade_n27t30
Switched to knowledge graph: test_cascade_n27t30
> +parent[(1, "A"), (2, "B")]
Inserted 2 fact(s) into 'parent'.
> +child[(1, 1, "c1"), (2, 1, "c2"), (3, 2, "c3")]
Inserted 3 fact(s) into 'child'.
> ?parent(Id, Name)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │ "A"  │
│    2 │ "B"  │
└──────┴──────┘
2 rows
> ?child(ChildId, ParentId, Name)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    1 │ "c1" │
│    2 │    1 │ "c2" │
│    3 │    2 │ "c3" │
└──────┴──────┴──────┘
3 rows
