Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cascade
Knowledge graph 'test_cascade' created.
Switched to knowledge graph: test_cascade
> .kg use test_cascade
Switched to knowledge graph: test_cascade
> +parent[(1, "A"), (2, "B")].
Inserted 2 fact(s) into 'parent'.
> +child[(1, 1, "c1"), (2, 1, "c2"), (3, 2, "c3")].
Inserted 3 fact(s) into 'child'.
> ?- parent(Id, Name).
2 rows:
  (1, "A")
  (2, "B")
> ?- child(ChildId, ParentId, Name).
3 rows:
  (1, 1, "c1")
  (2, 1, "c2")
  (3, 2, "c3")
> -parent(Id, Name) :- parent(Id, Name), Id = 1.
Conditional delete: 1 fact(s) deleted from 'parent'.
> ?- parent(Id, Name).
1 rows:
  (2, "B")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cascade
Knowledge graph 'test_cascade' dropped.
