Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_cond_del_empty_n27t33
Knowledge graph 'test_cond_del_empty_n27t33' created.
Switched to knowledge graph: test_cond_del_empty_n27t33
> .kg use test_cond_del_empty_n27t33
Switched to knowledge graph: test_cond_del_empty_n27t33
> +items[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'items'.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │  10 │
│  2 │  20 │
│  3 │  30 │
└────┴─────┘
3 rows
> -items(Id, Val) <- items(Id, Val), Val > 1000
Conditional delete: 0 fact(s) deleted from 'items'.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │  10 │
│  2 │  20 │
│  3 │  30 │
└────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cond_del_empty_n27t33
Knowledge graph 'test_cond_del_empty_n27t33' dropped.
