Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_update_computed_n27t34
Knowledge graph 'test_update_computed_n27t34' created.
Switched to knowledge graph: test_update_computed_n27t34
> .kg use test_update_computed_n27t34
Switched to knowledge graph: test_update_computed_n27t34
> +prices[(1, 100), (2, 200), (3, 300)]
Inserted 3 fact(s) into 'prices'.
> ?prices(Id, Price)
┌────┬───────┐
│ Id │ Price │
├────┼───────┤
│  1 │   100 │
│  2 │   200 │
│  3 │   300 │
└────┴───────┘
3 rows
> -prices(Id, Price)
Delete error: Cannot insert variable 'Id' - use constants only
> +prices(Id, NewPrice) <- prices(Id, Price), NewPrice = Price + Price / 10
Rule 'prices' registered.
> ?prices(Id, Price)
┌────┬───────┐
│ Id │ Price │
├────┼───────┤
│  1 │ 110.0 │
│  2 │ 220.0 │
│  3 │ 330.0 │
└────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_update_computed_n27t34
Knowledge graph 'test_update_computed_n27t34' dropped.
