Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_del_ins_n27t35
Knowledge graph 'test_del_ins_n27t35' created.
Switched to knowledge graph: test_del_ins_n27t35
> .kg use test_del_ins_n27t35
Switched to knowledge graph: test_del_ins_n27t35
> +inventory[(1, "Widget", 100), (2, "Gadget", 50)]
Inserted 2 fact(s) into 'inventory'.
> ?inventory(Id, Name, Qty)
┌──────┬──────────┬──────┐
│ col0 │ col1     │ col2 │
├──────┼──────────┼──────┤
│    1 │ "Widget" │  100 │
│    2 │ "Gadget" │   50 │
└──────┴──────────┴──────┘
2 rows
> -inventory(1, "Widget", 100)
Deleted 1 facts from 'inventory'.
> +inventory[(1, "Widget", 150)]
Inserted 1 fact(s) into 'inventory'.
> ?inventory(Id, Name, Qty)
┌──────┬──────────┬──────┐
│ col0 │ col1     │ col2 │
├──────┼──────────┼──────┤
│    1 │ "Widget" │  150 │
│    2 │ "Gadget" │   50 │
└──────┴──────────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del_ins_n27t35
Knowledge graph 'test_del_ins_n27t35' dropped.
