Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_unicode
Knowledge graph 'test_unicode' created.
Switched to knowledge graph: test_unicode
> .kg use test_unicode
Switched to knowledge graph: test_unicode
> +greeting[(1, "Hello World"), (2, "Bonjour"), (3, "Hola")].
Inserted 3 fact(s) into 'greeting'.
> ?- greeting(Id, Msg).
3 rows:
  (1, "Hello World")
  (2, "Bonjour")
  (3, "Hola")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_unicode
Knowledge graph 'test_unicode' dropped.
