Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_special_chars
Knowledge graph 'test_special_chars' created.
Switched to knowledge graph: test_special_chars
> .kg use test_special_chars
Switched to knowledge graph: test_special_chars
> +text[(1, "line1\nline2"), (2, "tab\there"), (3, "quote: \"hello\"")].
Inserted 3 fact(s) into 'text'.
> ?- text(Id, T).
3 rows:
  (1, "line1\nline2")
  (2, "tab\there")
  (3, "quote: \"hello\"")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_special_chars
Knowledge graph 'test_special_chars' dropped.
