Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_quotes
Knowledge graph 'test_str_quotes' created.
Switched to knowledge graph: test_str_quotes
> .kg use test_str_quotes
Switched to knowledge graph: test_str_quotes
> +messages[(1, "He said \"hello\""), (2, "It's fine"), (3, "A 'quote' here")].
Inserted 3 fact(s) into 'messages'.
> ?- messages(Id, Msg).
3 rows:
  (1, "He said \"hello\"")
  (2, "It's fine")
  (3, "A 'quote' here")
> +simple[(1, "no quotes here"), (2, "plain text")].
Inserted 2 fact(s) into 'simple'.
> ?- simple(Id, Text).
2 rows:
  (1, "no quotes here")
  (2, "plain text")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_quotes
Knowledge graph 'test_str_quotes' dropped.
