Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_list_n17t01
Knowledge graph 'test_rule_list_n17t01' created.
Switched to knowledge graph: test_rule_list_n17t01
> .kg use test_rule_list_n17t01
Switched to knowledge graph: test_rule_list_n17t01
> +edge[(1,2), (2,3)]
Inserted 2 fact(s) into 'edge'.
> +reverse(X, Y) <- edge(Y, X)
Rule 'reverse' registered.
> +paths(X, Y) <- edge(X, Y)
Rule 'paths' registered.
> +paths(X, Z) <- paths(X, Y), edge(Y, Z)
Rule 'paths' registered.
> .rule
Rules:
  paths (2 clause(s))
  reverse (1 clause(s))
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_list_n17t01
Knowledge graph 'test_rule_list_n17t01' dropped.
