Executing script: examples/datalog/17_rule_commands/01_rule_list.dl

> .db create test_rule_list
Database 'test_rule_list' created.
Switched to database: test_rule_list
> .db use test_rule_list
Switched to database: test_rule_list
> +edge[(1,2), (2,3)].
Inserted 2 facts into 'edge'.
> +reverse(X, Y) :- edge(Y, X).
Rule 'reverse' registered.
> +paths(X, Y) :- edge(X, Y).
Rule 'paths' registered.
> +paths(X, Z) :- paths(X, Y), edge(Y, Z).
Rule added to 'paths' (2 rules total).
> .rule
Rules:
  paths
  reverse
> .db use default
Switched to database: default
> .db drop test_rule_list
Database 'test_rule_list' dropped.
