Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_desc_n17t02
Knowledge graph 'test_rule_desc_n17t02' created.
Switched to knowledge graph: test_rule_desc_n17t02
> .kg use test_rule_desc_n17t02
Switched to knowledge graph: test_rule_desc_n17t02
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> +reach(X, Y) <- edge(X, Y)
Rule 'reach' registered.
> +reach(X, Z) <- reach(X, Y), edge(Y, Z)
Rule 'reach' registered.
> .rule reach
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 4 │
└───┴───┘
6 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_desc_n17t02
Knowledge graph 'test_rule_desc_n17t02' dropped.
