Executing script: examples/datalog/17_rule_commands/03_rule_drop.dl

> .db create test_rule_drop
Database 'test_rule_drop' created.
Switched to database: test_rule_drop
> .db use test_rule_drop
Switched to database: test_rule_drop
> +edge[(1,2), (2,3)].
Inserted 2 facts into 'edge'.
> +reverse(X, Y) :- edge(Y, X).
Rule 'reverse' registered.
> +paths(X, Y) :- edge(X, Y).
Rule 'paths' registered.
> .rule
Rules:
  paths
  reverse
> .rule drop reverse
Rule 'reverse' dropped.
> .rule
Rules:
  paths
> .db use default
Switched to database: default
> .db drop test_rule_drop
Database 'test_rule_drop' dropped.
