Executing script: examples/datalog/17_rule_commands/04_rule_def.dl

> .db create test_rule_def
Database 'test_rule_def' created.
Switched to database: test_rule_def
> .db use test_rule_def
Switched to database: test_rule_def
> +edge[(1,2), (2,3)].
Inserted 2 facts into 'edge'.
> +reach(X, Y) :- edge(X, Y).
Rule 'reach' registered.
> +reach(X, Z) :- reach(X, Y), edge(Y, Z).
Rule added to 'reach' (2 rules total).
> .rule def reach
Rule: reach
Clauses:
  1. reach(X, Y) :- edge(X, Y).
  2. reach(X, Z) :- reach(X, Y), edge(Y, Z).

> .db use default
Switched to database: default
> .db drop test_rule_def
Database 'test_rule_def' dropped.
