Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_clause_n17t05
Knowledge graph 'test_multi_clause_n17t05' created.
Switched to knowledge graph: test_multi_clause_n17t05
> .kg use test_multi_clause_n17t05
Switched to knowledge graph: test_multi_clause_n17t05
> +edge[(1,2), (2,3), (3,4), (4,5)]
Inserted 4 fact(s) into 'edge'.
> +reachable(X, Y) <- edge(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- reachable(X, Y), edge(Y, Z)
Rule 'reachable' registered.
> .rule list
Rules:
  reachable (2 clause(s))
> .rule def reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) <- edge(X, Y)
  2. reachable(X, Z) <- reachable(X, Y), edge(Y, Z)

> .rule reachable
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
│    1 │    5 │
│    2 │    3 │
│    2 │    4 │
│    2 │    5 │
│    3 │    4 │
│    3 │    5 │
│    4 │    5 │
└──────┴──────┘
10 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_clause_n17t05
Knowledge graph 'test_multi_clause_n17t05' dropped.
