Executing script: examples/datalog/17_rule_commands/05_multi_clause_rules.dl

> .db create test_multi_clause
Database 'test_multi_clause' created.
Switched to database: test_multi_clause
> .db use test_multi_clause
Switched to database: test_multi_clause
> +edge[(1,2), (2,3), (3,4), (4,5)].
Inserted 4 facts into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule added to 'reachable' (2 rules total).
> .rule list
Rules:
  reachable
> .rule def reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) :- edge(X, Y).
  2. reachable(X, Z) :- reachable(X, Y), edge(Y, Z).

> .rule reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) :- edge(X, Y).
  2. reachable(X, Z) :- reachable(X, Y), edge(Y, Z).

Results: 10 rows
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 4)
  (3, 5)
  (4, 5)
> .db use default
Switched to database: default
> .db drop test_multi_clause
Database 'test_multi_clause' dropped.
