Executing script: examples/datalog/17_rule_commands/06_drop_multi_clause.dl

> .db create test_drop_multi
Database 'test_drop_multi' created.
Switched to database: test_drop_multi
> .db use test_drop_multi
Switched to database: test_drop_multi
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 facts into 'edge'.
> +simple(X, Y) :- edge(Y, X).
Rule 'simple' registered.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule added to 'reachable' (2 rules total).
> .rule list
Rules:
  reachable
  simple
> ?- reachable(1, Y).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> .rule drop reachable
Rule 'reachable' dropped.
> .rule list
Rules:
  simple
> ?- reachable(1, Y).
No results.
> .db use default
Switched to database: default
> .db drop test_drop_multi
Database 'test_drop_multi' dropped.
