Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rule_clear_n17t07
Knowledge graph 'test_rule_clear_n17t07' created.
Switched to knowledge graph: test_rule_clear_n17t07
> .kg use test_rule_clear_n17t07
Switched to knowledge graph: test_rule_clear_n17t07
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) <- edge(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- reachable(X, Y), edge(Y, Z)
Rule 'reachable' registered.
> .rule def reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) <- edge(X, Y)
  2. reachable(X, Z) <- reachable(X, Y), edge(Y, Z)

> .rule clear reachable
Rule 'reachable' cleared.
> .rule list
Rules:
  reachable (0 clause(s))
> +reachable(X, Y) <- edge(X, Y)
Rule 'reachable' registered.
> .rule def reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) <- edge(X, Y)

> ?reachable(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_clear_n17t07
Knowledge graph 'test_rule_clear_n17t07' dropped.
