Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rule_clear
Knowledge graph 'test_rule_clear' created.
Switched to knowledge graph: test_rule_clear
> .kg use test_rule_clear
Switched to knowledge graph: test_rule_clear
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> .rule def reachable
This command is not yet implemented over HTTP.
> .rule clear reachable
This command is not yet implemented over HTTP.
> .rule list
Rules:
  reachable (2 clause(s))
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> .rule def reachable
This command is not yet implemented over HTTP.
> ?- reachable(X, Y).
6 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 3)
  (2, 4)
  (3, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_clear
Knowledge graph 'test_rule_clear' dropped.
