Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rule_clear_n17t07
Knowledge graph 'test_rule_clear_n17t07' created.
Switched to knowledge graph: test_rule_clear_n17t07
> .kg use test_rule_clear_n17t07
Switched to knowledge graph: test_rule_clear_n17t07
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> .rule def reachable
This command is available in embedded mode. HTTP support is planned for a future release.
> .rule clear reachable
This command is available in embedded mode. HTTP support is planned for a future release.
> .rule list
Rules:
  reachable (2 clause(s))
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> .rule def reachable
This command is available in embedded mode. HTTP support is planned for a future release.
> ?- reachable(X, Y).
6 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 3)
  (2, 4)
  (3, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_clear_n17t07
Knowledge graph 'test_rule_clear_n17t07' dropped.
