Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_edit_n17t08
Knowledge graph 'test_rule_edit_n17t08' created.
Switched to knowledge graph: test_rule_edit_n17t08
> .kg use test_rule_edit_n17t08
Switched to knowledge graph: test_rule_edit_n17t08
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) <- edge(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- reachable(X, Y), edge(Y, Z)
Rule 'reachable' registered.
> .rule def reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) <- edge(X, Y)
  2. reachable(X, Z) <- reachable(X, Y), edge(Y, Z)

> .rule edit reachable 2 +reachable(X, Z) <- edge(X, Y), reachable(Y, Z).
Rule editing is not supported in server mode.
> .rule def reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) <- edge(X, Y)
  2. reachable(X, Z) <- reachable(X, Y), edge(Y, Z)

> ?reachable(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 4 │
└───┴───┘
6 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_edit_n17t08
Knowledge graph 'test_rule_edit_n17t08' dropped.
