Executing script: examples/datalog/17_rule_commands/08_rule_edit.dl

> .db create test_rule_edit
Database 'test_rule_edit' created.
Switched to database: test_rule_edit
> .db use test_rule_edit
Switched to database: test_rule_edit
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 facts into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule added to 'reachable' (2 rules total).
> .rule def reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) :- edge(X, Y).
  2. reachable(X, Z) :- reachable(X, Y), edge(Y, Z).

> .rule edit reachable 2 +reachable(X, Z) :- edge(X, Y), reachable(Y, Z).
Rule 2 of 'reachable' replaced.

Updated rule:
Rule: reachable
Clauses:
  1. reachable(X, Y) :- edge(X, Y).
  2. reachable(X, Z) :- edge(X, Y), reachable(Y, Z).

> .rule def reachable
Rule: reachable
Clauses:
  1. reachable(X, Y) :- edge(X, Y).
  2. reachable(X, Z) :- edge(X, Y), reachable(Y, Z).

> ?- reachable(X, Y).
6 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 3)
  (2, 4)
  (3, 4)
> .db use default
Switched to database: default
> .db drop test_rule_edit
Database 'test_rule_edit' dropped.
