Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rule_edit_n17t08
Knowledge graph 'test_rule_edit_n17t08' created.
Switched to knowledge graph: test_rule_edit_n17t08
> .kg use test_rule_edit_n17t08
Switched to knowledge graph: test_rule_edit_n17t08
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) <- edge(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- reachable(X, Y), edge(Y, Z)
Rule 'reachable' registered.
> .rule def reachable
This command is available in embedded mode. HTTP support is planned for a future release.
> .rule edit reachable 2 +reachable(X, Z) <- edge(X, Y), reachable(Y, Z).
This command is available in embedded mode. HTTP support is planned for a future release.
> .rule def reachable
This command is available in embedded mode. HTTP support is planned for a future release.
> ?reachable(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
│    2 │    3 │
│    2 │    4 │
│    3 │    4 │
└──────┴──────┘
6 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_edit_n17t08
Knowledge graph 'test_rule_edit_n17t08' dropped.
