Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_minus_clause_n17t09
Knowledge graph 'test_minus_clause_n17t09' created.
Switched to knowledge graph: test_minus_clause_n17t09
> .kg use test_minus_clause_n17t09
Switched to knowledge graph: test_minus_clause_n17t09
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> .rule list
Rules:
  reachable (2 clause(s))
> .rule def reachable
This command is available in embedded mode. HTTP support is planned for a future release.
> ?- reachable(1, Y).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> -reachable(X, Y) :- edge(X, Y).
Conditional delete: 0 fact(s) deleted from 'reachable'.
> .rule def reachable
This command is available in embedded mode. HTTP support is planned for a future release.
> ?- reachable(1, Y).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_minus_clause_n17t09
Knowledge graph 'test_minus_clause_n17t09' dropped.
