Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_drop_noexist_n17t10
Knowledge graph 'test_drop_noexist_n17t10' created.
Switched to knowledge graph: test_drop_noexist_n17t10
> .kg use test_drop_noexist_n17t10
Switched to knowledge graph: test_drop_noexist_n17t10
> .rule list
No rules defined.
> .rule drop nonexistent_rule
Rule 'nonexistent_rule' not found: Failed to drop rule: Rule 'nonexistent_rule' does not exist
> .rule list
No rules defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_noexist_n17t10
Knowledge graph 'test_drop_noexist_n17t10' dropped.
