Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_noexist_n17t10
Knowledge graph 'test_drop_noexist_n17t10' created.
Switched to knowledge graph: test_drop_noexist_n17t10
> .kg use test_drop_noexist_n17t10
Switched to knowledge graph: test_drop_noexist_n17t10
> .rule list
No rules defined.
> .rule drop nonexistent_rule
Script error: Rule 'nonexistent_rule' not found
