Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_all_n17t11
Knowledge graph 'test_drop_all_n17t11' created.
Switched to knowledge graph: test_drop_all_n17t11
> .kg use test_drop_all_n17t11
Switched to knowledge graph: test_drop_all_n17t11
> +edge[(1,2), (2,3), (3,4), (4,5)].
Inserted 4 fact(s) into 'edge'.
> +path(X, Y) :- edge(X, Y).
Rule 'path' registered.
> +path(X, Z) :- path(X, Y), edge(Y, Z).
Rule 'path' registered.
> +path(X, X) :- edge(X, _).
Rule 'path' registered.
> .rule list
Rules:
  path (3 clause(s))
> ?- path(1, Y).
5 rows:
  (1, 1)
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
> .rule drop path
Rule 'path' dropped.
> .rule list
No rules defined.
> ?- path(1, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_all_n17t11
Knowledge graph 'test_drop_all_n17t11' dropped.
