Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rule_remove_12
Knowledge graph 'test_rule_remove_12' created.
Switched to knowledge graph: test_rule_remove_12
> .kg use test_rule_remove_12
Switched to knowledge graph: test_rule_remove_12
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> .rule list
Rules:
  reachable (2 clause(s))
> ?- reachable(X, Y).
6 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 3)
  (2, 4)
  (3, 4)
> .rule remove reachable 1
Clause 1 removed from rule 'reachable'.
> .rule list
Rules:
  reachable (1 clause(s))
> ?- reachable(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_remove_12
Knowledge graph 'test_rule_remove_12' dropped.
