Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_remove_err_n17t14
Knowledge graph 'test_rule_remove_err_n17t14' created.
Switched to knowledge graph: test_rule_remove_err_n17t14
> .kg use test_rule_remove_err_n17t14
Switched to knowledge graph: test_rule_remove_err_n17t14
> +edge[(1,2)]
Inserted 1 fact(s) into 'edge'.
> +simple(X, Y) <- edge(X, Y)
Rule 'simple' registered.
> .rule list
Rules:
  simple (1 clause(s))
> .rule remove simple 5
Error: Failed to remove rule clause: Clause index 5 out of bounds. Rule 'simple' has 1 clause(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_remove_err_n17t14
Knowledge graph 'test_rule_remove_err_n17t14' dropped.
