Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_readd_n17t16
Knowledge graph 'test_drop_readd_n17t16' created.
Switched to knowledge graph: test_drop_readd_n17t16
> .kg use test_drop_readd_n17t16
Switched to knowledge graph: test_drop_readd_n17t16
> +data[(1, 10), (2, 20), (3, 30)].
Inserted 3 fact(s) into 'data'.
> +computed(Id, Val) :- data(Id, V), Val = V * 2.
Rule 'computed' registered.
> ?- computed(Id, Val).
3 rows:
  (1, 20)
  (2, 40)
  (3, 60)
> .rule drop computed
Rule 'computed' dropped.
> .rule
No rules defined.
> +computed(Id, Val) :- data(Id, V), Val = V + 100.
Rule 'computed' registered.
> ?- computed(Id, Val).
3 rows:
  (1, 110)
  (2, 120)
  (3, 130)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_readd_n17t16
Knowledge graph 'test_drop_readd_n17t16' dropped.
