Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_remove_order_n17t17
Knowledge graph 'test_remove_order_n17t17' created.
Switched to knowledge graph: test_remove_order_n17t17
> .kg use test_remove_order_n17t17
Switched to knowledge graph: test_remove_order_n17t17
> +src[(1,), (10,), (100,)]
Inserted 3 fact(s) into 'src'.
> +multi(X, "small") <- src(X), X < 5
Rule 'multi' registered.
> +multi(X, "medium") <- src(X), X >= 5, X < 50
Rule 'multi' registered.
> +multi(X, "large") <- src(X), X >= 50
Rule 'multi' registered.
> ?multi(X, Size)
┌──────┬──────────┐
│ col0 │ col1     │
├──────┼──────────┤
│    1 │ "small"  │
│   10 │ "medium" │
│  100 │ "large"  │
└──────┴──────────┘
3 rows
> .rule def multi
This command is available in embedded mode. HTTP support is planned for a future release.
> .rule remove multi 2
Clause 2 removed from rule 'multi'.
> .rule def multi
This command is available in embedded mode. HTTP support is planned for a future release.
> ?multi(X, Size)
┌──────┬─────────┐
│ col0 │ col1    │
├──────┼─────────┤
│    1 │ "small" │
│  100 │ "large" │
└──────┴─────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_remove_order_n17t17
Knowledge graph 'test_remove_order_n17t17' dropped.
