Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_remove_order
Knowledge graph 'test_remove_order' created.
Switched to knowledge graph: test_remove_order
> .kg use test_remove_order
Switched to knowledge graph: test_remove_order
> +src[(1,), (10,), (100,)].
Inserted 3 fact(s) into 'src'.
> +multi(X, "small") :- src(X), X < 5.
Rule 'multi' registered.
> +multi(X, "medium") :- src(X), X >= 5, X < 50.
Rule 'multi' registered.
> +multi(X, "large") :- src(X), X >= 50.
Rule 'multi' registered.
> ?- multi(X, Size).
3 rows:
  (1, "small")
  (10, "medium")
  (100, "large")
> .rule def multi
This command is not yet implemented over HTTP.
> .rule remove multi 2
Clause 2 removed from rule 'multi'.
> .rule def multi
This command is not yet implemented over HTTP.
> ?- multi(X, Size).
2 rows:
  (1, "small")
  (100, "large")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_remove_order
Knowledge graph 'test_remove_order' dropped.
