Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_remove_order
Knowledge graph 'test_remove_order' created.
Switched to knowledge graph: test_remove_order
> .kg use test_remove_order
Switched to knowledge graph: test_remove_order
> +nums[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'nums'.
> +output(X, 10) :- nums(X), X = 1.
Rule 'output' registered.
> +output(X, 20) :- nums(X), X = 2.
Rule 'output' registered.
> +output(X, 30) :- nums(X), X = 3.
Rule 'output' registered.
> ?- output(X, Y).
3 rows:
  (1, 10)
  (2, 20)
  (3, 30)
> .rule def output
This command is not yet implemented over HTTP.
> .rule remove output 2
Clause 2 removed from rule 'output'.
> .rule def output
This command is not yet implemented over HTTP.
> ?- output(X, Y).
2 rows:
  (1, 10)
  (3, 30)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_remove_order
Knowledge graph 'test_remove_order' dropped.
