Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_name_conflict_n17t18
Knowledge graph 'test_name_conflict_n17t18' created.
Switched to knowledge graph: test_name_conflict_n17t18
> .kg use test_name_conflict_n17t18
Switched to knowledge graph: test_name_conflict_n17t18
> +items[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'items'.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │  10 │
│  2 │  20 │
│  3 │  30 │
└────┴─────┘
3 rows
> +items(Id, Val) <- items(Id, Val), Val > 15
Rule 'items' registered.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  2 │  20 │
│  3 │  30 │
└────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_name_conflict_n17t18
Knowledge graph 'test_name_conflict_n17t18' dropped.
