Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_clear_add_n17t20
Knowledge graph 'test_clear_add_n17t20' created.
Switched to knowledge graph: test_clear_add_n17t20
> .kg use test_clear_add_n17t20
Switched to knowledge graph: test_clear_add_n17t20
> +base[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'base'.
> +compute(X, Y) :- base(X), Y = X + 10.
Rule 'compute' registered.
> ?- compute(X, Y).
3 rows:
  (1, 11)
  (2, 12)
  (3, 13)
> .rule clear compute
This command is available in embedded mode. HTTP support is planned for a future release.
> .rule
Rules:
  compute (1 clause(s))
> +compute(X, Y) :- base(X), Y = X * 100.
Rule 'compute' registered.
> ?- compute(X, Y).
6 rows:
  (1, 11)
  (1, 100)
  (2, 12)
  (2, 200)
  (3, 13)
  (3, 300)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_clear_add_n17t20
Knowledge graph 'test_clear_add_n17t20' dropped.
