Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_add_n17t27
Knowledge graph 'test_drop_add_n17t27' created.
Switched to knowledge graph: test_drop_add_n17t27
> .kg use test_drop_add_n17t27
Switched to knowledge graph: test_drop_add_n17t27
> +items[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'items'.
> +doubled(X, Y) <- items(X), Y = X * 2
Rule 'doubled' registered.
> ?doubled(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 4 │
│ 3 │ 6 │
└───┴───┘
3 rows
> .rule drop doubled
Rule 'doubled' dropped.
> .rule
No rules defined.
> +doubled(X, Y) <- items(X), Y = X * 3
Rule 'doubled' registered.
> ?doubled(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 3 │
│ 2 │ 6 │
│ 3 │ 9 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_add_n17t27
Knowledge graph 'test_drop_add_n17t27' dropped.
