Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_query_n17t28
Knowledge graph 'test_rule_query_n17t28' created.
Switched to knowledge graph: test_rule_query_n17t28
> .kg use test_rule_query_n17t28
Switched to knowledge graph: test_rule_query_n17t28
> +edges[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edges'.
> +reachable(X, Y) <- edges(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- reachable(X, Y), edges(Y, Z)
Rule 'reachable' registered.
> ?reachable(1, Y)
┌───┬───┐
│ 1 │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
└───┴───┘
3 rows
> .rule list
Rules:
  reachable (2 clause(s))
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_query_n17t28
Knowledge graph 'test_rule_query_n17t28' dropped.
