Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_rel_name_n17t30
Knowledge graph 'test_rule_rel_name_n17t30' created.
Switched to knowledge graph: test_rule_rel_name_n17t30
> .kg use test_rule_rel_name_n17t30
Switched to knowledge graph: test_rule_rel_name_n17t30
> +data[(1, 10), (2, 20)]
Inserted 2 fact(s) into 'data'.
> +computed(X, Y) <- data(X, Z), Y = Z * 2
Rule 'computed' registered.
> ?computed(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 20 │
│ 2 │ 40 │
└───┴────┘
2 rows
> ?data(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 10 │
│ 2 │ 20 │
└───┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_rel_name_n17t30
Knowledge graph 'test_rule_rel_name_n17t30' dropped.
