Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_drop_prefix_all_n17t32
Knowledge graph 'test_rule_drop_prefix_all_n17t32' created.
Switched to knowledge graph: test_rule_drop_prefix_all_n17t32
> .kg use test_rule_drop_prefix_all_n17t32
Switched to knowledge graph: test_rule_drop_prefix_all_n17t32
> +edge[(1, 2)]
Inserted 1 fact(s) into 'edge'.
> +test_a(X) <- edge(X, _Y)
Rule 'test_a' registered.
> +test_b(X, Y) <- edge(X, Y)
Rule 'test_b' registered.
> .rule list
Rules:
  test_a (1 clause(s))
  test_b (1 clause(s))
> .rule drop prefix test_
Dropped 2 rule(s) with prefix 'test_': test_a, test_b
> .rule list
No rules defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_drop_prefix_all_n17t32
Knowledge graph 'test_rule_drop_prefix_all_n17t32' dropped.
