Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_contains
Knowledge graph 'test_contains' created.
Switched to knowledge graph: test_contains
> .kg use test_contains
Switched to knowledge graph: test_contains
> +words[("hello world",), ("goodbye",), ("hello there",)].
Inserted 3 fact(s) into 'words'.
> has_hello(S) :- words(S), CONTAINS(S, "hello").
No results.
(session: 1 rule(s))
> ?- has_hello(S).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_contains
Knowledge graph 'test_contains' dropped.
