Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_agg_count_n14t01
Knowledge graph 'test_agg_count_n14t01' created.
Switched to knowledge graph: test_agg_count_n14t01
> .kg use test_agg_count_n14t01
Switched to knowledge graph: test_agg_count_n14t01
> +sales[(1, 100), (1, 200), (1, 150), (2, 300), (2, 250), (3, 500)]
Inserted 6 fact(s) into 'sales'.
> +sales_count(Region, count<Amount>) <- sales(Region, Amount)
Rule 'sales_count' registered.
> ?sales_count(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 3 │
│ 2 │ 2 │
│ 3 │ 1 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_count_n14t01
Knowledge graph 'test_agg_count_n14t01' dropped.
