
> .db create test_agg_count
Database 'test_agg_count' created.
Switched to database: test_agg_count
> .db use test_agg_count
Switched to database: test_agg_count
> +sales[(1, 100), (1, 200), (1, 150), (2, 300), (2, 250), (3, 500)].
Inserted 6 facts into 'sales'.
> sales_count(Region, count<Amount>) := sales(Region, Amount).
View 'sales_count' registered.
> ?- sales_count(X, Y).
3 rows:
  (1, 3)
  (2, 2)
  (3, 1)
> .db use default
Switched to database: default
> .db drop test_agg_count
Database 'test_agg_count' dropped.
