Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_agg_count
Knowledge graph 'test_agg_count' created.
Switched to knowledge graph: test_agg_count
> .kg use test_agg_count
Switched to knowledge graph: test_agg_count
> +sales[(1, 100), (1, 200), (1, 150), (2, 300), (2, 250), (3, 500)].
Inserted 6 fact(s) into 'sales'.
> +sales_count(Region, count<Amount>) :- sales(Region, Amount).
Rule 'sales_count' registered.
> ?- sales_count(X, Y).
3 rows:
  (1, 3)
  (2, 2)
  (3, 1)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_count
Knowledge graph 'test_agg_count' dropped.
