
> .db create test_agg_sum
Database 'test_agg_sum' created.
Switched to database: test_agg_sum
> .db use test_agg_sum
Switched to database: test_agg_sum
> +sales[(1, 100), (1, 200), (1, 150), (2, 300), (2, 250), (3, 500)].
Inserted 6 facts into 'sales'.
> region_total(Region, sum<Amount>) := sales(Region, Amount).
View 'region_total' registered.
> ?- region_total(X, Y).
3 rows:
  (1, 450)
  (2, 550)
  (3, 500)
> .db use default
Switched to database: default
> .db drop test_agg_sum
Database 'test_agg_sum' dropped.
