Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_agg_min_n14t03
Knowledge graph 'test_agg_min_n14t03' created.
Switched to knowledge graph: test_agg_min_n14t03
> .kg use test_agg_min_n14t03
Switched to knowledge graph: test_agg_min_n14t03
> +reading[(1, 25), (1, 22), (1, 28), (2, 30), (2, 35), (3, 18)]
Inserted 6 fact(s) into 'reading'.
> +min_temp(Sensor, min<Temp>) <- reading(Sensor, Temp)
Rule 'min_temp' registered.
> ?min_temp(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │   22 │
│    2 │   30 │
│    3 │   18 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_min_n14t03
Knowledge graph 'test_agg_min_n14t03' dropped.
