Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_agg_avg_n14t05
Knowledge graph 'test_agg_avg_n14t05' created.
Switched to knowledge graph: test_agg_avg_n14t05
> .kg use test_agg_avg_n14t05
Switched to knowledge graph: test_agg_avg_n14t05
> +score[(1, 80), (1, 90), (1, 85), (2, 70), (2, 75), (3, 100)]
Inserted 6 fact(s) into 'score'.
> +avg_score(Student, avg<Points>) <- score(Student, Points)
Rule 'avg_score' registered.
> ?avg_score(X, Y)
┌───┬───────┐
│ X │ Y     │
├───┼───────┤
│ 1 │  85.0 │
│ 2 │  72.5 │
│ 3 │ 100.0 │
└───┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_avg_n14t05
Knowledge graph 'test_agg_avg_n14t05' dropped.
