Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_agg_avg
Knowledge graph 'test_agg_avg' created.
Switched to knowledge graph: test_agg_avg
> .kg use test_agg_avg
Switched to knowledge graph: test_agg_avg
> +score[(1, 80), (1, 90), (1, 85), (2, 70), (2, 75), (3, 100)].
Inserted 6 fact(s) into 'score'.
> +avg_score(Student, avg<Points>) :- score(Student, Points).
Rule 'avg_score' registered.
> ?- avg_score(X, Y).
3 rows:
  (1, 85.0)
  (2, 72.5)
  (3, 100.0)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_avg
Knowledge graph 'test_agg_avg' dropped.
