
> .db create test_agg_avg
Database 'test_agg_avg' created.
Switched to database: test_agg_avg
> .db use test_agg_avg
Switched to database: test_agg_avg
> +score[(1, 80), (1, 90), (1, 85), (2, 70), (2, 75), (3, 100)].
Inserted 6 facts into 'score'.
> avg_score(Student, avg<Points>) := score(Student, Points).
View 'avg_score' registered.
> ?- avg_score(X, Y).
3 rows:
  (1, 85)
  (2, 72.5)
  (3, 100)
> .db use default
Switched to database: default
> .db drop test_agg_avg
Database 'test_agg_avg' dropped.
