Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_top_k_n14t07
Knowledge graph 'test_top_k_n14t07' created.
Switched to knowledge graph: test_top_k_n14t07
> .kg use test_top_k_n14t07
Switched to knowledge graph: test_top_k_n14t07
> +score[(1, 100), (2, 250), (3, 175), (4, 300), (5, 125), (6, 200)]
Inserted 6 fact(s) into 'score'.
> +top_players(top_k<3, Player, Points:desc>) <- score(Player, Points)
Rule 'top_players' registered.
> ?top_players(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 2 │ 250 │
│ 4 │ 300 │
│ 6 │ 200 │
└───┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_top_k_n14t07
Knowledge graph 'test_top_k_n14t07' dropped.
