Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_global_count
Knowledge graph 'test_global_count' created.
Switched to knowledge graph: test_global_count
> .kg use test_global_count
Switched to knowledge graph: test_global_count
> +event[(1, 10), (2, 10), (3, 20), (4, 10), (5, 20)].
Inserted 5 fact(s) into 'event'.
> +total_events(count<Id>) :- event(Id, _).
Rule 'total_events' registered.
> ?- total_events(X).
1 rows:
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_global_count
Knowledge graph 'test_global_count' dropped.
