Executing script: examples/datalog/14_aggregations/09_agg_over_recursive.dl

> .db create test_agg_recursive
Database 'test_agg_recursive' created.
Switched to database: test_agg_recursive
> .db use test_agg_recursive
Switched to database: test_agg_recursive
> +edge[(1, 2), (2, 3), (3, 4), (1, 5), (5, 6)].
Inserted 5 facts into 'edge'.
> path(X, Y) := edge(X, Y).
View 'path' registered.
> path(X, Z) := edge(X, Y), path(Y, Z).
Rule added to view 'path' (2 rules total).
> ?- path(A, B).
9 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (1, 6)
  (2, 3)
  (2, 4)
  (3, 4)
  (5, 6)
> reach_count(X, count<Y>) := path(X, Y).
View 'reach_count' registered.
> ?- reach_count(X, C).
4 rows:
  (1, 5)
  (2, 2)
  (3, 1)
  (5, 1)
> reach_sum(X, sum<Y>) := path(X, Y).
View 'reach_sum' registered.
> ?- reach_sum(X, S).
4 rows:
  (1, 20)
  (2, 7)
  (3, 4)
  (5, 6)
> .db use default
Switched to database: default
> .db drop test_agg_recursive
Database 'test_agg_recursive' dropped.
