Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_agg_recursive_n14t09
Knowledge graph 'test_agg_recursive_n14t09' created.
Switched to knowledge graph: test_agg_recursive_n14t09
> .kg use test_agg_recursive_n14t09
Switched to knowledge graph: test_agg_recursive_n14t09
> +edge[(1, 2), (2, 3), (3, 4), (1, 5), (5, 6)]
Inserted 5 fact(s) into 'edge'.
> +path(X, Y) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- edge(X, Y), path(Y, Z)
Rule 'path' registered.
> ?path(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
│ 1 │ 6 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 4 │
│ 5 │ 6 │
└───┴───┘
9 rows
> +reach_count(X, count<Y>) <- path(X, Y)
Rule 'reach_count' registered.
> ?reach_count(X, C)
┌───┬───┐
│ X │ C │
├───┼───┤
│ 1 │ 5 │
│ 2 │ 2 │
│ 3 │ 1 │
│ 5 │ 1 │
└───┴───┘
4 rows
> +reach_sum(X, sum<Y>) <- path(X, Y)
Rule 'reach_sum' registered.
> ?reach_sum(X, S)
┌───┬────┐
│ X │ S  │
├───┼────┤
│ 1 │ 20 │
│ 2 │  7 │
│ 3 │  4 │
│ 5 │  6 │
└───┴────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_recursive_n14t09
Knowledge graph 'test_agg_recursive_n14t09' dropped.
