Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_nested_agg
Knowledge graph 'test_nested_agg' created.
Switched to knowledge graph: test_nested_agg
> .kg use test_nested_agg
Switched to knowledge graph: test_nested_agg
> +scores[(1, 101, 85), (1, 102, 90), (1, 103, 95), (2, 101, 70), (2, 102, 75), (2, 103, 80), (3, 101, 90), (3, 102, 85), (3, 103, 88), (4, 101, 60), (4, 102, 65), (4, 103, 70)].
Inserted 12 fact(s) into 'scores'.
> +student_total(Student, sum<Score>) :- scores(Student, _, Score).
Rule 'student_total' registered.
> ?- student_total(S, Total).
4 rows:
  (1, 270)
  (2, 225)
  (3, 263)
  (4, 195)
> +best_total(max<Total>) :- student_total(_, Total).
Rule 'best_total' registered.
> ?- best_total(T).
1 rows:
  (270)
> +course_avg(Course, avg<Score>) :- scores(_, Course, Score).
Rule 'course_avg' registered.
> ?- course_avg(C, A).
3 rows:
  (101, 76.25)
  (102, 78.75)
  (103, 83.25)
> +top_course_avg(max<Avg>) :- course_avg(_, Avg).
Rule 'top_course_avg' registered.
> ?- top_course_avg(A).
1 rows:
  (83.25)
> +high_scorer(Student) :- student_total(Student, Total), Total > 250.
Rule 'high_scorer' registered.
> +high_count(count<S>) :- high_scorer(S).
Rule 'high_count' registered.
> ?- high_count(C).
1 rows:
  (2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_nested_agg
Knowledge graph 'test_nested_agg' dropped.
