Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_radius_n14t116
Knowledge graph 'test_drop_radius_n14t116' created.
Switched to knowledge graph: test_drop_radius_n14t116
> .kg use test_drop_radius_n14t116
Switched to knowledge graph: test_drop_radius_n14t116
> +dist[(1, 0.1), (2, 0.5), (3, 1.2), (4, 0.3), (5, 2.0), (6, 0.45)]
Inserted 6 fact(s) into 'dist'.
> +nearby(within_radius<0.5, Id, D:asc>) <- dist(Id, D)
Rule 'nearby' registered.
> ?nearby(X, Y)
┌───┬──────┐
│ X │ Y    │
├───┼──────┤
│ 1 │  0.1 │
│ 2 │  0.5 │
│ 4 │  0.3 │
│ 6 │ 0.45 │
└───┴──────┘
4 rows
> .rule drop nearby
Rule 'nearby' dropped.
> ?nearby(X, Y)
No results.
> +nearby(within_radius<1.5, Id, D:asc>) <- dist(Id, D)
Rule 'nearby' registered.
> ?nearby(X, Y)
┌───┬──────┐
│ X │ Y    │
├───┼──────┤
│ 1 │  0.1 │
│ 2 │  0.5 │
│ 3 │  1.2 │
│ 4 │  0.3 │
│ 6 │ 0.45 │
└───┴──────┘
5 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_radius_n14t116
Knowledge graph 'test_drop_radius_n14t116' dropped.
