Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_retract_radius_n14t117
Knowledge graph 'test_retract_radius_n14t117' created.
Switched to knowledge graph: test_retract_radius_n14t117
> .kg use test_retract_radius_n14t117
Switched to knowledge graph: test_retract_radius_n14t117
> +dist[(1, 0.1), (2, 0.5), (3, 1.2), (4, 0.3), (5, 2.0), (6, 0.45)]
Inserted 6 fact(s) into 'dist'.
> +nearby(within_radius<0.5, Id, D:asc>) <- dist(Id, D)
Rule 'nearby' registered.
> ?nearby(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │  0.1 │
│    2 │  0.5 │
│    4 │  0.3 │
│    6 │ 0.45 │
└──────┴──────┘
4 rows
> -dist(1, 0.1)
Deleted 1 facts from 'dist'.
> ?nearby(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    2 │  0.5 │
│    4 │  0.3 │
│    6 │ 0.45 │
└──────┴──────┘
3 rows
> +dist[(7, 0.2)]
Inserted 1 fact(s) into 'dist'.
> ?nearby(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    2 │  0.5 │
│    4 │  0.3 │
│    6 │ 0.45 │
│    7 │  0.2 │
└──────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_retract_radius_n14t117
Knowledge graph 'test_retract_radius_n14t117' dropped.
