Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_retract_count_n14t121
Knowledge graph 'test_retract_count_n14t121' created.
Switched to knowledge graph: test_retract_count_n14t121
> .kg use test_retract_count_n14t121
Switched to knowledge graph: test_retract_count_n14t121
> +sales[(1, 100), (1, 200), (1, 150), (2, 300), (2, 250)]
Inserted 5 fact(s) into 'sales'.
> +sales_count(Region, count<Amount>) <- sales(Region, Amount)
Rule 'sales_count' registered.
> ?sales_count(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 3 │
│ 2 │ 2 │
└───┴───┘
2 rows
> -sales(1, 100)
Deleted 1 facts from 'sales'.
> ?sales_count(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 2 │
└───┴───┘
2 rows
> -sales(2, 300)
Deleted 1 facts from 'sales'.
> -sales(2, 250)
Deleted 1 facts from 'sales'.
> ?sales_count(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
└───┴───┘
1 rows
> +sales[(2, 500)]
Inserted 1 fact(s) into 'sales'.
> ?sales_count(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 1 │
└───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_retract_count_n14t121
Knowledge graph 'test_retract_count_n14t121' dropped.
