Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_sum_n14t122
Knowledge graph 'test_drop_sum_n14t122' created.
Switched to knowledge graph: test_drop_sum_n14t122
> .kg use test_drop_sum_n14t122
Switched to knowledge graph: test_drop_sum_n14t122
> +sales[(1, 100), (1, 200), (2, 300), (2, 250)].
Inserted 4 fact(s) into 'sales'.
> +region_total(Region, sum<Amount>) :- sales(Region, Amount).
Rule 'region_total' registered.
> ?- region_total(X, Y).
2 rows:
  (1, 300)
  (2, 550)
> .rule drop region_total
Rule 'region_total' dropped.
> ?- region_total(X, Y).
No results.
> +region_total(Region, sum<Amount>) :- sales(Region, Amount).
Rule 'region_total' registered.
> ?- region_total(X, Y).
2 rows:
  (1, 300)
  (2, 550)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_sum_n14t122
Knowledge graph 'test_drop_sum_n14t122' dropped.
