Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_retract_sum_n14t123
Knowledge graph 'test_retract_sum_n14t123' created.
Switched to knowledge graph: test_retract_sum_n14t123
> .kg use test_retract_sum_n14t123
Switched to knowledge graph: test_retract_sum_n14t123
> +sales[(1, 100), (1, 200), (1, 150), (2, 300), (2, 250)]
Inserted 5 fact(s) into 'sales'.
> +region_total(Region, sum<Amount>) <- sales(Region, Amount)
Rule 'region_total' registered.
> ?region_total(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 450 │
│ 2 │ 550 │
└───┴─────┘
2 rows
> -sales(1, 200)
Deleted 1 facts from 'sales'.
> ?region_total(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 250 │
│ 2 │ 550 │
└───┴─────┘
2 rows
> +sales[(1, 500)]
Inserted 1 fact(s) into 'sales'.
> ?region_total(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 750 │
│ 2 │ 550 │
└───┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_retract_sum_n14t123
Knowledge graph 'test_retract_sum_n14t123' dropped.
