Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_min_n14t124
Knowledge graph 'test_drop_min_n14t124' created.
Switched to knowledge graph: test_drop_min_n14t124
> .kg use test_drop_min_n14t124
Switched to knowledge graph: test_drop_min_n14t124
> +reading[(1, 25), (1, 22), (1, 28), (2, 30), (2, 35)]
Inserted 5 fact(s) into 'reading'.
> +min_temp(Sensor, min<Temp>) <- reading(Sensor, Temp)
Rule 'min_temp' registered.
> ?min_temp(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 22 │
│ 2 │ 30 │
└───┴────┘
2 rows
> .rule drop min_temp
Rule 'min_temp' dropped.
> ?min_temp(X, Y)
No results.
> +min_temp(Sensor, min<Temp>) <- reading(Sensor, Temp)
Rule 'min_temp' registered.
> ?min_temp(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 22 │
│ 2 │ 30 │
└───┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_min_n14t124
Knowledge graph 'test_drop_min_n14t124' dropped.
