Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_avg_n14t128
Knowledge graph 'test_drop_avg_n14t128' created.
Switched to knowledge graph: test_drop_avg_n14t128
> .kg use test_drop_avg_n14t128
Switched to knowledge graph: test_drop_avg_n14t128
> +score[(1, 80), (1, 90), (1, 85), (2, 70), (2, 75)]
Inserted 5 fact(s) into 'score'.
> +avg_score(Student, avg<Points>) <- score(Student, Points)
Rule 'avg_score' registered.
> ?avg_score(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │ 85.0 │
│    2 │ 72.5 │
└──────┴──────┘
2 rows
> .rule drop avg_score
Rule 'avg_score' dropped.
> ?avg_score(X, Y)
No results.
> +avg_score(Student, avg<Points>) <- score(Student, Points)
Rule 'avg_score' registered.
> ?avg_score(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │ 85.0 │
│    2 │ 72.5 │
└──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_avg_n14t128
Knowledge graph 'test_drop_avg_n14t128' dropped.
