Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_count_distinct_n14t12
Knowledge graph 'test_count_distinct_n14t12' created.
Switched to knowledge graph: test_count_distinct_n14t12
> .kg use test_count_distinct_n14t12
Switched to knowledge graph: test_count_distinct_n14t12
> +sales[(1, 100, 5), (1, 100, 3), (1, 101, 2), (2, 100, 10), (2, 102, 4), (2, 103, 1), (3, 100, 7), (3, 100, 8), (3, 100, 9)].
Inserted 9 fact(s) into 'sales'.
> +unique_products(Store, Product) :- sales(Store, Product, _).
Rule 'unique_products' registered.
> ?- unique_products(S, P).
6 rows:
  (1, 100)
  (1, 101)
  (2, 100)
  (2, 102)
  (2, 103)
  (3, 100)
> +products_per_store(Store, count<Product>) :- unique_products(Store, Product).
Rule 'products_per_store' registered.
> ?- products_per_store(S, C).
3 rows:
  (1, 2)
  (2, 3)
  (3, 1)
> +all_products(Product) :- sales(_, Product, _).
Rule 'all_products' registered.
> +total_unique_products(count<P>) :- all_products(P).
Rule 'total_unique_products' registered.
> ?- total_unique_products(C).
1 rows:
  (4)
> +stores_per_product(Product, count<Store>) :- unique_products(Store, Product).
Rule 'stores_per_product' registered.
> ?- stores_per_product(P, C).
4 rows:
  (100, 3)
  (101, 1)
  (102, 1)
  (103, 1)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_count_distinct_n14t12
Knowledge graph 'test_count_distinct_n14t12' dropped.
