Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_drop_cd_n14t130
Knowledge graph 'test_drop_cd_n14t130' created.
Switched to knowledge graph: test_drop_cd_n14t130
> .kg use test_drop_cd_n14t130
Switched to knowledge graph: test_drop_cd_n14t130
> +sales[(1, "A", 5), (1, "A", 3), (1, "B", 2), (2, "A", 10), (2, "C", 4)]
Inserted 5 fact(s) into 'sales'.
> +unique_products(Store, Product) <- sales(Store, Product, _)
Rule 'unique_products' registered.
> +product_count(Store, count<Product>) <- unique_products(Store, Product)
Rule 'product_count' registered.
> ?product_count(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 2 │
└───┴───┘
2 rows
> .rule drop product_count
Rule 'product_count' dropped.
> ?product_count(X, Y)
No results.
> +product_count(Store, count<Product>) <- unique_products(Store, Product)
Rule 'product_count' registered.
> ?product_count(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 2 │
└───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_drop_cd_n14t130
Knowledge graph 'test_drop_cd_n14t130' dropped.
