Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_remove_clause_agg_n14t132
Knowledge graph 'test_remove_clause_agg_n14t132' created.
Switched to knowledge graph: test_remove_clause_agg_n14t132
> .kg use test_remove_clause_agg_n14t132
Switched to knowledge graph: test_remove_clause_agg_n14t132
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> +reachable(X, Y) <- edge(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- reachable(X, Y), edge(Y, Z)
Rule 'reachable' registered.
> +reach_count(Src, count<Dst>) <- reachable(Src, Dst)
Rule 'reach_count' registered.
> ?reach_count(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
│    2 │    2 │
│    3 │    1 │
└──────┴──────┘
3 rows
> .rule remove reachable 2
Clause 2 removed from rule 'reachable'.
> ?reach_count(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
│    2 │    1 │
│    3 │    1 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_remove_clause_agg_n14t132
Knowledge graph 'test_remove_clause_agg_n14t132' dropped.
