Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_retract_all_n14t134
Knowledge graph 'test_retract_all_n14t134' created.
Switched to knowledge graph: test_retract_all_n14t134
> .kg use test_retract_all_n14t134
Switched to knowledge graph: test_retract_all_n14t134
> +data[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'data'.
> +total(sum<V>) <- data(_, V)
Rule 'total' registered.
> +cnt(count<V>) <- data(_, V)
Rule 'cnt' registered.
> +mn(min<V>) <- data(_, V)
Rule 'mn' registered.
> +mx(max<V>) <- data(_, V)
Rule 'mx' registered.
> +av(avg<V>) <- data(_, V)
Rule 'av' registered.
> ?total(X)
┌────┐
│ X  │
├────┤
│ 60 │
└────┘
1 rows
> ?cnt(X)
┌───┐
│ X │
├───┤
│ 3 │
└───┘
1 rows
> ?mn(X)
┌────┐
│ X  │
├────┤
│ 10 │
└────┘
1 rows
> ?mx(X)
┌────┐
│ X  │
├────┤
│ 30 │
└────┘
1 rows
> ?av(X)
┌──────┐
│ X    │
├──────┤
│ 20.0 │
└──────┘
1 rows
> -data(1, 10)
Deleted 1 facts from 'data'.
> -data(2, 20)
Deleted 1 facts from 'data'.
> -data(3, 30)
Deleted 1 facts from 'data'.
> ?total(X)
No results.
> ?cnt(X)
No results.
> ?mn(X)
No results.
> ?mx(X)
No results.
> ?av(X)
No results.
> +data[(4, 40)]
Inserted 1 fact(s) into 'data'.
> ?total(X)
┌────┐
│ X  │
├────┤
│ 40 │
└────┘
1 rows
> ?cnt(X)
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
> ?mn(X)
┌────┐
│ X  │
├────┤
│ 40 │
└────┘
1 rows
> ?mx(X)
┌────┐
│ X  │
├────┤
│ 40 │
└────┘
1 rows
> ?av(X)
┌──────┐
│ X    │
├──────┤
│ 40.0 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_retract_all_n14t134
Knowledge graph 'test_retract_all_n14t134' dropped.
