Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_drop_n14t136
Knowledge graph 'test_multi_drop_n14t136' created.
Switched to knowledge graph: test_multi_drop_n14t136
> .kg use test_multi_drop_n14t136
Switched to knowledge graph: test_multi_drop_n14t136
> +data[(1, 10), (1, 20), (2, 30), (2, 40)]
Inserted 4 fact(s) into 'data'.
> +total(Grp, sum<V>) <- data(Grp, V)
Rule 'total' registered.
> +cnt(Grp, count<V>) <- data(Grp, V)
Rule 'cnt' registered.
> +lo(Grp, min<V>) <- data(Grp, V)
Rule 'lo' registered.
> +hi(Grp, max<V>) <- data(Grp, V)
Rule 'hi' registered.
> +av(Grp, avg<V>) <- data(Grp, V)
Rule 'av' registered.
> +top(Grp, top_k<1, V:desc>) <- data(Grp, V)
Rule 'top' registered.
> ?total(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 30 │
│ 2 │ 70 │
└───┴────┘
2 rows
> ?cnt(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 2 │
└───┴───┘
2 rows
> ?lo(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 10 │
│ 2 │ 30 │
└───┴────┘
2 rows
> ?hi(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 20 │
│ 2 │ 40 │
└───┴────┘
2 rows
> ?av(X, Y)
┌───┬──────┐
│ X │ Y    │
├───┼──────┤
│ 1 │ 15.0 │
│ 2 │ 35.0 │
└───┴──────┘
2 rows
> ?top(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 20 │
│ 2 │ 40 │
└───┴────┘
2 rows
> .rule drop total
Rule 'total' dropped.
> .rule drop cnt
Rule 'cnt' dropped.
> .rule drop lo
Rule 'lo' dropped.
> .rule drop hi
Rule 'hi' dropped.
> .rule drop av
Rule 'av' dropped.
> .rule drop top
Rule 'top' dropped.
> ?total(X, Y)
No results.
> ?cnt(X, Y)
No results.
> ?lo(X, Y)
No results.
> ?hi(X, Y)
No results.
> ?av(X, Y)
No results.
> ?top(X, Y)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_drop_n14t136
Knowledge graph 'test_multi_drop_n14t136' dropped.
