Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_topk_join_n14t139
Knowledge graph 'test_topk_join_n14t139' created.
Switched to knowledge graph: test_topk_join_n14t139
> .kg use test_topk_join_n14t139
Switched to knowledge graph: test_topk_join_n14t139
> +student[(1, "Alice"), (2, "Bob"), (3, "Charlie"), (4, "Diana")]
Inserted 4 fact(s) into 'student'.
> +grade[(1, 95), (2, 85), (3, 90), (4, 80)]
Inserted 4 fact(s) into 'grade'.
> +top_students(top_k<2, Name, Grade:desc>) <- student(Id, Name), grade(Id, Grade)
Rule 'top_students' registered.
> ?top_students(X, Y)
┌───────────┬────┐
│ X         │ Y  │
├───────────┼────┤
│ "Alice"   │ 95 │
│ "Charlie" │ 90 │
└───────────┴────┘
2 rows
> -grade(3, 90)
Deleted 1 facts from 'grade'.
> +grade[(3, 99)]
Inserted 1 fact(s) into 'grade'.
> ?top_students(X, Y)
┌───────────┬────┐
│ X         │ Y  │
├───────────┼────┤
│ "Alice"   │ 95 │
│ "Charlie" │ 99 │
└───────────┴────┘
2 rows
> -student(1, "Alice")
Deleted 1 facts from 'student'.
> -grade(1, 95)
Deleted 1 facts from 'grade'.
> ?top_students(X, Y)
┌───────────┬────┐
│ X         │ Y  │
├───────────┼────┤
│ "Bob"     │ 85 │
│ "Charlie" │ 99 │
└───────────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_topk_join_n14t139
Knowledge graph 'test_topk_join_n14t139' dropped.
