Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rapid_agg_n14t141
Knowledge graph 'test_rapid_agg_n14t141' created.
Switched to knowledge graph: test_rapid_agg_n14t141
> .kg use test_rapid_agg_n14t141
Switched to knowledge graph: test_rapid_agg_n14t141
> +data[(1, 10)]
Inserted 1 fact(s) into 'data'.
> +total(sum<V>) <- data(_, V)
Rule 'total' registered.
> +cnt(count<V>) <- data(_, V)
Rule 'cnt' registered.
> ?total(X)
┌────┐
│ X  │
├────┤
│ 10 │
└────┘
1 rows
> ?cnt(X)
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
> +data[(2, 20)]
Inserted 1 fact(s) into 'data'.
> ?total(X)
┌────┐
│ X  │
├────┤
│ 30 │
└────┘
1 rows
> ?cnt(X)
┌───┐
│ X │
├───┤
│ 2 │
└───┘
1 rows
> -data(1, 10)
Deleted 1 facts from 'data'.
> +data[(3, 30)]
Inserted 1 fact(s) into 'data'.
> ?total(X)
┌────┐
│ X  │
├────┤
│ 50 │
└────┘
1 rows
> ?cnt(X)
┌───┐
│ X │
├───┤
│ 2 │
└───┘
1 rows
> +data[(4, 40), (5, 50)]
Inserted 2 fact(s) into 'data'.
> ?total(X)
┌─────┐
│ X   │
├─────┤
│ 140 │
└─────┘
1 rows
> ?cnt(X)
┌───┐
│ X │
├───┤
│ 4 │
└───┘
1 rows
> -data(2, 20)
Deleted 1 facts from 'data'.
> -data(3, 30)
Deleted 1 facts from 'data'.
> ?total(X)
┌────┐
│ X  │
├────┤
│ 90 │
└────┘
1 rows
> ?cnt(X)
┌───┐
│ X │
├───┤
│ 2 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rapid_agg_n14t141
Knowledge graph 'test_rapid_agg_n14t141' dropped.
