Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rapid_agg_n14t141
Knowledge graph 'test_rapid_agg_n14t141' created.
Switched to knowledge graph: test_rapid_agg_n14t141
> .kg use test_rapid_agg_n14t141
Switched to knowledge graph: test_rapid_agg_n14t141
> +data[(1, 10)].
Inserted 1 fact(s) into 'data'.
> +total(sum<V>) :- data(_, V).
Rule 'total' registered.
> +cnt(count<V>) :- data(_, V).
Rule 'cnt' registered.
> ?- total(X).
1 rows:
  (10)
> ?- cnt(X).
1 rows:
  (1)
> +data[(2, 20)].
Inserted 1 fact(s) into 'data'.
> ?- total(X).
1 rows:
  (30)
> ?- cnt(X).
1 rows:
  (2)
> -data(1, 10).
Deleted 1 facts from 'data'.
> +data[(3, 30)].
Inserted 1 fact(s) into 'data'.
> ?- total(X).
1 rows:
  (50)
> ?- cnt(X).
1 rows:
  (2)
> +data[(4, 40), (5, 50)].
Inserted 2 fact(s) into 'data'.
> ?- total(X).
1 rows:
  (140)
> ?- cnt(X).
1 rows:
  (4)
> -data(2, 20).
Deleted 1 facts from 'data'.
> -data(3, 30).
Deleted 1 facts from 'data'.
> ?- total(X).
1 rows:
  (90)
> ?- cnt(X).
1 rows:
  (2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rapid_agg_n14t141
Knowledge graph 'test_rapid_agg_n14t141' dropped.
