Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_agg_on_agg_n14t143
Knowledge graph 'test_agg_on_agg_n14t143' created.
Switched to knowledge graph: test_agg_on_agg_n14t143
> .kg use test_agg_on_agg_n14t143
Switched to knowledge graph: test_agg_on_agg_n14t143
> +sales[("US", 100), ("US", 200), ("US", 150), ("EU", 300), ("EU", 250)].
Inserted 5 fact(s) into 'sales'.
> +region_total(Region, sum<Amount>) :- sales(Region, Amount).
Rule 'region_total' registered.
> +global_max(max<Total>) :- region_total(_, Total).
Rule 'global_max' registered.
> +region_count(count<Region>) :- region_total(Region, _).
Rule 'region_count' registered.
> ?- region_total(X, Y).
2 rows:
  ("EU", 550)
  ("US", 450)
> ?- global_max(X).
1 rows:
  (550)
> ?- region_count(X).
1 rows:
  (2)
> -sales("US", 100).
Deleted 1 facts from 'sales'.
> -sales("US", 200).
Deleted 1 facts from 'sales'.
> ?- region_total(X, Y).
2 rows:
  ("EU", 550)
  ("US", 150)
> ?- global_max(X).
1 rows:
  (550)
> ?- region_count(X).
1 rows:
  (2)
> -sales("EU", 300).
Deleted 1 facts from 'sales'.
> -sales("EU", 250).
Deleted 1 facts from 'sales'.
> ?- region_total(X, Y).
1 rows:
  ("US", 150)
> ?- global_max(X).
1 rows:
  (150)
> ?- region_count(X).
1 rows:
  (1)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_on_agg_n14t143
Knowledge graph 'test_agg_on_agg_n14t143' dropped.
