Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_topk_thresh_boundary_n14t145
Knowledge graph 'test_topk_thresh_boundary_n14t145' created.
Switched to knowledge graph: test_topk_thresh_boundary_n14t145
> .kg use test_topk_thresh_boundary_n14t145
Switched to knowledge graph: test_topk_thresh_boundary_n14t145
> +score[(1, 300), (2, 200), (3, 150), (4, 100), (5, 50)].
Inserted 5 fact(s) into 'score'.
> +high(top_k_threshold<3, 100, Id, Points:desc>) :- score(Id, Points).
Rule 'high' registered.
> ?- high(X, Y).
3 rows:
  (1, 300)
  (2, 200)
  (3, 150)
> -score(1, 300).
Deleted 1 facts from 'score'.
> ?- high(X, Y).
3 rows:
  (2, 200)
  (3, 150)
  (4, 100)
> +score[(6, 80)].
Inserted 1 fact(s) into 'score'.
> ?- high(X, Y).
3 rows:
  (2, 200)
  (3, 150)
  (4, 100)
> +score[(7, 250)].
Inserted 1 fact(s) into 'score'.
> ?- high(X, Y).
3 rows:
  (2, 200)
  (3, 150)
  (7, 250)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_topk_thresh_boundary_n14t145
Knowledge graph 'test_topk_thresh_boundary_n14t145' dropped.
