Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_switch_agg_n14t147
Knowledge graph 'test_switch_agg_n14t147' created.
Switched to knowledge graph: test_switch_agg_n14t147
> .kg use test_switch_agg_n14t147
Switched to knowledge graph: test_switch_agg_n14t147
> +data[(1, 10), (1, 20), (2, 30), (2, 40), (2, 50)].
Inserted 5 fact(s) into 'data'.
> +result(Grp, sum<V>) :- data(Grp, V).
Rule 'result' registered.
> ?- result(X, Y).
2 rows:
  (1, 30)
  (2, 120)
> .rule drop result
Rule 'result' dropped.
> +result(Grp, count<V>) :- data(Grp, V).
Rule 'result' registered.
> ?- result(X, Y).
2 rows:
  (1, 2)
  (2, 3)
> .rule drop result
Rule 'result' dropped.
> +result(Grp, max<V>) :- data(Grp, V).
Rule 'result' registered.
> ?- result(X, Y).
2 rows:
  (1, 20)
  (2, 50)
> .rule drop result
Rule 'result' dropped.
> +result(Grp, min<V>) :- data(Grp, V).
Rule 'result' registered.
> ?- result(X, Y).
2 rows:
  (1, 10)
  (2, 30)
> .rule drop result
Rule 'result' dropped.
> +result(Grp, avg<V>) :- data(Grp, V).
Rule 'result' registered.
> ?- result(X, Y).
2 rows:
  (1, 15.0)
  (2, 40.0)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_switch_agg_n14t147
Knowledge graph 'test_switch_agg_n14t147' dropped.
