Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_topk_str_n14t150
Knowledge graph 'test_topk_str_n14t150' created.
Switched to knowledge graph: test_topk_str_n14t150
> .kg use test_topk_str_n14t150
Switched to knowledge graph: test_topk_str_n14t150
> +item[(1, "zebra"), (2, "apple"), (3, "mango"), (4, "banana")].
Inserted 4 fact(s) into 'item'.
> +top_desc(top_k<2, Id, Name:desc>) :- item(Id, Name).
Rule 'top_desc' registered.
> +top_asc(top_k<2, Id, Name:asc>) :- item(Id, Name).
Rule 'top_asc' registered.
> ?- top_desc(X, Y).
2 rows:
  (1, "zebra")
  (3, "mango")
> ?- top_asc(X, Y).
2 rows:
  (2, "apple")
  (4, "banana")
> -item(1, "zebra").
Deleted 1 facts from 'item'.
> ?- top_desc(X, Y).
2 rows:
  (3, "mango")
  (4, "banana")
> +item[(5, "zoo")].
Inserted 1 fact(s) into 'item'.
> ?- top_desc(X, Y).
2 rows:
  (3, "mango")
  (5, "zoo")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_topk_str_n14t150
Knowledge graph 'test_topk_str_n14t150' dropped.
