Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_add_clause_n14t153
Knowledge graph 'test_add_clause_n14t153' created.
Switched to knowledge graph: test_add_clause_n14t153
> .kg use test_add_clause_n14t153
Switched to knowledge graph: test_add_clause_n14t153
> +edge[(1, 2), (2, 3), (3, 4)].
Inserted 3 fact(s) into 'edge'.
> +shortcut[(1, 4)].
Inserted 1 fact(s) into 'shortcut'.
> +reach(X, Y) :- edge(X, Y).
Rule 'reach' registered.
> ?- reach(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> +reach(X, Y) :- shortcut(X, Y).
Rule 'reach' registered.
> ?- reach(X, Y).
4 rows:
  (1, 2)
  (1, 4)
  (2, 3)
  (3, 4)
> .rule list
Rules:
  reach (2 clause(s))
> .kg use default
Switched to knowledge graph: default
> .kg drop test_add_clause_n14t153
Knowledge graph 'test_add_clause_n14t153' dropped.
