Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_add_agg_clause_n14t154
Knowledge graph 'test_add_agg_clause_n14t154' created.
Switched to knowledge graph: test_add_agg_clause_n14t154
> .kg use test_add_agg_clause_n14t154
Switched to knowledge graph: test_add_agg_clause_n14t154
> +score[("math", "Alice", 95), ("math", "Bob", 85)]
Inserted 2 fact(s) into 'score'.
> +extra[("math", "Charlie", 90)]
Inserted 1 fact(s) into 'extra'.
> +total(Subject, sum<Grade>) <- score(Subject, _, Grade)
Rule 'total' registered.
> ?total(S, T)
┌────────┬──────┐
│ col0   │ col1 │
├────────┼──────┤
│ "math" │  180 │
└────────┴──────┘
1 rows
> +total(Subject, sum<Grade>) <- extra(Subject, _, Grade)
Rule 'total' registered.
> ?total(S, T)
┌────────┬──────┐
│ col0   │ col1 │
├────────┼──────┤
│ "math" │   90 │
│ "math" │  180 │
└────────┴──────┘
2 rows
> .rule list
Rules:
  total (2 clause(s))
> .kg use default
Switched to knowledge graph: default
> .kg drop test_add_agg_clause_n14t154
Knowledge graph 'test_add_agg_clause_n14t154' dropped.
