Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_diff_body_agg_n14t156
Knowledge graph 'test_diff_body_agg_n14t156' created.
Switched to knowledge graph: test_diff_body_agg_n14t156
> .kg use test_diff_body_agg_n14t156
Switched to knowledge graph: test_diff_body_agg_n14t156
> +score[("Alice", 90), ("Bob", 80), ("Charlie", 70), ("Dave", 60)]
Inserted 4 fact(s) into 'score'.
> +top_score(Name, max<Grade>) <- score(Name, Grade), Grade > 75
Rule 'top_score' registered.
> ?top_score(N, G)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "Alice" │   90 │
│ "Bob"   │   80 │
└─────────┴──────┘
2 rows
> +top_score(Name, max<Grade>) <- score(Name, Grade), Grade > 65
Rule 'top_score' registered.
> ?top_score(N, G)
┌───────────┬──────┐
│ col0      │ col1 │
├───────────┼──────┤
│ "Alice"   │   90 │
│ "Bob"     │   80 │
│ "Charlie" │   70 │
└───────────┴──────┘
3 rows
> .rule list
Rules:
  top_score (2 clause(s))
> .kg use default
Switched to knowledge graph: default
> .kg drop test_diff_body_agg_n14t156
Knowledge graph 'test_diff_body_agg_n14t156' dropped.
