Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_add_recursive_n14t157
Knowledge graph 'test_add_recursive_n14t157' created.
Switched to knowledge graph: test_add_recursive_n14t157
> .kg use test_add_recursive_n14t157
Switched to knowledge graph: test_add_recursive_n14t157
> +edge[(1, 2), (2, 3)]
Inserted 2 fact(s) into 'edge'.
> +skip[(1, 3)]
Inserted 1 fact(s) into 'skip'.
> +path(X, Y) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- path(X, Y), edge(Y, Z)
Rule 'path' registered.
> ?path(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 3 │
└───┴───┘
3 rows
> +path(X, Y) <- skip(X, Y)
Rule 'path' registered.
> ?path(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 3 │
└───┴───┘
3 rows
> .rule list
Rules:
  path (3 clause(s))
> .kg use default
Switched to knowledge graph: default
> .kg drop test_add_recursive_n14t157
Knowledge graph 'test_add_recursive_n14t157' dropped.
