Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_remove_readd_agg_n14t158
Knowledge graph 'test_remove_readd_agg_n14t158' created.
Switched to knowledge graph: test_remove_readd_agg_n14t158
> .kg use test_remove_readd_agg_n14t158
Switched to knowledge graph: test_remove_readd_agg_n14t158
> +score[(1, 100), (2, 200), (3, 150)].
Inserted 3 fact(s) into 'score'.
> +best(max<Score>) :- score(_, Score).
Rule 'best' registered.
> ?- best(X).
1 rows:
  (200)
> .rule remove best 1
Clause 1 removed from rule 'best'. Rule completely deleted (no clauses remaining).
> ?- best(X).
No results.
> +best(min<Score>) :- score(_, Score).
Rule 'best' registered.
> ?- best(X).
1 rows:
  (100)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_remove_readd_agg_n14t158
Knowledge graph 'test_remove_readd_agg_n14t158' dropped.
