Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_remove_steps_n14t159
Knowledge graph 'test_remove_steps_n14t159' created.
Switched to knowledge graph: test_remove_steps_n14t159
> .kg use test_remove_steps_n14t159
Switched to knowledge graph: test_remove_steps_n14t159
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> +reach(X, Y) <- edge(X, Y)
Rule 'reach' registered.
> +reach(X, Z) <- reach(X, Y), edge(Y, Z)
Rule 'reach' registered.
> ?reach(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
│    2 │    3 │
│    2 │    4 │
│    3 │    4 │
└──────┴──────┘
6 rows
> .rule remove reach 2
Clause 2 removed from rule 'reach'.
> ?reach(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
│    3 │    4 │
└──────┴──────┘
3 rows
> .rule remove reach 1
Clause 1 removed from rule 'reach'. Rule completely deleted (no clauses remaining).
> ?reach(X, Y)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_remove_steps_n14t159
Knowledge graph 'test_remove_steps_n14t159' dropped.
