Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_agg_negation
Knowledge graph 'test_agg_negation' created.
Switched to knowledge graph: test_agg_negation
> .kg use test_agg_negation
Switched to knowledge graph: test_agg_negation
> +employees[(1, 101, 50000), (1, 102, 60000), (1, 103, 45000), (2, 201, 70000), (2, 202, 55000), (2, 203, 80000), (3, 301, 40000), (3, 302, 65000)].
Inserted 8 fact(s) into 'employees'.
> +excluded[(102), (203), (301)].
Inserted 3 fact(s) into 'excluded'.
> +active_employee(Dept, Emp, Sal) :- employees(Dept, Emp, Sal), !excluded(Emp).
Rule 'active_employee' registered.
> +active_count(Dept, count<Emp>) :- active_employee(Dept, Emp, _).
Rule 'active_count' registered.
> ?- active_employee(D, E, S).
5 rows:
  (1, 101, 50000)
  (1, 103, 45000)
  (2, 201, 70000)
  (2, 202, 55000)
  (3, 302, 65000)
> ?- active_count(D, C).
3 rows:
  (1, 2)
  (2, 2)
  (3, 1)
> +active_salary_sum(Dept, sum<Sal>) :- active_employee(Dept, _, Sal).
Rule 'active_salary_sum' registered.
> ?- active_salary_sum(D, S).
3 rows:
  (1, 95000)
  (2, 125000)
  (3, 65000)
> +active_salary_avg(Dept, avg<Sal>) :- active_employee(Dept, _, Sal).
Rule 'active_salary_avg' registered.
> ?- active_salary_avg(D, A).
3 rows:
  (1, 47500.0)
  (2, 62500.0)
  (3, 65000.0)
> +all_count(Dept, count<Emp>) :- employees(Dept, Emp, _).
Rule 'all_count' registered.
> ?- all_count(D, C).
3 rows:
  (1, 3)
  (2, 3)
  (3, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_negation
Knowledge graph 'test_agg_negation' dropped.
