Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_remove_readd_n14t160
Knowledge graph 'test_remove_readd_n14t160' created.
Switched to knowledge graph: test_remove_readd_n14t160
> .kg use test_remove_readd_n14t160
Switched to knowledge graph: test_remove_readd_n14t160
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> +link[(10, 20)]
Inserted 1 fact(s) into 'link'.
> +reach(X, Y) <- edge(X, Y)
Rule 'reach' registered.
> +reach(X, Z) <- reach(X, Y), edge(Y, Z)
Rule 'reach' registered.
> ?reach(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 4 │
└───┴───┘
6 rows
> .rule remove reach 1
Clause 1 removed from rule 'reach'.
> ?reach(X, Y)
No results.
> +reach(X, Y) <- link(X, Y)
Rule 'reach' registered.
> ?reach(X, Y)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│ 10 │ 20 │
└────┴────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_remove_readd_n14t160
Knowledge graph 'test_remove_readd_n14t160' dropped.
