Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_agg_empty_n14t163
Knowledge graph 'test_agg_empty_n14t163' created.
Switched to knowledge graph: test_agg_empty_n14t163
> .kg use test_agg_empty_n14t163
Switched to knowledge graph: test_agg_empty_n14t163
> +total(sum<X>) :- numbers(X).
Rule 'total' registered.
> ?- total(X).
No results.
> +numbers[(10), (20), (30)].
Inserted 3 fact(s) into 'numbers'.
> ?- total(X).
1 rows:
  (60)
> -numbers(10).
Deleted 1 facts from 'numbers'.
> ?- total(X).
1 rows:
  (50)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_empty_n14t163
Knowledge graph 'test_agg_empty_n14t163' dropped.
