Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_agg_neg_n14t165
Knowledge graph 'test_agg_neg_n14t165' created.
Switched to knowledge graph: test_agg_neg_n14t165
> .kg use test_agg_neg_n14t165
Switched to knowledge graph: test_agg_neg_n14t165
> +temp[(-10), (-20), (-5), (-30), (-1)].
Inserted 5 fact(s) into 'temp'.
> +hottest(max<T>) :- temp(T).
Rule 'hottest' registered.
> +coldest(min<T>) :- temp(T).
Rule 'coldest' registered.
> +total(sum<T>) :- temp(T).
Rule 'total' registered.
> +top2_warm(top_k<2, T:desc>) :- temp(T).
Rule 'top2_warm' registered.
> +top2_cold(top_k<2, T:asc>) :- temp(T).
Rule 'top2_cold' registered.
> ?- hottest(X).
1 rows:
  (-1)
> ?- coldest(X).
1 rows:
  (-30)
> ?- total(X).
1 rows:
  (-66)
> ?- top2_warm(X).
2 rows:
  (-5)
  (-1)
> ?- top2_cold(X).
2 rows:
  (-30)
  (-20)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_neg_n14t165
Knowledge graph 'test_agg_neg_n14t165' dropped.
