Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_agg_float_n14t166
Knowledge graph 'test_agg_float_n14t166' created.
Switched to knowledge graph: test_agg_float_n14t166
> .kg use test_agg_float_n14t166
Switched to knowledge graph: test_agg_float_n14t166
> +measurement[(1, 3.14), (2, 2.71), (3, 1.41), (4, 0.0), (5, -1.5)]
Inserted 5 fact(s) into 'measurement'.
> +total(sum<Val>) <- measurement(_, Val)
Rule 'total' registered.
> +biggest(max<Val>) <- measurement(_, Val)
Rule 'biggest' registered.
> +smallest(min<Val>) <- measurement(_, Val)
Rule 'smallest' registered.
> +top2(top_k<2, Id, Val:desc>) <- measurement(Id, Val)
Rule 'top2' registered.
> ?total(X)
┌───┐
│ X │
├───┤
│ 5 │
└───┘
1 rows
> ?biggest(X)
┌──────┐
│ X    │
├──────┤
│ 3.14 │
└──────┘
1 rows
> ?smallest(X)
┌──────┐
│ X    │
├──────┤
│ -1.5 │
└──────┘
1 rows
> ?top2(X, Y)
┌───┬──────┐
│ X │ Y    │
├───┼──────┤
│ 1 │ 3.14 │
│ 2 │ 2.71 │
└───┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_float_n14t166
Knowledge graph 'test_agg_float_n14t166' dropped.
