Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_agg_ident_n14t168
Knowledge graph 'test_agg_ident_n14t168' created.
Switched to knowledge graph: test_agg_ident_n14t168
> .kg use test_agg_ident_n14t168
Switched to knowledge graph: test_agg_ident_n14t168
> +score[(1, 50), (2, 50), (3, 50)]
Inserted 3 fact(s) into 'score'.
> +total(sum<S>) <- score(_, S)
Rule 'total' registered.
> +cnt(count<Id>) <- score(Id, _)
Rule 'cnt' registered.
> +biggest(max<S>) <- score(_, S)
Rule 'biggest' registered.
> +top2(top_k<2, Id, S:desc>) <- score(Id, S)
Rule 'top2' registered.
> ?total(X)
┌─────┐
│ X   │
├─────┤
│ 150 │
└─────┘
1 rows
> ?cnt(X)
┌───┐
│ X │
├───┤
│ 3 │
└───┘
1 rows
> ?biggest(X)
┌────┐
│ X  │
├────┤
│ 50 │
└────┘
1 rows
> ?top2(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │ 50 │
│ 2 │ 50 │
└───┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_agg_ident_n14t168
Knowledge graph 'test_agg_ident_n14t168' dropped.
