Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_ins_del_agg_n14t171
Knowledge graph 'test_ins_del_agg_n14t171' created.
Switched to knowledge graph: test_ins_del_agg_n14t171
> .kg use test_ins_del_agg_n14t171
Switched to knowledge graph: test_ins_del_agg_n14t171
> +score[(1, 100), (2, 200), (3, 300)]
Inserted 3 fact(s) into 'score'.
> +best(max<S>) <- score(_, S)
Rule 'best' registered.
> ?best(X)
┌─────┐
│ X   │
├─────┤
│ 300 │
└─────┘
1 rows
> -score(3, 300)
Deleted 1 facts from 'score'.
> +score[(4, 250)]
Inserted 1 fact(s) into 'score'.
> ?best(X)
┌─────┐
│ X   │
├─────┤
│ 250 │
└─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_ins_del_agg_n14t171
Knowledge graph 'test_ins_del_agg_n14t171' dropped.
