Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_interleave_n14t173
Knowledge graph 'test_interleave_n14t173' created.
Switched to knowledge graph: test_interleave_n14t173
> .kg use test_interleave_n14t173
Switched to knowledge graph: test_interleave_n14t173
> +data[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'data'.
> +agg(sum<V>) <- data(_, V)
Rule 'agg' registered.
> ?agg(X)
┌────┐
│ X  │
├────┤
│ 60 │
└────┘
1 rows
> +data[(4, 40)]
Inserted 1 fact(s) into 'data'.
> ?agg(X)
┌─────┐
│ X   │
├─────┤
│ 100 │
└─────┘
1 rows
> .rule drop agg
Rule 'agg' dropped.
> ?agg(X)
No results.
> +agg(max<V>) <- data(_, V)
Rule 'agg' registered.
> ?agg(X)
┌────┐
│ X  │
├────┤
│ 40 │
└────┘
1 rows
> -data(4, 40)
Deleted 1 facts from 'data'.
> ?agg(X)
┌────┐
│ X  │
├────┤
│ 30 │
└────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_interleave_n14t173
Knowledge graph 'test_interleave_n14t173' dropped.
