Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rank_conflict_n14t178
Knowledge graph 'test_rank_conflict_n14t178' created.
Switched to knowledge graph: test_rank_conflict_n14t178
> .kg use test_rank_conflict_n14t178
Switched to knowledge graph: test_rank_conflict_n14t178
> +data[(1, 0.5), (2, 1.5), (3, 2.5)]
Inserted 3 fact(s) into 'data'.
> +result(top_k<2, Id, V:desc>) <- data(Id, V)
Rule 'result' registered.
> ?result(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 2 │ 1.5 │
│ 3 │ 2.5 │
└───┴─────┘
2 rows
> +result(within_radius<2.0, Id, V:asc>) <- data(Id, V)
Failed to register rule: Conflicting aggregation: cannot add clause with 'within_radius<2, Id, V:asc>' to rule 'result' which already has a clause with 'top_k<2, Id, V:desc>'. Drop the rule first with '.rule drop result' and re-create it.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rank_conflict_n14t178
Knowledge graph 'test_rank_conflict_n14t178' dropped.
