Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_topk_thresh_n14t179
Knowledge graph 'test_topk_thresh_n14t179' created.
Switched to knowledge graph: test_topk_thresh_n14t179
> .kg use test_topk_thresh_n14t179
Switched to knowledge graph: test_topk_thresh_n14t179
> +score[(1, 50), (2, 250), (3, 175), (4, 300)]
Inserted 4 fact(s) into 'score'.
> +best(top_k<2, Player, Points:desc>) <- score(Player, Points)
Rule 'best' registered.
> ?best(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 2 │ 250 │
│ 4 │ 300 │
└───┴─────┘
2 rows
> +best(top_k_threshold<2, 100, Player, Points:desc>) <- score(Player, Points)
Failed to register rule: Conflicting aggregation: cannot add clause with 'top_k_threshold<2, 100, Player, Points:desc>' to rule 'best' which already has a clause with 'top_k<2, Player, Points:desc>'. Drop the rule first with '.rule drop best' and re-create it.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_topk_thresh_n14t179
Knowledge graph 'test_topk_thresh_n14t179' dropped.
