Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_min_max
Knowledge graph 'test_min_max' created.
Switched to knowledge graph: test_min_max
> .kg use test_min_max
Switched to knowledge graph: test_min_max
> +scores[(1, 85), (1, 92), (1, 78), (2, 95), (2, 88), (3, 70)].
Inserted 6 fact(s) into 'scores'.
> +min_score(Group, min<Score>) :- scores(Group, Score).
Rule 'min_score' registered.
> ?- min_score(G, S).
3 rows:
  (1, 78)
  (2, 88)
  (3, 70)
> +max_score(Group, max<Score>) :- scores(Group, Score).
Rule 'max_score' registered.
> ?- max_score(G, S).
3 rows:
  (1, 92)
  (2, 95)
  (3, 70)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_min_max
Knowledge graph 'test_min_max' dropped.
