Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sum_avg
Knowledge graph 'test_sum_avg' created.
Switched to knowledge graph: test_sum_avg
> .kg use test_sum_avg
Switched to knowledge graph: test_sum_avg
> +sales[(1, 100), (1, 150), (1, 200), (2, 300), (2, 250)].
Inserted 5 fact(s) into 'sales'.
> +total_sales(Group, sum<Amount>) :- sales(Group, Amount).
Rule 'total_sales' registered.
> ?- total_sales(G, T).
2 rows:
  (1, 450)
  (2, 550)
> +avg_sales(Group, avg<Amount>) :- sales(Group, Amount).
Rule 'avg_sales' registered.
> ?- avg_sales(G, A).
2 rows:
  (1, 150.0)
  (2, 275.0)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sum_avg
Knowledge graph 'test_sum_avg' dropped.
