Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_group
Knowledge graph 'test_multi_group' created.
Switched to knowledge graph: test_multi_group
> .kg use test_multi_group
Switched to knowledge graph: test_multi_group
> +sales[(1, "A", 100), (1, "A", 150), (1, "B", 200), (2, "A", 300), (2, "B", 250), (2, "B", 100)].
Inserted 6 fact(s) into 'sales'.
> +sales_count(Region, Product, count<Amount>) :- sales(Region, Product, Amount).
Rule 'sales_count' registered.
> ?- sales_count(R, P, C).
4 rows:
  (1, "A", 2)
  (1, "B", 1)
  (2, "A", 1)
  (2, "B", 2)
> +sales_sum(Region, Product, sum<Amount>) :- sales(Region, Product, Amount).
Rule 'sales_sum' registered.
> ?- sales_sum(R, P, S).
4 rows:
  (1, "A", 250)
  (1, "B", 200)
  (2, "A", 300)
  (2, "B", 350)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_group
Knowledge graph 'test_multi_group' dropped.
