Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cond_agg_n14t24
Knowledge graph 'test_cond_agg_n14t24' created.
Switched to knowledge graph: test_cond_agg_n14t24
> .kg use test_cond_agg_n14t24
Switched to knowledge graph: test_cond_agg_n14t24
> +transactions[(1, "credit", 100), (2, "debit", 50), (3, "credit", 200), (4, "debit", 75), (5, "credit", 150)].
Inserted 5 fact(s) into 'transactions'.
> credit_sum(sum<Amt>) :- transactions(_, "credit", Amt).
1 rows:
  (450)
(session: 1 rule(s))
> ?- credit_sum(S).
1 rows:
  (450)
> debit_sum(sum<Amt>) :- transactions(_, "debit", Amt).
1 rows:
  (125)
(session: 2 rule(s))
> ?- debit_sum(S).
1 rows:
  (125)
> type_count(Type, count<Amt>) :- transactions(_, Type, Amt).
2 rows:
  ("credit", 3)
  ("debit", 2)
(session: 3 rule(s))
> ?- type_count(Type, Count).
2 rows:
  ("credit", 3)
  ("debit", 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_cond_agg_n14t24
Knowledge graph 'test_cond_agg_n14t24' dropped.
