Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_percentile_n14t25
Knowledge graph 'test_percentile_n14t25' created.
Switched to knowledge graph: test_percentile_n14t25
> .kg use test_percentile_n14t25
Switched to knowledge graph: test_percentile_n14t25
> +scores[(1, 10), (2, 20), (3, 30), (4, 40), (5, 50), (6, 60), (7, 70), (8, 80), (9, 90), (10, 100)].
Inserted 10 fact(s) into 'scores'.
> +total_count(count<S>) :- scores(_, S).
Rule 'total_count' registered.
> rank(Id, Score, count<Other>) :- scores(Id, Score), scores(_, Other), Other <= Score.
10 rows:
  (1, 10, 1)
  (2, 20, 2)
  (3, 30, 3)
  (4, 40, 4)
  (5, 50, 5)
  (6, 60, 6)
  (7, 70, 7)
  (8, 80, 8)
  (9, 90, 9)
  (10, 100, 10)
(session: 1 rule(s))
> ?- rank(Id, Score, Rank).
10 rows:
  (1, 10, 1)
  (2, 20, 2)
  (3, 30, 3)
  (4, 40, 4)
  (5, 50, 5)
  (6, 60, 6)
  (7, 70, 7)
  (8, 80, 8)
  (9, 90, 9)
  (10, 100, 10)
> median_score(Id, Score) :- rank(Id, Score, 5).
1 rows:
  (5, 50)
(session: 2 rule(s))
> ?- median_score(Id, Score).
1 rows:
  (5, 50)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_percentile_n14t25
Knowledge graph 'test_percentile_n14t25' dropped.
