Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_buckets_n14t27
Knowledge graph 'test_buckets_n14t27' created.
Switched to knowledge graph: test_buckets_n14t27
> .kg use test_buckets_n14t27
Switched to knowledge graph: test_buckets_n14t27
> +scores[(1, 15), (2, 35), (3, 55), (4, 75), (5, 95)]
Inserted 5 fact(s) into 'scores'.
> +bucket(Id, Score, "low") <- scores(Id, Score), Score < 40
Rule 'bucket' registered.
> +bucket(Id, Score, "medium") <- scores(Id, Score), Score >= 40, Score < 70
Rule 'bucket' registered.
> +bucket(Id, Score, "high") <- scores(Id, Score), Score >= 70
Rule 'bucket' registered.
> ?bucket(Id, Score, Bucket)
┌────┬───────┬──────────┐
│ Id │ Score │ Bucket   │
├────┼───────┼──────────┤
│  1 │    15 │ "low"    │
│  2 │    35 │ "low"    │
│  3 │    55 │ "medium" │
│  4 │    75 │ "high"   │
│  5 │    95 │ "high"   │
└────┴───────┴──────────┘
5 rows
> +bucket_count(Bucket, count<Id>) <- bucket(Id, _, Bucket)
Rule 'bucket_count' registered.
> ?bucket_count(Bucket, Count)
┌──────────┬───────┐
│ Bucket   │ Count │
├──────────┼───────┤
│ "high"   │     2 │
│ "low"    │     2 │
│ "medium" │     1 │
└──────────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_buckets_n14t27
Knowledge graph 'test_buckets_n14t27' dropped.
