Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ratio_n14t28
Knowledge graph 'test_ratio_n14t28' created.
Switched to knowledge graph: test_ratio_n14t28
> .kg use test_ratio_n14t28
Switched to knowledge graph: test_ratio_n14t28
> +sales[("North", 100), ("North", 150), ("South", 200), ("South", 250), ("East", 50)].
Inserted 5 fact(s) into 'sales'.
> +region_total(Region, sum<Amt>) :- sales(Region, Amt).
Rule 'region_total' registered.
> ?- region_total(Region, Total).
3 rows:
  ("East", 50)
  ("North", 250)
  ("South", 450)
> +grand_total(sum<Amt>) :- sales(_, Amt).
Rule 'grand_total' registered.
> ?- grand_total(Total).
1 rows:
  (750)
> +region_count(Region, count<Amt>) :- sales(Region, Amt).
Rule 'region_count' registered.
> ?- region_count(Region, Count).
3 rows:
  ("East", 1)
  ("North", 2)
  ("South", 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_ratio_n14t28
Knowledge graph 'test_ratio_n14t28' dropped.
