Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_group_n14t30
Knowledge graph 'test_empty_group_n14t30' created.
Switched to knowledge graph: test_empty_group_n14t30
> .kg use test_empty_group_n14t30
Switched to knowledge graph: test_empty_group_n14t30
> +sales[("North", 100), ("North", 150), ("South", 200)].
Inserted 3 fact(s) into 'sales'.
> +region_sum(Region, sum<Amt>) :- sales(Region, Amt).
Rule 'region_sum' registered.
> ?- region_sum(Region, Sum).
2 rows:
  ("North", 250)
  ("South", 200)
> north_only(Amt) :- sales("North", Amt).
2 rows:
  (100)
  (150)
(session: 1 rule(s))
> ?- north_only(Amt).
2 rows:
  (100)
  (150)
> east_only(Amt) :- sales("East", Amt).
No results.
(session: 2 rule(s))
> ?- east_only(Amt).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_empty_group_n14t30
Knowledge graph 'test_empty_group_n14t30' dropped.
