Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_min_max_n14t31
Knowledge graph 'test_min_max_n14t31' created.
Switched to knowledge graph: test_min_max_n14t31
> .kg use test_min_max_n14t31
Switched to knowledge graph: test_min_max_n14t31
> +values[(10,), (20,), (5,), (30,), (15,)].
Inserted 5 fact(s) into 'values'.
> min_val(min<V>) :- values(V).
1 rows:
  (5)
(session: 1 rule(s))
> max_val(max<V>) :- values(V).
1 rows:
  (30)
(session: 2 rule(s))
> ?- min_val(M).
1 rows:
  (5)
> ?- max_val(M).
1 rows:
  (30)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_min_max_n14t31
Knowledge graph 'test_min_max_n14t31' dropped.
