Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_avg_frac_n14t33
Knowledge graph 'test_avg_frac_n14t33' created.
Switched to knowledge graph: test_avg_frac_n14t33
> .kg use test_avg_frac_n14t33
Switched to knowledge graph: test_avg_frac_n14t33
> +vals[(1,), (2,), (3,), (4,)]
Inserted 4 fact(s) into 'vals'.
> +avg_result(avg<X>) <- vals(X)
Rule 'avg_result' registered.
> ?avg_result(R)
┌─────┐
│ R   │
├─────┤
│ 2.5 │
└─────┘
1 rows
> +vals2[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'vals2'.
> +avg_result2(avg<X>) <- vals2(X)
Rule 'avg_result2' registered.
> ?avg_result2(R)
┌─────┐
│ R   │
├─────┤
│ 2.0 │
└─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_avg_frac_n14t33
Knowledge graph 'test_avg_frac_n14t33' dropped.
