Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_count_join_n14t37
Knowledge graph 'test_count_join_n14t37' created.
Switched to knowledge graph: test_count_join_n14t37
> .kg use test_count_join_n14t37
Switched to knowledge graph: test_count_join_n14t37
> +orders[(1, "Alice"), (2, "Bob"), (3, "Alice"), (4, "Carol")].
Inserted 4 fact(s) into 'orders'.
> +vip[("Alice",), ("Bob",)].
Inserted 2 fact(s) into 'vip'.
> vip_order_count(count<OId>) :- orders(OId, Name), vip(Name).
1 rows:
  (3)
(session: 1 rule(s))
> ?- vip_order_count(N).
1 rows:
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_count_join_n14t37
Knowledge graph 'test_count_join_n14t37' dropped.
