Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_agg_n14t40
Knowledge graph 'test_multi_agg_n14t40' created.
Switched to knowledge graph: test_multi_agg_n14t40
> .kg use test_multi_agg_n14t40
Switched to knowledge graph: test_multi_agg_n14t40
> +sales[("A", 100), ("A", 200), ("A", 150), ("B", 300), ("B", 100)].
Inserted 5 fact(s) into 'sales'.
> sum_by_cat(Cat, sum<Val>) :- sales(Cat, Val).
2 rows:
  ("A", 450)
  ("B", 400)
(session: 1 rule(s))
> count_by_cat(Cat, count<Val>) :- sales(Cat, Val).
2 rows:
  ("A", 3)
  ("B", 2)
(session: 2 rule(s))
> avg_by_cat(Cat, avg<Val>) :- sales(Cat, Val).
2 rows:
  ("A", 150.0)
  ("B", 200.0)
(session: 3 rule(s))
> ?- sum_by_cat(Cat, S).
2 rows:
  ("A", 450)
  ("B", 400)
> ?- count_by_cat(Cat, N).
2 rows:
  ("A", 3)
  ("B", 2)
> ?- avg_by_cat(Cat, A).
2 rows:
  ("A", 150.0)
  ("B", 200.0)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_multi_agg_n14t40
Knowledge graph 'test_multi_agg_n14t40' dropped.
