Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_group_n14t42
Knowledge graph 'test_multi_group_n14t42' created.
Switched to knowledge graph: test_multi_group_n14t42
> .kg use test_multi_group_n14t42
Switched to knowledge graph: test_multi_group_n14t42
> +orders[(1, "Alice", "Widget", 100), (2, "Alice", "Gadget", 150), (3, "Bob", "Widget", 200)]
Inserted 3 fact(s) into 'orders'.
> +by_cust_prod(Cust, Prod, sum<Amt>) <- orders(_, Cust, Prod, Amt)
Rule 'by_cust_prod' registered.
> +by_cust(Cust, sum<Amt>) <- orders(_, Cust, _, Amt)
Rule 'by_cust' registered.
> ?by_cust_prod(Cust, Prod, Sum)
┌─────────┬──────────┬─────┐
│ Cust    │ Prod     │ Sum │
├─────────┼──────────┼─────┤
│ "Alice" │ "Gadget" │ 150 │
│ "Alice" │ "Widget" │ 100 │
│ "Bob"   │ "Widget" │ 200 │
└─────────┴──────────┴─────┘
3 rows
> ?by_cust(Cust, Sum)
┌─────────┬─────┐
│ Cust    │ Sum │
├─────────┼─────┤
│ "Alice" │ 250 │
│ "Bob"   │ 200 │
└─────────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_group_n14t42
Knowledge graph 'test_multi_group_n14t42' dropped.
