Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_var_n14t44
Knowledge graph 'test_var_n14t44' created.
Switched to knowledge graph: test_var_n14t44
> .kg use test_var_n14t44
Switched to knowledge graph: test_var_n14t44
> +vals[(10,), (20,), (30,)]
Inserted 3 fact(s) into 'vals'.
> +total(sum<V>) <- vals(V)
Rule 'total' registered.
> +sum_sq(sum<Sq>) <- vals(V), Sq = V * V
Rule 'sum_sq' registered.
> +n(count<V>) <- vals(V)
Rule 'n' registered.
> ?total(S)
┌────┐
│ S  │
├────┤
│ 60 │
└────┘
1 rows
> ?sum_sq(Sq)
┌──────┐
│ Sq   │
├──────┤
│ 1400 │
└──────┘
1 rows
> ?n(N)
┌───┐
│ N │
├───┤
│ 3 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_var_n14t44
Knowledge graph 'test_var_n14t44' dropped.
