Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_topk_basic_n14t45
Knowledge graph 'test_topk_basic_n14t45' created.
Switched to knowledge graph: test_topk_basic_n14t45
> .kg use test_topk_basic_n14t45
Switched to knowledge graph: test_topk_basic_n14t45
> +scores[("Alice", 95), ("Bob", 87), ("Carol", 92), ("Dave", 78), ("Eve", 99)]
Inserted 5 fact(s) into 'scores'.
> top_three(top_k<3, Name, Score:desc>) <- scores(Name, Score)
┌─────────┬────┐
│ X       │ Y  │
├─────────┼────┤
│ "Alice" │ 95 │
│ "Carol" │ 92 │
│ "Eve"   │ 99 │
└─────────┴────┘
3 rows
(session: 1 rule(s))
> ?top_three(Name, Score)
┌─────────┬───────┐
│ Name    │ Score │
├─────────┼───────┤
│ "Alice" │    95 │
│ "Carol" │    92 │
│ "Eve"   │    99 │
└─────────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_topk_basic_n14t45
Knowledge graph 'test_topk_basic_n14t45' dropped.
