Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_cd_multi_n14t46
Knowledge graph 'test_cd_multi_n14t46' created.
Switched to knowledge graph: test_cd_multi_n14t46
> .kg use test_cd_multi_n14t46
Switched to knowledge graph: test_cd_multi_n14t46
> +purchases[("Alice", "Electronics", 1), ("Alice", "Electronics", 2), ("Alice", "Clothing", 1), ("Bob", "Electronics", 1), ("Bob", "Electronics", 1)]
Inserted 4 fact(s) into 'purchases'.
> distinct_products(Cust, <COUNT_DISTINCT:Cat>) <- purchases(Cust, Cat, _)
Parse error: Unknown aggregate function: 
> ?distinct_products(Cust, N)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cd_multi_n14t46
Knowledge graph 'test_cd_multi_n14t46' dropped.
