Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cd_multi_n14t46
Knowledge graph 'test_cd_multi_n14t46' created.
Switched to knowledge graph: test_cd_multi_n14t46
> .kg use test_cd_multi_n14t46
Switched to knowledge graph: test_cd_multi_n14t46
> +purchases[("Alice", "Electronics", 1), ("Alice", "Electronics", 2), ("Alice", "Clothing", 1), ("Bob", "Electronics", 1), ("Bob", "Electronics", 1)].
Inserted 4 fact(s) into 'purchases'.
> distinct_products(Cust, <COUNT_DISTINCT:Cat>) :- purchases(Cust, Cat, _).
2 rows:
  ("Alice", 2)
  ("Bob", 1)
(session: 1 rule(s))
> ?- distinct_products(Cust, N).
2 rows:
  ("Alice", 2)
  ("Bob", 1)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cd_multi_n14t46
Knowledge graph 'test_cd_multi_n14t46' dropped.
