Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cd_global_n14t56
Knowledge graph 'test_cd_global_n14t56' created.
Switched to knowledge graph: test_cd_global_n14t56
> .kg use test_cd_global_n14t56
Switched to knowledge graph: test_cd_global_n14t56
> +events[("click",), ("view",), ("click",), ("purchase",), ("view",), ("click",)].
Inserted 3 fact(s) into 'events'.
> unique_events(<COUNT_DISTINCT:E>) :- events(E).
1 rows:
  (3)
(session: 1 rule(s))
> ?- unique_events(N).
1 rows:
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cd_global_n14t56
Knowledge graph 'test_cd_global_n14t56' dropped.
