Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_topk_grp_n14t57
Knowledge graph 'test_topk_grp_n14t57' created.
Switched to knowledge graph: test_topk_grp_n14t57
> .kg use test_topk_grp_n14t57
Switched to knowledge graph: test_topk_grp_n14t57
> +scores[("Math", "Alice", 95), ("Math", "Bob", 87), ("Math", "Carol", 92), ("Science", "Dave", 88), ("Science", "Eve", 91), ("Science", "Frank", 85)].
Inserted 6 fact(s) into 'scores'.
> top2_by_subject(Subj, Name, top_k<2, Score, desc>) :- scores(Subj, Name, Score).
2 rows:
  ("Math", "Alice", 95)
  ("Math", "Carol", 92)
(session: 1 rule(s))
> ?- top2_by_subject(Subj, Name, Score).
2 rows:
  ("Math", "Alice", 95)
  ("Math", "Carol", 92)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_topk_grp_n14t57
Knowledge graph 'test_topk_grp_n14t57' dropped.
