Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_nested_grp_n14t60
Knowledge graph 'test_nested_grp_n14t60' created.
Switched to knowledge graph: test_nested_grp_n14t60
> .kg use test_nested_grp_n14t60
Switched to knowledge graph: test_nested_grp_n14t60
> +sales[("2024", "Q1", "A", 100), ("2024", "Q1", "B", 150), ("2024", "Q2", "A", 200), ("2025", "Q1", "A", 300)]
Inserted 4 fact(s) into 'sales'.
> sum_by_all(Year, Qtr, Cat, sum<Val>) <- sales(Year, Qtr, Cat, Val)
┌────────┬──────┬─────┬─────┐
│ X      │ Y    │ Z   │ W   │
├────────┼──────┼─────┼─────┤
│ "2024" │ "Q1" │ "A" │ 100 │
│ "2024" │ "Q1" │ "B" │ 150 │
│ "2024" │ "Q2" │ "A" │ 200 │
│ "2025" │ "Q1" │ "A" │ 300 │
└────────┴──────┴─────┴─────┘
4 rows
(session: 1 rule(s))
> ?sum_by_all(Year, Qtr, Cat, Total)
┌────────┬──────┬─────┬───────┐
│ Year   │ Qtr  │ Cat │ Total │
├────────┼──────┼─────┼───────┤
│ "2024" │ "Q1" │ "A" │   100 │
│ "2024" │ "Q1" │ "B" │   150 │
│ "2024" │ "Q2" │ "A" │   200 │
│ "2025" │ "Q1" │ "A" │   300 │
└────────┴──────┴─────┴───────┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_nested_grp_n14t60
Knowledge graph 'test_nested_grp_n14t60' dropped.
