Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_weighted_avg_n14t65
Knowledge graph 'test_weighted_avg_n14t65' created.
Switched to knowledge graph: test_weighted_avg_n14t65
> .kg use test_weighted_avg_n14t65
Switched to knowledge graph: test_weighted_avg_n14t65
> +scores[(1, 90, 3), (2, 80, 2), (3, 70, 1)]
Inserted 3 fact(s) into 'scores'.
> weighted_sum(sum<WS>) <- scores(_, S, W), WS = S * W
┌─────┐
│ X   │
├─────┤
│ 500 │
└─────┘
1 rows
(session: 1 rule(s))
> total_weight(sum<W>) <- scores(_, _, W)
┌───┐
│ X │
├───┤
│ 6 │
└───┘
1 rows
(session: 2 rule(s))
> ?weighted_sum(WS)
┌─────┐
│ WS  │
├─────┤
│ 500 │
└─────┘
1 rows
> ?total_weight(TW)
┌────┐
│ TW │
├────┤
│  6 │
└────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_weighted_avg_n14t65
Knowledge graph 'test_weighted_avg_n14t65' dropped.
