Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_count_dist_grp_n14t70
Knowledge graph 'test_count_dist_grp_n14t70' created.
Switched to knowledge graph: test_count_dist_grp_n14t70
> .kg use test_count_dist_grp_n14t70
Switched to knowledge graph: test_count_dist_grp_n14t70
> +visits[(1, "Alice", "homepage"), (2, "Bob", "homepage"), (3, "Alice", "products"), (4, "Alice", "homepage"), (5, "Bob", "checkout")].
Inserted 5 fact(s) into 'visits'.
> +pages_per_user(User, <COUNT_DISTINCT:Page>) :- visits(_, User, Page).
Rule 'pages_per_user' registered.
> ?- pages_per_user(U, C).
2 rows:
  ("Alice", 2)
  ("Bob", 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_count_dist_grp_n14t70
Knowledge graph 'test_count_dist_grp_n14t70' dropped.
