Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_topk_ties_n14t91
Knowledge graph 'test_topk_ties_n14t91' created.
Switched to knowledge graph: test_topk_ties_n14t91
> .kg use test_topk_ties_n14t91
Switched to knowledge graph: test_topk_ties_n14t91
> +scores[(1, 100), (2, 100), (3, 90), (4, 90), (5, 80)].
Inserted 5 fact(s) into 'scores'.
> top2(top_k<2, Id, Score:desc>) :- scores(Id, Score).
2 rows:
  (1, 100)
  (2, 100)
(session: 1 rule(s))
> ?- top2(Id, Score).
2 rows:
  (1, 100)
  (2, 100)
> top3(top_k<3, Id, Score:desc>) :- scores(Id, Score).
3 rows:
  (1, 100)
  (2, 100)
  (3, 90)
(session: 2 rule(s))
> ?- top3(Id, Score).
3 rows:
  (1, 100)
  (2, 100)
  (3, 90)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_topk_ties_n14t91
Knowledge graph 'test_topk_ties_n14t91' dropped.
