Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_topk_ties_n14t91
Knowledge graph 'test_topk_ties_n14t91' created.
Switched to knowledge graph: test_topk_ties_n14t91
> .kg use test_topk_ties_n14t91
Switched to knowledge graph: test_topk_ties_n14t91
> +scores[(1, 100), (2, 100), (3, 90), (4, 90), (5, 80)]
Inserted 5 fact(s) into 'scores'.
> top2(top_k<2, Id, Score:desc>) <- scores(Id, Score)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 100 │
│ 2 │ 100 │
└───┴─────┘
2 rows
(session: 1 rule(s))
> ?top2(Id, Score)
┌────┬───────┐
│ Id │ Score │
├────┼───────┤
│  1 │   100 │
│  2 │   100 │
└────┴───────┘
2 rows
> top3(top_k<3, Id, Score:desc>) <- scores(Id, Score)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 100 │
│ 2 │ 100 │
│ 3 │  90 │
└───┴─────┘
3 rows
(session: 2 rule(s))
> ?top3(Id, Score)
┌────┬───────┐
│ Id │ Score │
├────┼───────┤
│  1 │   100 │
│  2 │   100 │
│  3 │    90 │
└────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_topk_ties_n14t91
Knowledge graph 'test_topk_ties_n14t91' dropped.
