Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_nested_group_n14t92
Knowledge graph 'test_nested_group_n14t92' created.
Switched to knowledge graph: test_nested_group_n14t92
> .kg use test_nested_group_n14t92
Switched to knowledge graph: test_nested_group_n14t92
> +sales[("North", "Widget", 100), ("North", "Widget", 150), ("North", "Gadget", 200), ("South", "Widget", 300), ("South", "Gadget", 250)].
Inserted 5 fact(s) into 'sales'.
> +region_product_sum(Region, Product, sum<Amount>) :- sales(Region, Product, Amount).
Rule 'region_product_sum' registered.
> ?- region_product_sum(Region, Product, Sum).
4 rows:
  ("North", "Gadget", 200)
  ("North", "Widget", 250)
  ("South", "Gadget", 250)
  ("South", "Widget", 300)
> +region_max(Region, max<Total>) :- region_product_sum(Region, _, Total).
Rule 'region_max' registered.
> ?- region_max(Region, MaxProduct).
2 rows:
  ("North", 250)
  ("South", 300)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_nested_group_n14t92
Knowledge graph 'test_nested_group_n14t92' dropped.
