Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sum_neg_n14t95
Knowledge graph 'test_sum_neg_n14t95' created.
Switched to knowledge graph: test_sum_neg_n14t95
> .kg use test_sum_neg_n14t95
Switched to knowledge graph: test_sum_neg_n14t95
> +amounts[(100,), (-50,), (200,), (-75,), (25,)].
Inserted 5 fact(s) into 'amounts'.
> total(sum<X>) :- amounts(X).
1 rows:
  (200)
(session: 1 rule(s))
> ?- total(T).
1 rows:
  (200)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_sum_neg_n14t95
Knowledge graph 'test_sum_neg_n14t95' dropped.
