Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sip_basic_n80t01
Knowledge graph 'test_sip_basic_n80t01' created.
Switched to knowledge graph: test_sip_basic_n80t01
> .kg use test_sip_basic_n80t01
Switched to knowledge graph: test_sip_basic_n80t01
> +user[(1, "alice"), (2, "bob"), (3, "charlie")]
Inserted 3 fact(s) into 'user'.
> +order[(101, 1, 100), (102, 1, 200), (103, 2, 150), (104, 5, 300)]
Inserted 4 fact(s) into 'order'.
> ?user(UserId, Name), order(OrderId, UserId, Amount)
┌────────┬─────────┬─────────┬────────┐
│ UserId │ Name    │ OrderId │ Amount │
├────────┼─────────┼─────────┼────────┤
│      1 │ "alice" │     101 │    100 │
│      1 │ "alice" │     102 │    200 │
│      2 │ "bob"   │     103 │    150 │
└────────┴─────────┴─────────┴────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sip_basic_n80t01
Knowledge graph 'test_sip_basic_n80t01' dropped.
