Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_sip_recursive_n80t02
Knowledge graph 'test_sip_recursive_n80t02' created.
Switched to knowledge graph: test_sip_recursive_n80t02
> .kg use test_sip_recursive_n80t02
Switched to knowledge graph: test_sip_recursive_n80t02
> +edge[(1, 2), (2, 3), (3, 4), (4, 5)]
Inserted 4 fact(s) into 'edge'.
> +reach(X, Y) <- edge(X, Y)
Rule 'reach' registered.
> +reach(X, Z) <- edge(X, Y), reach(Y, Z)
Rule 'reach' registered.
> ?reach(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 2 │ 5 │
│ 3 │ 4 │
│ 3 │ 5 │
│ 4 │ 5 │
└───┴───┘
10 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sip_recursive_n80t02
Knowledge graph 'test_sip_recursive_n80t02' dropped.
