Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_sip_empty_n80t04
Knowledge graph 'test_sip_empty_n80t04' created.
Switched to knowledge graph: test_sip_empty_n80t04
> .kg use test_sip_empty_n80t04
Switched to knowledge graph: test_sip_empty_n80t04
> +user[(1, "alice"), (2, "bob")]
Inserted 2 fact(s) into 'user'.
> ?user(UserId, Name), order(OrderId, UserId)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sip_empty_n80t04
Knowledge graph 'test_sip_empty_n80t04' dropped.
