Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_sip_string_n80t05
Knowledge graph 'test_sip_string_n80t05' created.
Switched to knowledge graph: test_sip_string_n80t05
> .kg use test_sip_string_n80t05
Switched to knowledge graph: test_sip_string_n80t05
> +author[("alice", 2020), ("bob", 2021), ("carol", 2019)]
Inserted 3 fact(s) into 'author'.
> +paper[("p1", "alice", "ML"), ("p2", "bob", "DB"), ("p3", "alice", "AI")]
Inserted 3 fact(s) into 'paper'.
> ?author("alice", Year), paper(PaperId, "alice", Topic)
┌─────────┬──────┬─────────┬───────┐
│ alice   │ Year │ PaperId │ Topic │
├─────────┼──────┼─────────┼───────┤
│ "alice" │ 2020 │ "p1"    │ "ML"  │
│ "alice" │ 2020 │ "p3"    │ "AI"  │
└─────────┴──────┴─────────┴───────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sip_string_n80t05
Knowledge graph 'test_sip_string_n80t05' dropped.
