Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_status
Knowledge graph 'test_status' created.
Switched to knowledge graph: test_status
> .kg use test_status
Switched to knowledge graph: test_status
> +data[(1, "a"), (2, "b"), (3, "c")].
Inserted 3 fact(s) into 'data'.
> ?- data(Id, Val).
3 rows:
  (1, "a")
  (2, "b")
  (3, "c")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_status
Knowledge graph 'test_status' dropped.
