Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_status_n39t01
Knowledge graph 'test_status_n39t01' created.
Switched to knowledge graph: test_status_n39t01
> .kg use test_status_n39t01
Switched to knowledge graph: test_status_n39t01
> +data[(1, "a"), (2, "b"), (3, "c")]
Inserted 3 fact(s) into 'data'.
> ?data(Id, Val)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │ "a"  │
│    2 │ "b"  │
│    3 │ "c"  │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_status_n39t01
Knowledge graph 'test_status_n39t01' dropped.
