Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rel_ops_n39t04
Knowledge graph 'test_rel_ops_n39t04' created.
Switched to knowledge graph: test_rel_ops_n39t04
> .kg use test_rel_ops_n39t04
Switched to knowledge graph: test_rel_ops_n39t04
> +users[("alice", 25), ("bob", 30), ("carol", 28)]
Inserted 3 fact(s) into 'users'.
> +products[(1, "Widget", 9.99), (2, "Gadget", 19.99)]
Inserted 2 fact(s) into 'products'.
> +orders[(1, "alice", 1, 2), (2, "bob", 2, 1)]
Inserted 2 fact(s) into 'orders'.
> .rel
Relations:
  orders (arity: 4, columns: [col0: any, col1: any, col2: any, col3: any], tuples: 2)
  products (arity: 3, columns: [col0: any, col1: any, col2: any], tuples: 2)
  users (arity: 2, columns: [col0: any, col1: any], tuples: 3)
> .rel users
Relation: users
┌─────────┬────┐
│ A       │ B  │
├─────────┼────┤
│ "alice" │ 25 │
│ "bob"   │ 30 │
│ "carol" │ 28 │
└─────────┴────┘
3 of 3 total rows
> .rel products
Relation: products
┌───┬──────────┬───────┐
│ A │ B        │ C     │
├───┼──────────┼───────┤
│ 1 │ "Widget" │  9.99 │
│ 2 │ "Gadget" │ 19.99 │
└───┴──────────┴───────┘
2 of 2 total rows
> .rel orders
Relation: orders
┌───┬─────────┬───┬───┐
│ A │ B       │ C │ D │
├───┼─────────┼───┼───┤
│ 1 │ "alice" │ 1 │ 2 │
│ 2 │ "bob"   │ 2 │ 1 │
└───┴─────────┴───┴───┘
2 of 2 total rows
> ?users(Name, Age)
┌─────────┬─────┐
│ Name    │ Age │
├─────────┼─────┤
│ "alice" │  25 │
│ "bob"   │  30 │
│ "carol" │  28 │
└─────────┴─────┘
3 rows
> ?products(Id, Name, Price)
┌────┬──────────┬───────┐
│ Id │ Name     │ Price │
├────┼──────────┼───────┤
│  1 │ "Widget" │  9.99 │
│  2 │ "Gadget" │ 19.99 │
└────┴──────────┴───────┘
2 rows
> +categories[(1, "Electronics"), (2, "Home")]
Inserted 2 fact(s) into 'categories'.
> .rel
Relations:
  categories (arity: 2, columns: [col0: any, col1: any], tuples: 2)
  orders (arity: 4, columns: [col0: any, col1: any, col2: any, col3: any], tuples: 2)
  products (arity: 3, columns: [col0: any, col1: any, col2: any], tuples: 2)
  users (arity: 2, columns: [col0: any, col1: any], tuples: 3)
> .rel categories
Relation: categories
┌───┬───────────────┐
│ A │ B             │
├───┼───────────────┤
│ 1 │ "Electronics" │
│ 2 │ "Home"        │
└───┴───────────────┘
2 of 2 total rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_ops_n39t04
Knowledge graph 'test_rel_ops_n39t04' dropped.
