Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_ops_n39t04
Knowledge graph 'test_rel_ops_n39t04' created.
Switched to knowledge graph: test_rel_ops_n39t04
> .kg use test_rel_ops_n39t04
Switched to knowledge graph: test_rel_ops_n39t04
> +users[("alice", 25), ("bob", 30), ("carol", 28)]
Inserted 3 fact(s) into 'users'.
> +products[(1, "Widget", 9.99), (2, "Gadget", 19.99)]
Inserted 2 fact(s) into 'products'.
> +orders[(1, "alice", 1, 2), (2, "bob", 2, 1)]
Inserted 2 fact(s) into 'orders'.
> .rel
Relations:
  orders (arity: 4)
  products (arity: 3)
  users (arity: 2)
> .rel users
Relation: users
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "alice" │   25 │
│ "bob"   │   30 │
│ "carol" │   28 │
└─────────┴──────┘
3 of 3 total rows
> .rel products
Relation: products
┌──────┬──────────┬───────┐
│ col0 │ col1     │ col2  │
├──────┼──────────┼───────┤
│    1 │ "Widget" │  9.99 │
│    2 │ "Gadget" │ 19.99 │
└──────┴──────────┴───────┘
2 of 2 total rows
> .rel orders
Relation: orders
┌──────┬─────────┬──────┬──────┐
│ col0 │ col1    │ col2 │ col3 │
├──────┼─────────┼──────┼──────┤
│    1 │ "alice" │    1 │    2 │
│    2 │ "bob"   │    2 │    1 │
└──────┴─────────┴──────┴──────┘
2 of 2 total rows
> ?users(Name, Age)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "alice" │   25 │
│ "bob"   │   30 │
│ "carol" │   28 │
└─────────┴──────┘
3 rows
> ?products(Id, Name, Price)
┌──────┬──────────┬───────┐
│ col0 │ col1     │ col2  │
├──────┼──────────┼───────┤
│    1 │ "Widget" │  9.99 │
│    2 │ "Gadget" │ 19.99 │
└──────┴──────────┴───────┘
2 rows
> +categories[(1, "Electronics"), (2, "Home")]
Inserted 2 fact(s) into 'categories'.
> .rel
Relations:
  categories (arity: 2)
  orders (arity: 4)
  products (arity: 3)
  users (arity: 2)
> .rel categories
Relation: categories
┌──────┬───────────────┐
│ col0 │ col1          │
├──────┼───────────────┤
│    1 │ "Electronics" │
│    2 │ "Home"        │
└──────┴───────────────┘
2 of 2 total rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_ops_n39t04
Knowledge graph 'test_rel_ops_n39t04' dropped.
