Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_session_n39t05
Knowledge graph 'test_session_n39t05' created.
Switched to knowledge graph: test_session_n39t05
> .kg use test_session_n39t05
Switched to knowledge graph: test_session_n39t05
> +base_data[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'base_data'.
> .session
No session data defined.
> temp_data(10)
Session fact added for 'temp_data'. (Use +temp_data(...) to persist)
> temp_data(20)
Session fact added for 'temp_data'. (Use +temp_data(...) to persist)
> temp_data(30)
Session fact added for 'temp_data'. (Use +temp_data(...) to persist)
> .session
Session facts (3):
  1. temp_data(10)
  2. temp_data(20)
  3. temp_data(30)
> ?temp_data(X)
┌──────┐
│ col0 │
├──────┤
│   10 │
│   20 │
│   30 │
└──────┘
3 rows
