Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg list
Knowledge Graphs:
  default *
> .kg create kg_alpha
Knowledge graph 'kg_alpha' created.
Switched to knowledge graph: kg_alpha
> .kg create kg_beta
Knowledge graph 'kg_beta' created.
Switched to knowledge graph: kg_beta
> .kg create kg_gamma
Knowledge graph 'kg_gamma' created.
Switched to knowledge graph: kg_gamma
> .kg list
Knowledge Graphs:
  default
  kg_alpha
  kg_beta
  kg_gamma *
> .kg use kg_alpha
Switched to knowledge graph: kg_alpha
> +alpha_data[(1, "first"), (2, "second")].
Inserted 2 fact(s) into 'alpha_data'.
> ?- alpha_data(Id, Val).
2 rows:
  (1, "first")
  (2, "second")
> .kg use kg_beta
Switched to knowledge graph: kg_beta
> +beta_data[(10, 20), (30, 40)].
Inserted 2 fact(s) into 'beta_data'.
> .kg
Current knowledge graph: kg_beta
> .kg use kg_gamma
Switched to knowledge graph: kg_gamma
> +gamma_data[("x",), ("y",), ("z",)].
Inserted 3 fact(s) into 'gamma_data'.
> .kg list
Knowledge Graphs:
  default
  kg_alpha
  kg_beta
  kg_gamma *
> .kg use kg_alpha
Switched to knowledge graph: kg_alpha
> ?- alpha_data(Id, Val).
2 rows:
  (1, "first")
  (2, "second")
> ?- beta_data(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop kg_alpha
Knowledge graph 'kg_alpha' dropped.
> .kg drop kg_beta
Knowledge graph 'kg_beta' dropped.
> .kg drop kg_gamma
Knowledge graph 'kg_gamma' dropped.
> .kg list
Knowledge Graphs:
  default *
