Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_eq
Knowledge graph 'test_eq' created.
Switched to knowledge graph: test_eq
> .kg use test_eq
Switched to knowledge graph: test_eq
> +edge[(1,1), (1,2), (2,2), (2,3), (3,3)].
Inserted 5 fact(s) into 'edge'.
> +self_loop(X, Y) :- edge(X, Y), X = Y.
Rule 'self_loop' registered.
> ?- self_loop(X, Y).
3 rows:
  (1, 1)
  (2, 2)
  (3, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_eq
Knowledge graph 'test_eq' dropped.
