
> .db create test_eq
Database 'test_eq' created.
Switched to database: test_eq
> .db use test_eq
Switched to database: test_eq
> +edge[(1,1), (1,2), (2,2), (2,3), (3,3)].
Inserted 5 facts into 'edge'.
> self_loop(X, Y) := edge(X, Y), X = Y.
View 'self_loop' registered.
> ?- self_loop(X, Y).
3 rows:
  (1, 1)
  (2, 2)
  (3, 3)
> .db use default
Switched to database: default
> .db drop test_eq
Database 'test_eq' dropped.
