Executing script: examples/datalog/07_filters/03_comparisons.dl

> .db create test_cmp
Database 'test_cmp' created.
Switched to database: test_cmp
> .db use test_cmp
Switched to database: test_cmp
> +data[(1, 100), (3, 101), (5, 102), (7, 103), (9, 104)].
Inserted 5 facts into 'data'.
> +lt_five(X, Y) :- data(X, Y), X < 5.
Rule 'lt_five' registered.
> ?- lt_five(X, Y).
2 rows:
  (1, 100)
  (3, 101)
> +gt_five(X, Y) :- data(X, Y), X > 5.
Rule 'gt_five' registered.
> ?- gt_five(X, Y).
2 rows:
  (7, 103)
  (9, 104)
> +le_five(X, Y) :- data(X, Y), X <= 5.
Rule 'le_five' registered.
> ?- le_five(X, Y).
3 rows:
  (1, 100)
  (3, 101)
  (5, 102)
> +ge_five(X, Y) :- data(X, Y), X >= 5.
Rule 'ge_five' registered.
> ?- ge_five(X, Y).
3 rows:
  (5, 102)
  (7, 103)
  (9, 104)
> .db use default
Switched to database: default
> .db drop test_cmp
Database 'test_cmp' dropped.
