Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_combined_filters
Knowledge graph 'test_combined_filters' created.
Switched to knowledge graph: test_combined_filters
> .kg use test_combined_filters
Switched to knowledge graph: test_combined_filters
> +data[(1, 10), (2, 20), (3, 30), (4, 40), (5, 50), (6, 15), (7, 25), (8, 35), (9, 45), (10, 55)].
Inserted 10 fact(s) into 'data'.
> +filtered1(X, Y) :- data(X, Y), X > 3, Y < 50.
Rule 'filtered1' registered.
> ?- filtered1(X, Y).
5 rows:
  (4, 40)
  (6, 15)
  (7, 25)
  (8, 35)
  (9, 45)
> +filtered2(X, Y) :- data(X, Y), Y >= 20, Y <= 40.
Rule 'filtered2' registered.
> ?- filtered2(X, Y).
5 rows:
  (2, 20)
  (3, 30)
  (4, 40)
  (7, 25)
  (8, 35)
> +different(X, Y) :- data(X, Y), X != Y.
Rule 'different' registered.
> ?- different(X, Y).
10 rows:
  (1, 10)
  (2, 20)
  (3, 30)
  (4, 40)
  (5, 50)
  (6, 15)
  (7, 25)
  (8, 35)
  (9, 45)
  (10, 55)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_combined_filters
Knowledge graph 'test_combined_filters' dropped.
