Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neq_str
Knowledge graph 'test_neq_str' created.
Switched to knowledge graph: test_neq_str
> .kg use test_neq_str
Switched to knowledge graph: test_neq_str
> +names[("Alice",), ("Bob",), ("Carol",), ("Alice",)].
Inserted 3 fact(s) into 'names'.
> not_alice(Name) :- names(Name), Name != "Alice".
2 rows:
  ("Bob")
  ("Carol")
(session: 1 rule(s))
> ?- not_alice(Name).
2 rows:
  ("Bob")
  ("Carol")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_neq_str
Knowledge graph 'test_neq_str' dropped.
