Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_range
Knowledge graph 'test_range' created.
Switched to knowledge graph: test_range
> .kg use test_range
Switched to knowledge graph: test_range
> +values[(5,), (10,), (15,), (20,), (25,), (30,)].
Inserted 6 fact(s) into 'values'.
> in_range(X) :- values(X), X >= 10, X <= 25.
4 rows:
  (10)
  (15)
  (20)
  (25)
(session: 1 rule(s))
> ?- in_range(X).
4 rows:
  (10)
  (15)
  (20)
  (25)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_range
Knowledge graph 'test_range' dropped.
