Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_filter_wild
Knowledge graph 'test_filter_wild' created.
Switched to knowledge graph: test_filter_wild
> .kg use test_filter_wild
Switched to knowledge graph: test_filter_wild
> +records[(1, "alice", 100), (2, "bob", 200), (3, "carol", 150), (4, "dave", 100)].
Inserted 4 fact(s) into 'records'.
> ?- records(Id, _, Value), Value > 120.
2 rows:
  (2, "bob", 200)
  (3, "carol", 150)
> ?- records(Id, _, Value), Id < 3.
2 rows:
  (1, "alice", 100)
  (2, "bob", 200)
> ?- records(_, _, Value), Value = 100.
2 rows:
  (1, "alice", 100)
  (4, "dave", 100)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_filter_wild
Knowledge graph 'test_filter_wild' dropped.
