Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_range
Knowledge graph 'test_range' created.
Switched to knowledge graph: test_range
> .kg use test_range
Switched to knowledge graph: test_range
> +scores[(1, 45), (2, 67), (3, 82), (4, 91), (5, 55), (6, 73)].
Inserted 6 fact(s) into 'scores'.
> in_range(Id, Score) :- scores(Id, Score), Score >= 60, Score <= 80.
2 rows:
  (2, 67)
  (6, 73)
(session: 1 rule(s))
> ?- in_range(Id, Score).
2 rows:
  (2, 67)
  (6, 73)
> below(Id, Score) :- scores(Id, Score), Score < 60.
2 rows:
  (1, 45)
  (5, 55)
(session: 2 rule(s))
> ?- below(Id, Score).
2 rows:
  (1, 45)
  (5, 55)
> above(Id, Score) :- scores(Id, Score), Score > 80.
2 rows:
  (3, 82)
  (4, 91)
(session: 3 rule(s))
> ?- above(Id, Score).
2 rows:
  (3, 82)
  (4, 91)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_range
Knowledge graph 'test_range' dropped.
