Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_chain_filt_n07t08
Knowledge graph 'test_chain_filt_n07t08' created.
Switched to knowledge graph: test_chain_filt_n07t08
> .kg use test_chain_filt_n07t08
Switched to knowledge graph: test_chain_filt_n07t08
> +data[(1, 10, "active"), (2, 20, "inactive"), (3, 30, "active"), (4, 5, "active"), (5, 25, "inactive")].
Inserted 5 fact(s) into 'data'.
> filtered(Id, Val, Status) :- data(Id, Val, Status), Status = "active", Val > 5, Id != 4.
2 rows:
  (1, 10, "active")
  (3, 30, "active")
(session: 1 rule(s))
> ?- filtered(Id, Val, Status).
2 rows:
  (1, 10, "active")
  (3, 30, "active")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_chain_filt_n07t08
Knowledge graph 'test_chain_filt_n07t08' dropped.
