Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_between_n07t10
Knowledge graph 'test_between_n07t10' created.
Switched to knowledge graph: test_between_n07t10
> .kg use test_between_n07t10
Switched to knowledge graph: test_between_n07t10
> +data[(1, 5), (2, 15), (3, 25), (4, 35), (5, 45), (6, 55)]
Inserted 6 fact(s) into 'data'.
> between_10_40(Id, Val) <- data(Id, Val), Val >= 10, Val <= 40
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 2 │ 15 │
│ 3 │ 25 │
│ 4 │ 35 │
└───┴────┘
3 rows
(session: 1 rule(s))
> ?between_10_40(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  2 │  15 │
│  3 │  25 │
│  4 │  35 │
└────┴─────┘
3 rows
> outside_range(Id, Val) <- data(Id, Val), Val < 10
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 5 │
└───┴───┘
1 rows
(session: 2 rule(s))
> outside_range(Id, Val) <- data(Id, Val), Val > 40
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │  5 │
│ 5 │ 45 │
│ 6 │ 55 │
└───┴────┘
3 rows
(session: 3 rule(s))
> ?outside_range(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │   5 │
│  5 │  45 │
│  6 │  55 │
└────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_between_n07t10
Knowledge graph 'test_between_n07t10' dropped.
