Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_num_range
Knowledge graph 'test_num_range' created.
Switched to knowledge graph: test_num_range
> .kg use test_num_range
Switched to knowledge graph: test_num_range
> +data[(1, 10), (2, 25), (3, 50), (4, 75), (5, 100)].
Inserted 5 fact(s) into 'data'.
> in_range(Id, Val) :- data(Id, Val), Val >= 20, Val <= 80.
3 rows:
  (2, 25)
  (3, 50)
  (4, 75)
(session: 1 rule(s))
> ?- in_range(Id, Val).
3 rows:
  (2, 25)
  (3, 50)
  (4, 75)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_num_range
Knowledge graph 'test_num_range' dropped.
