Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_complex_filt
Knowledge graph 'test_complex_filt' created.
Switched to knowledge graph: test_complex_filt
> .kg use test_complex_filt
Switched to knowledge graph: test_complex_filt
> +data[(1, 100, "active"), (2, 50, "inactive"), (3, 200, "active"), (4, 75, "active"), (5, 150, "inactive")].
Inserted 5 fact(s) into 'data'.
> complex(Id, Val, Status) :- data(Id, Val, Status), Status = "active", Val > 60, Id < 5.
3 rows:
  (1, 100, "active")
  (3, 200, "active")
  (4, 75, "active")
(session: 1 rule(s))
> ?- complex(Id, Val, Status).
3 rows:
  (1, 100, "active")
  (3, 200, "active")
  (4, 75, "active")
> alt(Id, Val, Status) :- data(Id, Val, Status), Val >= 100.
3 rows:
  (1, 100, "active")
  (3, 200, "active")
  (5, 150, "inactive")
(session: 2 rule(s))
> ?- alt(Id, Val, Status).
3 rows:
  (1, 100, "active")
  (3, 200, "active")
  (5, 150, "inactive")
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_complex_filt
Knowledge graph 'test_complex_filt' dropped.
