Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_gt
Knowledge graph 'test_gt' created.
Switched to knowledge graph: test_gt
> .kg use test_gt
Switched to knowledge graph: test_gt
> +scores[(1, 75), (2, 85), (3, 90), (4, 60), (5, 95)].
Inserted 5 fact(s) into 'scores'.
> passing(Id, Score) :- scores(Id, Score), Score > 80.
3 rows:
  (2, 85)
  (3, 90)
  (5, 95)
(session: 1 rule(s))
> ?- passing(Id, Score).
3 rows:
  (2, 85)
  (3, 90)
  (5, 95)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_gt
Knowledge graph 'test_gt' dropped.
