Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_combined_filter_n07t12
Knowledge graph 'test_combined_filter_n07t12' created.
Switched to knowledge graph: test_combined_filter_n07t12
> .kg use test_combined_filter_n07t12
Switched to knowledge graph: test_combined_filter_n07t12
> +products[(1, "Electronics", 500), (2, "Electronics", 100), (3, "Clothing", 50), (4, "Electronics", 200)].
Inserted 4 fact(s) into 'products'.
> expensive_electronics(Id, Price) :- products(Id, "Electronics", Price), Price > 150.
2 rows:
  (1, 500)
  (4, 200)
(session: 1 rule(s))
> ?- expensive_electronics(Id, Price).
2 rows:
  (1, 500)
  (4, 200)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_combined_filter_n07t12
Knowledge graph 'test_combined_filter_n07t12' dropped.
