Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neq_chain
Knowledge graph 'test_neq_chain' created.
Switched to knowledge graph: test_neq_chain
> .kg use test_neq_chain
Switched to knowledge graph: test_neq_chain
> +values[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'values'.
> filtered(X) :- values(X), X != 2, X != 4.
3 rows:
  (1)
  (3)
  (5)
(session: 1 rule(s))
> ?- filtered(X).
3 rows:
  (1)
  (3)
  (5)
> middle(X) :- values(X), X != 1, X != 5.
3 rows:
  (2)
  (3)
  (4)
(session: 2 rule(s))
> ?- middle(X).
3 rows:
  (2)
  (3)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_neq_chain
Knowledge graph 'test_neq_chain' dropped.
