Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_null_cmp
Knowledge graph 'test_null_cmp' created.
Switched to knowledge graph: test_null_cmp
> .kg use test_null_cmp
Switched to knowledge graph: test_null_cmp
> +data[(1, 10), (2, 20), (3, 30)].
Inserted 3 fact(s) into 'data'.
> has_value(Id, Val) :- data(Id, Val), Val > 15.
2 rows:
  (2, 20)
  (3, 30)
(session: 1 rule(s))
> ?- has_value(Id, Val).
2 rows:
  (2, 20)
  (3, 30)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_null_cmp
Knowledge graph 'test_null_cmp' dropped.
