Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_filter
Knowledge graph 'test_bool_filter' created.
Switched to knowledge graph: test_bool_filter
> .kg use test_bool_filter
Switched to knowledge graph: test_bool_filter
> +items[(1, true), (2, false), (3, true), (4, false)].
Inserted 4 fact(s) into 'items'.
> enabled(Id) :- items(Id, true).
2 rows:
  (1)
  (3)
(session: 1 rule(s))
> ?- enabled(Id).
2 rows:
  (1)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_bool_filter
Knowledge graph 'test_bool_filter' dropped.
