Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_between
Knowledge graph 'test_between' created.
Switched to knowledge graph: test_between
> .kg use test_between
Switched to knowledge graph: test_between
> +vals[(1, 5), (2, 15), (3, 25), (4, 35), (5, 45)].
Inserted 5 fact(s) into 'vals'.
> in_range(Id, Val) :- vals(Id, Val), Val >= 10, Val <= 30.
2 rows:
  (2, 15)
  (3, 25)
(session: 1 rule(s))
> ?- in_range(Id, Val).
2 rows:
  (2, 15)
  (3, 25)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_between
Knowledge graph 'test_between' dropped.
