Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ineq_chain
Knowledge graph 'test_ineq_chain' created.
Switched to knowledge graph: test_ineq_chain
> .kg use test_ineq_chain
Switched to knowledge graph: test_ineq_chain
> +data[(1, 10), (2, 20), (3, 30), (4, 40), (5, 50)].
Inserted 5 fact(s) into 'data'.
> in_range(Id, V) :- data(Id, V), V > 15, V < 45.
3 rows:
  (2, 20)
  (3, 30)
  (4, 40)
(session: 1 rule(s))
> ?- in_range(Id, V).
3 rows:
  (2, 20)
  (3, 30)
  (4, 40)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_ineq_chain
Knowledge graph 'test_ineq_chain' dropped.
