Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_range_n07t22
Knowledge graph 'test_multi_range_n07t22' created.
Switched to knowledge graph: test_multi_range_n07t22
> .kg use test_multi_range_n07t22
Switched to knowledge graph: test_multi_range_n07t22
> +data[(1, 10, 100), (2, 20, 200), (3, 15, 150), (4, 25, 250)]
Inserted 4 fact(s) into 'data'.
> filtered(Id, A, B) <- data(Id, A, B), A > 10, B < 200
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    3 │   15 │  150 │
└──────┴──────┴──────┘
1 rows
(session: 1 rule(s))
> ?filtered(Id, A, B)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    3 │   15 │  150 │
└──────┴──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multi_range_n07t22
Knowledge graph 'test_multi_range_n07t22' dropped.
