Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_range
Knowledge graph 'test_multi_range' created.
Switched to knowledge graph: test_multi_range
> .kg use test_multi_range
Switched to knowledge graph: test_multi_range
> +data[(1, 10, 100), (2, 20, 200), (3, 15, 150), (4, 25, 250)].
Inserted 4 fact(s) into 'data'.
> filtered(Id, A, B) :- data(Id, A, B), A > 10, B < 200.
1 rows:
  (3, 15, 150)
(session: 1 rule(s))
> ?- filtered(Id, A, B).
1 rows:
  (3, 15, 150)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multi_range
Knowledge graph 'test_multi_range' dropped.
