Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_cmp_n07t27
Knowledge graph 'test_str_cmp_n07t27' created.
Switched to knowledge graph: test_str_cmp_n07t27
> .kg use test_str_cmp_n07t27
Switched to knowledge graph: test_str_cmp_n07t27
> +words[("apple",), ("banana",), ("cherry",), ("apricot",)]
Inserted 4 fact(s) into 'words'.
> ?words(W), W = "apple"
┌─────────┐
│ W       │
├─────────┤
│ "apple" │
└─────────┘
1 rows
> ?words(W), W != "banana"
┌───────────┐
│ W         │
├───────────┤
│ "apple"   │
│ "apricot" │
│ "cherry"  │
└───────────┘
3 rows
> ?words(W), W < "banana"
┌───────────┐
│ W         │
├───────────┤
│ "apple"   │
│ "apricot" │
└───────────┘
2 rows
> ?words(W), W > "banana"
┌──────────┐
│ W        │
├──────────┤
│ "cherry" │
└──────────┘
1 rows
> ?words(W), W <= "apple"
┌─────────┐
│ W       │
├─────────┤
│ "apple" │
└─────────┘
1 rows
> ?words(W), W >= "cherry"
┌──────────┐
│ W        │
├──────────┤
│ "cherry" │
└──────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_cmp_n07t27
Knowledge graph 'test_str_cmp_n07t27' dropped.
