Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_cmp_n07t27
Knowledge graph 'test_str_cmp_n07t27' created.
Switched to knowledge graph: test_str_cmp_n07t27
> .kg use test_str_cmp_n07t27
Switched to knowledge graph: test_str_cmp_n07t27
> +words[("apple",), ("banana",), ("cherry",), ("apricot",)].
Inserted 4 fact(s) into 'words'.
> ?- words(W), W = "apple".
1 rows:
  ("apple")
> ?- words(W), W != "banana".
3 rows:
  ("apple")
  ("apricot")
  ("cherry")
> ?- words(W), W < "banana".
2 rows:
  ("apple")
  ("apricot")
> ?- words(W), W > "banana".
1 rows:
  ("cherry")
> ?- words(W), W <= "apple".
1 rows:
  ("apple")
> ?- words(W), W >= "cherry".
1 rows:
  ("cherry")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_cmp_n07t27
Knowledge graph 'test_str_cmp_n07t27' dropped.
