Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_filter_wild_n07t31
Knowledge graph 'test_filter_wild_n07t31' created.
Switched to knowledge graph: test_filter_wild_n07t31
> .kg use test_filter_wild_n07t31
Switched to knowledge graph: test_filter_wild_n07t31
> +records[(1, "alice", 100), (2, "bob", 200), (3, "carol", 150), (4, "dave", 100)]
Inserted 4 fact(s) into 'records'.
> ?records(Id, _, Value), Value > 120
┌────┬─────────┬───────┐
│ Id │ _       │ Value │
├────┼─────────┼───────┤
│  2 │ "bob"   │   200 │
│  3 │ "carol" │   150 │
└────┴─────────┴───────┘
2 rows
> ?records(Id, _, Value), Id < 3
┌────┬─────────┬───────┐
│ Id │ _       │ Value │
├────┼─────────┼───────┤
│  1 │ "alice" │   100 │
│  2 │ "bob"   │   200 │
└────┴─────────┴───────┘
2 rows
> ?records(_, _, Value), Value = 100
┌───┬─────────┬───────┐
│ _ │ _       │ Value │
├───┼─────────┼───────┤
│ 1 │ "alice" │   100 │
│ 4 │ "dave"  │   100 │
└───┴─────────┴───────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_filter_wild_n07t31
Knowledge graph 'test_filter_wild_n07t31' dropped.
