Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_filter_n07t32
Knowledge graph 'test_multi_filter_n07t32' created.
Switched to knowledge graph: test_multi_filter_n07t32
> .kg use test_multi_filter_n07t32
Switched to knowledge graph: test_multi_filter_n07t32
> +data[(1, "A", 100), (2, "B", 200), (3, "A", 300), (4, "B", 400)]
Inserted 4 fact(s) into 'data'.
> filtered(Id, Cat, Val) <- data(Id, Cat, Val), Cat = "A", Val > 50
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "A"  │  100 │
│    3 │ "A"  │  300 │
└──────┴──────┴──────┘
2 rows
(session: 1 rule(s))
> ?filtered(Id, Cat, Val)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "A"  │  100 │
│    3 │ "A"  │  300 │
└──────┴──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multi_filter_n07t32
Knowledge graph 'test_multi_filter_n07t32' dropped.
