Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_or_sim_n07t35
Knowledge graph 'test_or_sim_n07t35' created.
Switched to knowledge graph: test_or_sim_n07t35
> .kg use test_or_sim_n07t35
Switched to knowledge graph: test_or_sim_n07t35
> +items[(1, "a", 100), (2, "b", 200), (3, "c", 50), (4, "d", 300), (5, "e", 25)]
Inserted 5 fact(s) into 'items'.
> or_result(Id, Name, Val) <- items(Id, Name, Val), Val > 150
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    2 │ "b"  │  200 │
│    4 │ "d"  │  300 │
└──────┴──────┴──────┘
2 rows
(session: 1 rule(s))
> or_result(Id, Name, Val) <- items(Id, Name, Val), Id = 1
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "a"  │  100 │
│    2 │ "b"  │  200 │
│    4 │ "d"  │  300 │
└──────┴──────┴──────┘
3 rows
(session: 2 rule(s))
> ?or_result(Id, Name, Val)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "a"  │  100 │
│    2 │ "b"  │  200 │
│    4 │ "d"  │  300 │
└──────┴──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_or_sim_n07t35
Knowledge graph 'test_or_sim_n07t35' dropped.
