Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_var_expr_n07t43
Knowledge graph 'test_var_expr_n07t43' created.
Switched to knowledge graph: test_var_expr_n07t43
> .kg use test_var_expr_n07t43
Switched to knowledge graph: test_var_expr_n07t43
> +items[(1, 10, 5), (2, 20, 15), (3, 30, 25)]
Inserted 3 fact(s) into 'items'.
> above_threshold(Id, Val, Threshold) <- items(Id, Val, Threshold), Val > Threshold
┌───┬────┬────┐
│ X │ Y  │ Z  │
├───┼────┼────┤
│ 1 │ 10 │  5 │
│ 2 │ 20 │ 15 │
│ 3 │ 30 │ 25 │
└───┴────┴────┘
3 rows
(session: 1 rule(s))
> ?above_threshold(Id, Val, Threshold)
┌────┬─────┬───────────┐
│ Id │ Val │ Threshold │
├────┼─────┼───────────┤
│  1 │  10 │         5 │
│  2 │  20 │        15 │
│  3 │  30 │        25 │
└────┴─────┴───────────┘
3 rows
> computed_filter(Id, Val) <- items(Id, Val, _), Val > 10 + 5
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 2 │ 20 │
│ 3 │ 30 │
└───┴────┘
2 rows
(session: 2 rule(s))
> ?computed_filter(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  2 │  20 │
│  3 │  30 │
└────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_var_expr_n07t43
Knowledge graph 'test_var_expr_n07t43' dropped.
