Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_filter_n07t46
Knowledge graph 'test_bool_filter_n07t46' created.
Switched to knowledge graph: test_bool_filter_n07t46
> .kg use test_bool_filter_n07t46
Switched to knowledge graph: test_bool_filter_n07t46
> +items[(1, true), (2, false), (3, true), (4, false)]
Inserted 4 fact(s) into 'items'.
> enabled(Id) <- items(Id, true)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
(session: 1 rule(s))
> ?enabled(Id)
┌────┐
│ Id │
├────┤
│  1 │
│  3 │
└────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_bool_filter_n07t46
Knowledge graph 'test_bool_filter_n07t46' dropped.
