Executing script: examples/datalog/13_performance/02_wide_join.dl

> .db create test_perf_wide
Database 'test_perf_wide' created.
Switched to database: test_perf_wide
> .db use test_perf_wide
Switched to database: test_perf_wide
> +rel1[(1,1), (1,2), (1,3), (1,4), (1,5), (1,6), (1,7), (1,8), (1,9), (1,10), (2,1), (2,2), (2,3), (2,4), (2,5), (2,6), (2,7), (2,8), (2,9), (2,10), (3,1), (3,2), (3,3), (3,4), (3,5), (3,6), (3,7), (3,8), (3,9), (3,10), (4,1), (4,2), (4,3), (4,4), (4,5), (4,6), (4,7), (4,8), (4,9), (4,10), (5,1), (5,2), (5,3), (5,4), (5,5), (5,6), (5,7), (5,8), (5,9), (5,10)].
Inserted 50 facts into 'rel1'.
> +rel2[(1,100), (2,200), (3,300), (4,400), (5,500), (6,600), (7,700), (8,800), (9,900), (10,1000)].
Inserted 10 facts into 'rel2'.
> +joined(A, B, C) :- rel1(A, B), rel2(B, C).
Rule 'joined' registered.
> ?- joined(1, B, C).
5 rows:
  (1, 100, 1)
  (1, 100, 2)
  (1, 100, 3)
  (1, 100, 4)
  (1, 100, 5)
> .db use default
Switched to database: default
> .db drop test_perf_wide
Database 'test_perf_wide' dropped.
