Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_perf_wide_n13t02
Knowledge graph 'test_perf_wide_n13t02' created.
Switched to knowledge graph: test_perf_wide_n13t02
> .kg use test_perf_wide_n13t02
Switched to knowledge graph: test_perf_wide_n13t02
> +rel1[(1,1), (1,2), (1,3), (1,4), (1,5), (1,6), (1,7), (1,8), (1,9), (1,10), (2,1), (2,2), (2,3), (2,4), (2,5), (2,6), (2,7), (2,8), (2,9), (2,10), (3,1), (3,2), (3,3), (3,4), (3,5), (3,6), (3,7), (3,8), (3,9), (3,10), (4,1), (4,2), (4,3), (4,4), (4,5), (4,6), (4,7), (4,8), (4,9), (4,10), (5,1), (5,2), (5,3), (5,4), (5,5), (5,6), (5,7), (5,8), (5,9), (5,10)]
Inserted 50 fact(s) into 'rel1'.
> +rel2[(1,100), (2,200), (3,300), (4,400), (5,500), (6,600), (7,700), (8,800), (9,900), (10,1000)]
Inserted 10 fact(s) into 'rel2'.
> +joined(A, B, C) <- rel1(A, B), rel2(B, C)
Rule 'joined' registered.
> ?joined(1, B, C)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    1 │  100 │
│    1 │    2 │  200 │
│    1 │    3 │  300 │
│    1 │    4 │  400 │
│    1 │    5 │  500 │
│    1 │    6 │  600 │
│    1 │    7 │  700 │
│    1 │    8 │  800 │
│    1 │    9 │  900 │
│    1 │   10 │ 1000 │
└──────┴──────┴──────┘
10 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_perf_wide_n13t02
Knowledge graph 'test_perf_wide_n13t02' dropped.
