Executing script: examples/datalog/13_performance/04_dense_graph.dl

> .db create test_perf_dense
Database 'test_perf_dense' created.
Switched to database: test_perf_dense
> .db use test_perf_dense
Switched to database: test_perf_dense
> +edge[(1,2), (1,3), (1,4), (1,5), (2,1), (2,3), (2,4), (2,5), (3,1), (3,2), (3,4), (3,5), (4,1), (4,2), (4,3), (4,5), (5,1), (5,2), (5,3), (5,4)].
Inserted 20 facts into 'edge'.
> ?- edge(X, Y).
20 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 1)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 1)
  (3, 2)
  (3, 4)
  (3, 5)
  (4, 1)
  (4, 2)
  (4, 3)
  (4, 5)
  (5, 1)
  (5, 2)
  (5, 3)
  (5, 4)
> +triangle(A, B, C) :- edge(A, B), edge(B, C), edge(C, A).
Rule 'triangle' registered.
> ?- triangle(1, B, C).
12 rows:
  (1, 2, 3)
  (1, 2, 4)
  (1, 2, 5)
  (1, 3, 2)
  (1, 3, 4)
  (1, 3, 5)
  (1, 4, 2)
  (1, 4, 3)
  (1, 4, 5)
  (1, 5, 2)
  (1, 5, 3)
  (1, 5, 4)
> +reach(X, Y) :- edge(X, Y).
Rule 'reach' registered.
> +reach(X, Z) :- reach(X, Y), edge(Y, Z).
Rule added to 'reach' (2 rules total).
> ?- reach(1, Y).
5 rows:
  (1, 1)
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
> .db use default
Switched to database: default
> .db drop test_perf_dense
Database 'test_perf_dense' dropped.
