Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_perf_dense
Knowledge graph 'test_perf_dense' created.
Switched to knowledge graph: test_perf_dense
> .kg use test_perf_dense
Switched to knowledge graph: test_perf_dense
> +edge[(1,2), (1,3), (1,4), (1,5), (2,1), (2,3), (2,4), (2,5), (3,1), (3,2), (3,4), (3,5), (4,1), (4,2), (4,3), (4,5), (5,1), (5,2), (5,3), (5,4)].
Inserted 20 fact(s) into 'edge'.
> ?- edge(X, Y).
20 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 1)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 1)
  (3, 2)
  (3, 4)
  (3, 5)
  (4, 1)
  (4, 2)
  (4, 3)
  (4, 5)
  (5, 1)
  (5, 2)
  (5, 3)
  (5, 4)
> +triangle(A, B, C) :- edge(A, B), edge(B, C), edge(C, A).
Rule 'triangle' registered.
> ?- triangle(1, B, C).
12 rows:
  (1, 2, 3)
  (1, 2, 4)
  (1, 2, 5)
  (1, 3, 2)
  (1, 3, 4)
  (1, 3, 5)
  (1, 4, 2)
  (1, 4, 3)
  (1, 4, 5)
  (1, 5, 2)
  (1, 5, 3)
  (1, 5, 4)
> +reach(X, Y) :- edge(X, Y).
Rule 'reach' registered.
> +reach(X, Z) :- reach(X, Y), edge(Y, Z).
Rule 'reach' registered.
> ?- reach(1, Y).
5 rows:
  (1, 1)
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_perf_dense
Knowledge graph 'test_perf_dense' dropped.
