Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_many_joins_n13t08
Knowledge graph 'test_many_joins_n13t08' created.
Switched to knowledge graph: test_many_joins_n13t08
> .kg use test_many_joins_n13t08
Switched to knowledge graph: test_many_joins_n13t08
> +r1[(1, 10), (2, 20), (3, 30)].
Inserted 3 fact(s) into 'r1'.
> +r2[(10, 100), (20, 200), (30, 300)].
Inserted 3 fact(s) into 'r2'.
> +r3[(100, 1000), (200, 2000), (300, 3000)].
Inserted 3 fact(s) into 'r3'.
> +r4[(1000, 10000), (2000, 20000), (3000, 30000)].
Inserted 3 fact(s) into 'r4'.
> +r5[(10000, 100000), (20000, 200000), (30000, 300000)].
Inserted 3 fact(s) into 'r5'.
> +chain5(A, F) :- r1(A, B), r2(B, C), r3(C, D), r4(D, E), r5(E, F).
Rule 'chain5' registered.
> ?- chain5(A, F).
3 rows:
  (1, 100000)
  (2, 200000)
  (3, 300000)
> +center[(1, 2, 3)].
Inserted 1 fact(s) into 'center'.
> +left[(1, 100)].
Inserted 1 fact(s) into 'left'.
> +right[(3, 300)].
Inserted 1 fact(s) into 'right'.
> +top[(2, 200)].
Inserted 1 fact(s) into 'top'.
> +star_join(L, T, R) :- center(A, B, C), left(A, L), top(B, T), right(C, R).
Rule 'star_join' registered.
> ?- star_join(L, T, R).
1 rows:
  (100, 200, 300)
> +nodes[(1), (2), (3), (4), (5)].
Inserted 5 fact(s) into 'nodes'.
> +links[(1, 2), (2, 3), (3, 4), (4, 5), (1, 3), (2, 4), (3, 5)].
Inserted 7 fact(s) into 'links'.
> +path3(A, B, C) :- links(A, B), links(B, C), A != C.
Rule 'path3' registered.
> ?- path3(A, B, C).
8 rows:
  (1, 2, 3)
  (1, 2, 4)
  (1, 3, 4)
  (1, 3, 5)
  (2, 3, 4)
  (2, 3, 5)
  (2, 4, 5)
  (3, 4, 5)
> +path3_count(count<A>) :- path3(A, _, _).
Rule 'path3_count' registered.
> ?- path3_count(C).
1 rows:
  (8)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_many_joins_n13t08
Knowledge graph 'test_many_joins_n13t08' dropped.
