Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_quantize_symmetric_n30t02
Knowledge graph 'test_quantize_symmetric_n30t02' created.
Switched to knowledge graph: test_quantize_symmetric_n30t02
> .kg use test_quantize_symmetric_n30t02
Switched to knowledge graph: test_quantize_symmetric_n30t02
> +embedding[(1, [1.0, 0.5, -0.5, -1.0])]
Inserted 1 fact(s) into 'embedding'.
> +embedding[(2, [0.0, 0.0, 0.0, 0.0])]
Inserted 1 fact(s) into 'embedding'.
> +embedding[(3, [2.0, -2.0, 1.0, -1.0])]
Inserted 1 fact(s) into 'embedding'.
> ?embedding(Id, V), Q = quantize_symmetric(V)
┌────┬────────────────────────┬──────────────────────┐
│ Id │ V                      │ Q                    │
├────┼────────────────────────┼──────────────────────┤
│  1 │ [1.0, 0.5, -0.5, -1.0] │ [127, 64, -64, -127] │
│  2 │ [0.0, 0.0, 0.0, 0.0]   │ [0, 0, 0, 0]         │
│  3 │ [2.0, -2.0, 1.0, -1.0] │ [127, -127, 64, -64] │
└────┴────────────────────────┴──────────────────────┘
3 rows
> quantized_sym(Id, Q) <- embedding(Id, V), Q = quantize_symmetric(V)
┌───┬──────────────────────┐
│ X │ Y                    │
├───┼──────────────────────┤
│ 1 │ [127, 64, -64, -127] │
│ 2 │ [0, 0, 0, 0]         │
│ 3 │ [127, -127, 64, -64] │
└───┴──────────────────────┘
3 rows
(session: 1 rule(s))
> ?quantized_sym(Id, Q)
┌────┬──────────────────────┐
│ Id │ Q                    │
├────┼──────────────────────┤
│  1 │ [127, 64, -64, -127] │
│  2 │ [0, 0, 0, 0]         │
│  3 │ [127, -127, 64, -64] │
└────┴──────────────────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_quantize_symmetric_n30t02
Knowledge graph 'test_quantize_symmetric_n30t02' dropped.
