Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_quantize_symmetric
Knowledge graph 'test_quantize_symmetric' created.
Switched to knowledge graph: test_quantize_symmetric
> .kg use test_quantize_symmetric
Switched to knowledge graph: test_quantize_symmetric
> +embedding[(1, [1.0, 0.5, -0.5, -1.0])].
Inserted 1 fact(s) into 'embedding'.
> +embedding[(2, [0.0, 0.0, 0.0, 0.0])].
Inserted 1 fact(s) into 'embedding'.
> +embedding[(3, [2.0, -2.0, 1.0, -1.0])].
Inserted 1 fact(s) into 'embedding'.
> ?- embedding(Id, V), Q = quantize_symmetric(V).
3 rows:
  (1, [Number(1.0), Number(0.5), Number(-0.5), Number(-1.0)], [Number(127), Number(64), Number(-64), Number(-127)])
  (2, [Number(0.0), Number(0.0), Number(0.0), Number(0.0)], [Number(0), Number(0), Number(0), Number(0)])
  (3, [Number(2.0), Number(-2.0), Number(1.0), Number(-1.0)], [Number(127), Number(-127), Number(64), Number(-64)])
> quantized_sym(Id, Q) :- embedding(Id, V), Q = quantize_symmetric(V).
3 rows:
  (1, [Number(127), Number(64), Number(-64), Number(-127)])
  (2, [Number(0), Number(0), Number(0), Number(0)])
  (3, [Number(127), Number(-127), Number(64), Number(-64)])
(session: 1 rule(s))
> ?- quantized_sym(Id, Q).
3 rows:
  (1, [Number(127), Number(64), Number(-64), Number(-127)])
  (2, [Number(0), Number(0), Number(0), Number(0)])
  (3, [Number(127), Number(-127), Number(64), Number(-64)])
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_quantize_symmetric
Knowledge graph 'test_quantize_symmetric' dropped.
