Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dequantize_n30t03
Knowledge graph 'test_dequantize_n30t03' created.
Switched to knowledge graph: test_dequantize_n30t03
> .kg use test_dequantize_n30t03
Switched to knowledge graph: test_dequantize_n30t03
> +embedding[(1, [1.0, 0.5, -0.5, -1.0])]
Inserted 1 fact(s) into 'embedding'.
> +embedding[(2, [0.0, 0.0, 0.0, 0.0])]
Inserted 1 fact(s) into 'embedding'.
> +embedding[(3, [0.25, 0.75, -0.25, -0.75])]
Inserted 1 fact(s) into 'embedding'.
> ?embedding(Id, V), Q = quantize_linear(V), D = dequantize(Q)
┌──────┬────────────────────────────┬──────────────────────┬──────────────────────────────┐
│ col0 │ col1                       │ col2                 │ col3                         │
├──────┼────────────────────────────┼──────────────────────┼──────────────────────────────┤
│    1 │ [1.0, 0.5, -0.5, -1.0]     │ [127, 63, -64, -128] │ [127.0, 63.0, -64.0, -128.0] │
│    2 │ [0.0, 0.0, 0.0, 0.0]       │ [0, 0, 0, 0]         │ [0.0, 0.0, 0.0, 0.0]         │
│    3 │ [0.25, 0.75, -0.25, -0.75] │ [42, 127, -43, -128] │ [42.0, 127.0, -43.0, -128.0] │
└──────┴────────────────────────────┴──────────────────────┴──────────────────────────────┘
3 rows
> roundtrip(Id, Original, Quantized, Dequantized) <-
Script error: Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
