Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_euclidean_int8_n30t05
Knowledge graph 'test_euclidean_int8_n30t05' created.
Switched to knowledge graph: test_euclidean_int8_n30t05
> .kg use test_euclidean_int8_n30t05
Switched to knowledge graph: test_euclidean_int8_n30t05
> +embedding[(1, [1.0, 0.0, 0.0, 0.0])]
Inserted 1 fact(s) into 'embedding'.
> +embedding[(2, [0.0, 1.0, 0.0, 0.0])]
Inserted 1 fact(s) into 'embedding'.
> ?embedding(Id, V), Q = quantize_linear(V)
┌────┬──────────────────────┬─────────────────────────┐
│ Id │ V                    │ Q                       │
├────┼──────────────────────┼─────────────────────────┤
│  1 │ [1.0, 0.0, 0.0, 0.0] │ [127, -128, -128, -128] │
│  2 │ [0.0, 1.0, 0.0, 0.0] │ [-128, 127, -128, -128] │
└────┴──────────────────────┴─────────────────────────┘
2 rows
> self_dist(Id, Dist) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> embedding(Id, V),
Parse error: Expected parentheses: (Id, V),
> Q = quantize_linear(V),
Parse error: Expected parentheses: (V),
> Dist = euclidean_int8(Q, Q)
Cannot insert variable 'Q' - use constants only
> ?self_dist(Id, Dist)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_euclidean_int8_n30t05
Knowledge graph 'test_euclidean_int8_n30t05' dropped.
