Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_euclidean_int8
Knowledge graph 'test_euclidean_int8' created.
Switched to knowledge graph: test_euclidean_int8
> .kg use test_euclidean_int8
Switched to knowledge graph: test_euclidean_int8
> +embedding[(1, [1.0, 0.0, 0.0, 0.0])].
Inserted 1 fact(s) into 'embedding'.
> +embedding[(2, [0.0, 1.0, 0.0, 0.0])].
Inserted 1 fact(s) into 'embedding'.
> ?- embedding(Id, V), Q = quantize_linear(V).
2 rows:
  (1, [Number(1.0), Number(0.0), Number(0.0), Number(0.0)], [Number(127), Number(-128), Number(-128), Number(-128)])
  (2, [Number(0.0), Number(1.0), Number(0.0), Number(0.0)], [Number(-128), Number(127), Number(-128), Number(-128)])
> self_dist(Id, Dist) :- embedding(Id, V), Q = quantize_linear(V), Dist = euclidean_int8(Q, Q).
2 rows:
  (1, 0.0)
  (2, 0.0)
(session: 1 rule(s))
> ?- self_dist(Id, Dist).
2 rows:
  (1, 0.0)
  (2, 0.0)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_euclidean_int8
Knowledge graph 'test_euclidean_int8' dropped.
