Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dot_int8
Knowledge graph 'test_dot_int8' created.
Switched to knowledge graph: test_dot_int8
> .kg use test_dot_int8
Switched to knowledge graph: test_dot_int8
> +embedding[(1, [1.0, 0.0, 0.0, 0.0])].
Inserted 1 fact(s) into 'embedding'.
> +embedding[(2, [0.5, 0.5, 0.0, 0.0])].
Inserted 1 fact(s) into 'embedding'.
> +embedding[(3, [1.0, 1.0, 1.0, 1.0])].
Inserted 1 fact(s) into 'embedding'.
> int8_dot(Id1, Id2, DotProd) :- embedding(Id1, V1), embedding(Id2, V2), Id1 < Id2, Q1 = quantize_linear(V1), Q2 = quantize_linear(V2), DotProd = dot_int8(Q1, Q2).
3 rows:
  (1, 2, 32641.0)
  (1, 3, 0.0)
  (2, 3, 0.0)
(session: 1 rule(s))
> ?- int8_dot(Id1, Id2, DotProd).
3 rows:
  (1, 2, 32641.0)
  (1, 3, 0.0)
  (2, 3, 0.0)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_dot_int8
Knowledge graph 'test_dot_int8' dropped.
