Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_lsh_probes_n31t02
Knowledge graph 'test_lsh_probes_n31t02' created.
Switched to knowledge graph: test_lsh_probes_n31t02
> .kg use test_lsh_probes_n31t02
Switched to knowledge graph: test_lsh_probes_n31t02
> +vectors[(1, [1.0, 0.5, 0.0, -0.5])]
Inserted 1 fact(s) into 'vectors'.
> probe_result(Id, Bucket, Probes) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> vectors(Id, V),
Parse error: Expected parentheses: (Id, V),
> Bucket = lsh_bucket(V, 0, 4),
Parse error: Expected parentheses: (V, 0, 4),
> Probes = lsh_probes(Bucket, 4, 5)
Cannot insert variable 'Bucket' - use constants only
> ?probe_result(Id, Bucket, Probes)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_lsh_probes_n31t02
Knowledge graph 'test_lsh_probes_n31t02' dropped.
