Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lsh_probes_n31t02
Knowledge graph 'test_lsh_probes_n31t02' created.
Switched to knowledge graph: test_lsh_probes_n31t02
> .kg use test_lsh_probes_n31t02
Switched to knowledge graph: test_lsh_probes_n31t02
> +vectors[(1, [1.0, 0.5, 0.0, -0.5])].
Inserted 1 fact(s) into 'vectors'.
> probe_result(Id, Bucket, Probes) :- vectors(Id, V), Bucket = lsh_bucket(V, 0, 4), Probes = lsh_probes(Bucket, 4, 5).
1 rows:
  (1, 8, [Number(8.0), Number(9.0), Number(10.0), Number(12.0), Number(0.0)])
(session: 1 rule(s))
> ?- probe_result(Id, Bucket, Probes).
1 rows:
  (1, 8, [Number(8.0), Number(9.0), Number(10.0), Number(12.0), Number(0.0)])
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_lsh_probes_n31t02
Knowledge graph 'test_lsh_probes_n31t02' dropped.
