Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lsh_multi_probe_n31t03
Knowledge graph 'test_lsh_multi_probe_n31t03' created.
Switched to knowledge graph: test_lsh_multi_probe_n31t03
> .kg use test_lsh_multi_probe_n31t03
Switched to knowledge graph: test_lsh_multi_probe_n31t03
> +vectors[(1, [1.0, 0.5, 0.0, -0.5])]
Inserted 1 fact(s) into 'vectors'.
> +vectors[(2, [0.0, 1.0, 0.5, 0.0])]
Inserted 1 fact(s) into 'vectors'.
> multi_probe_result(Id, Probes) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> vectors(Id, V),
Parse error: Expected parentheses: (Id, V),
> Probes = lsh_multi_probe(V, 0, 4, 5)
Cannot insert variable 'V' - use constants only
> ?multi_probe_result(Id, Probes)
No results.
> compare_result(Id, Bucket, SeparateProbes, MultiProbes) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> vectors(Id, V),
Parse error: Expected parentheses: (Id, V),
> Bucket = lsh_bucket(V, 0, 4),
Parse error: Expected parentheses: (V, 0, 4),
> SeparateProbes = lsh_probes(Bucket, 4, 5),
Parse error: Expected parentheses: (Bucket, 4, 5),
> MultiProbes = lsh_multi_probe(V, 0, 4, 5)
Cannot insert variable 'V' - use constants only
> ?compare_result(Id, Bucket, SeparateProbes, MultiProbes)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_lsh_multi_probe_n31t03
Knowledge graph 'test_lsh_multi_probe_n31t03' dropped.
