Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lsh_identical_n31t05
Knowledge graph 'test_lsh_identical_n31t05' created.
Switched to knowledge graph: test_lsh_identical_n31t05
> .kg use test_lsh_identical_n31t05
Switched to knowledge graph: test_lsh_identical_n31t05
> +vectors[(1, [1.0, 2.0, 3.0]), (2, [1.0, 2.0, 3.0]), (3, [4.0, 5.0, 6.0])].
Inserted 3 fact(s) into 'vectors'.
> with_bucket(Id, Vec, B) :- vectors(Id, Vec), B = lsh_bucket(Vec, 4, 42).
3 rows:
  (1, [Number(1.0), Number(2.0), Number(3.0)], 1611170160950)
  (2, [Number(1.0), Number(2.0), Number(3.0)], 1611170160950)
  (3, [Number(4.0), Number(5.0), Number(6.0)], 2153476890934)
(session: 1 rule(s))
> ?- with_bucket(Id, Vec, B).
3 rows:
  (1, [Number(1.0), Number(2.0), Number(3.0)], 1611170160950)
  (2, [Number(1.0), Number(2.0), Number(3.0)], 1611170160950)
  (3, [Number(4.0), Number(5.0), Number(6.0)], 2153476890934)
> same_bucket(Id1, Id2, B) :- vectors(Id1, V1), vectors(Id2, V2), Id1 < Id2, B = lsh_bucket(V1, 4, 42), B = lsh_bucket(V2, 4, 42).
3 rows:
  (1, 2, 1611170160950)
  (1, 3, 1611170160950)
  (2, 3, 1611170160950)
(session: 2 rule(s))
> ?- same_bucket(Id1, Id2, B).
3 rows:
  (1, 2, 1611170160950)
  (1, 3, 1611170160950)
  (2, 3, 1611170160950)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_lsh_identical_n31t05
Knowledge graph 'test_lsh_identical_n31t05' dropped.
