Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lsh_identical_n31t05
Knowledge graph 'test_lsh_identical_n31t05' created.
Switched to knowledge graph: test_lsh_identical_n31t05
> .kg use test_lsh_identical_n31t05
Switched to knowledge graph: test_lsh_identical_n31t05
> +vectors[(1, [1.0, 2.0, 3.0]), (2, [1.0, 2.0, 3.0]), (3, [4.0, 5.0, 6.0])]
Inserted 3 fact(s) into 'vectors'.
> with_bucket(Id, Vec, B) <- vectors(Id, Vec), B = lsh_bucket(Vec, 4, 42)
┌───┬─────────────────┬───────────────┐
│ X │ Y               │ Z             │
├───┼─────────────────┼───────────────┤
│ 1 │ [1.0, 2.0, 3.0] │ 1611170160950 │
│ 2 │ [1.0, 2.0, 3.0] │ 1611170160950 │
│ 3 │ [4.0, 5.0, 6.0] │ 2153476890934 │
└───┴─────────────────┴───────────────┘
3 rows
(session: 1 rule(s))
> ?with_bucket(Id, Vec, B)
┌────┬─────────────────┬───────────────┐
│ Id │ Vec             │ B             │
├────┼─────────────────┼───────────────┤
│  1 │ [1.0, 2.0, 3.0] │ 1611170160950 │
│  2 │ [1.0, 2.0, 3.0] │ 1611170160950 │
│  3 │ [4.0, 5.0, 6.0] │ 2153476890934 │
└────┴─────────────────┴───────────────┘
3 rows
> same_bucket(Id1, Id2, B) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> vectors(Id1, V1), vectors(Id2, V2), Id1 < Id2,
Parse error: Expected parentheses: (Id1, V1), vectors(Id2, V2), Id1 < Id2,
> B = lsh_bucket(V1, 4, 42),
Parse error: Expected parentheses: (V1, 4, 42),
> B = lsh_bucket(V2, 4, 42)
Cannot insert variable 'V2' - use constants only
> ?same_bucket(Id1, Id2, B)
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_lsh_identical_n31t05
Knowledge graph 'test_lsh_identical_n31t05' dropped.
