Executing script: examples/datalog/03_views/01_simple_view.dl

> .db create test_view
Database 'test_view' created.
Switched to database: test_view
> .db use test_view
Switched to database: test_view
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 facts into 'edge'.
> +reverse(X, Y) :- edge(Y, X).
Rule 'reverse' registered.
> .view
Rules:
  reverse
> ?- reverse(X, Y).
3 rows:
  (2, 1)
  (3, 2)
  (4, 3)
> .view reverse
Rule: reverse
Clauses:
  1. reverse(X, Y) :- edge(Y, X).

Results: 3 rows
  (2, 1)
  (3, 2)
  (4, 3)
> .db use default
Switched to database: default
> .db drop test_view
Database 'test_view' dropped.
