Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_union_n22t01
Knowledge graph 'test_union_n22t01' created.
Switched to knowledge graph: test_union_n22t01
> .kg use test_union_n22t01
Switched to knowledge graph: test_union_n22t01
> +source_a[(1, 100), (2, 200)]
Inserted 2 fact(s) into 'source_a'.
> +source_b[(3, 300), (4, 400)]
Inserted 2 fact(s) into 'source_b'.
> +combined(X, Y) <- source_a(X, Y)
Rule 'combined' registered.
> +combined(X, Y) <- source_b(X, Y)
Rule 'combined' registered.
> ?combined(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │  100 │
│    2 │  200 │
│    3 │  300 │
│    4 │  400 │
└──────┴──────┘
4 rows
> +source_c[(5, 500)]
Inserted 1 fact(s) into 'source_c'.
> +all_sources(X, Y) <- source_a(X, Y)
Rule 'all_sources' registered.
> +all_sources(X, Y) <- source_b(X, Y)
Rule 'all_sources' registered.
> +all_sources(X, Y) <- source_c(X, Y)
Rule 'all_sources' registered.
> ?all_sources(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │  100 │
│    2 │  200 │
│    3 │  300 │
│    4 │  400 │
│    5 │  500 │
└──────┴──────┘
5 rows
> +union_count(count<X>) <- all_sources(X, _)
Rule 'union_count' registered.
> ?union_count(C)
┌──────┐
│ col0 │
├──────┤
│    5 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_union_n22t01
Knowledge graph 'test_union_n22t01' dropped.
