Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_union_dedup_n22t02
Knowledge graph 'test_union_dedup_n22t02' created.
Switched to knowledge graph: test_union_dedup_n22t02
> .kg use test_union_dedup_n22t02
Switched to knowledge graph: test_union_dedup_n22t02
> +set_a[(1), (2), (3)]
Inserted 3 fact(s) into 'set_a'.
> +set_b[(2), (3), (4)]
Inserted 3 fact(s) into 'set_b'.
> +union_ab(X) <- set_a(X)
Rule 'union_ab' registered.
> +union_ab(X) <- set_b(X)
Rule 'union_ab' registered.
> ?union_ab(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    3 │
│    4 │
└──────┘
4 rows
> +union_count(count<X>) <- union_ab(X)
Rule 'union_count' registered.
> ?union_count(C)
┌──────┐
│ col0 │
├──────┤
│    4 │
└──────┘
1 rows
> +pairs_a[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'pairs_a'.
> +pairs_b[(2, 20), (3, 30), (4, 40)]
Inserted 3 fact(s) into 'pairs_b'.
> +pair_union(X, Y) <- pairs_a(X, Y)
Rule 'pair_union' registered.
> +pair_union(X, Y) <- pairs_b(X, Y)
Rule 'pair_union' registered.
> ?pair_union(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │   10 │
│    2 │   20 │
│    3 │   30 │
│    4 │   40 │
└──────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_union_dedup_n22t02
Knowledge graph 'test_union_dedup_n22t02' dropped.
