Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_sets_n22t05
Knowledge graph 'test_empty_sets_n22t05' created.
Switched to knowledge graph: test_empty_sets_n22t05
> .kg use test_empty_sets_n22t05
Switched to knowledge graph: test_empty_sets_n22t05
> +nonempty[(1), (2), (3)].
Inserted 3 fact(s) into 'nonempty'.
> +empty[].
Inserted 0 fact(s) into 'empty'.
> union_result(X) :- nonempty(X).
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> union_result(X) :- empty(X).
3 rows:
  (1)
  (2)
  (3)
(session: 2 rule(s))
> ?- union_result(X).
3 rows:
  (1)
  (2)
  (3)
> inter_result(X) :- nonempty(X), empty(X).
No results.
(session: 3 rule(s))
> ?- inter_result(X).
No results.
> diff_empty(X) :- empty(X), !nonempty(X).
No results.
(session: 4 rule(s))
> ?- diff_empty(X).
No results.
> diff_result(X) :- nonempty(X), !empty(X).
3 rows:
  (1)
  (2)
  (3)
(session: 5 rule(s))
> ?- diff_result(X).
3 rows:
  (1)
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 5 session rule(s), 0 session fact(s))
> .kg drop test_empty_sets_n22t05
Knowledge graph 'test_empty_sets_n22t05' dropped.
