Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sym_diff
Knowledge graph 'test_sym_diff' created.
Switched to knowledge graph: test_sym_diff
> .kg use test_sym_diff
Switched to knowledge graph: test_sym_diff
> +set_a[(1), (2), (3), (4)].
Inserted 4 fact(s) into 'set_a'.
> +set_b[(3), (4), (5), (6)].
Inserted 4 fact(s) into 'set_b'.
> sym_diff(X) :- set_a(X), !set_b(X).
2 rows:
  (1)
  (2)
(session: 1 rule(s))
> sym_diff(X) :- set_b(X), !set_a(X).
4 rows:
  (1)
  (2)
  (5)
  (6)
(session: 2 rule(s))
> ?- sym_diff(X).
4 rows:
  (1)
  (2)
  (5)
  (6)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_sym_diff
Knowledge graph 'test_sym_diff' dropped.
