Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sym_diff_n22t06
Knowledge graph 'test_sym_diff_n22t06' created.
Switched to knowledge graph: test_sym_diff_n22t06
> .kg use test_sym_diff_n22t06
Switched to knowledge graph: test_sym_diff_n22t06
> +set_a[(1), (2), (3), (4)]
Inserted 4 fact(s) into 'set_a'.
> +set_b[(3), (4), (5), (6)]
Inserted 4 fact(s) into 'set_b'.
> sym_diff(X) <- set_a(X), !set_b(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
└──────┘
2 rows
(session: 1 rule(s))
> sym_diff(X) <- set_b(X), !set_a(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    5 │
│    6 │
└──────┘
4 rows
(session: 2 rule(s))
> ?sym_diff(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    5 │
│    6 │
└──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_sym_diff_n22t06
Knowledge graph 'test_sym_diff_n22t06' dropped.
