Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_intersect3_n22t09
Knowledge graph 'test_intersect3_n22t09' created.
Switched to knowledge graph: test_intersect3_n22t09
> .kg use test_intersect3_n22t09
Switched to knowledge graph: test_intersect3_n22t09
> +set_a[(1,), (2,), (3,), (4,)].
Inserted 4 fact(s) into 'set_a'.
> +set_b[(2,), (3,), (4,), (5,)].
Inserted 4 fact(s) into 'set_b'.
> +set_c[(3,), (4,), (5,), (6,)].
Inserted 4 fact(s) into 'set_c'.
> common(X) :- set_a(X), set_b(X), set_c(X).
2 rows:
  (3)
  (4)
(session: 1 rule(s))
> ?- common(X).
2 rows:
  (3)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_intersect3_n22t09
Knowledge graph 'test_intersect3_n22t09' dropped.
