Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_minus_self
Knowledge graph 'test_minus_self' created.
Switched to knowledge graph: test_minus_self
> .kg use test_minus_self
Switched to knowledge graph: test_minus_self
> +data[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'data'.
> minus_self(X) :- data(X), !data(X).
No results.
(session: 1 rule(s))
> ?- minus_self(X).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_minus_self
Knowledge graph 'test_minus_self' dropped.
