Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_intersect_comp_n22t11
Knowledge graph 'test_intersect_comp_n22t11' created.
Switched to knowledge graph: test_intersect_comp_n22t11
> .kg use test_intersect_comp_n22t11
Switched to knowledge graph: test_intersect_comp_n22t11
> +set_a[(1,), (2,), (3,), (4,)].
Inserted 4 fact(s) into 'set_a'.
> +set_b[(2,), (4,), (6,), (8,)].
Inserted 4 fact(s) into 'set_b'.
> common(X) :- set_a(X), set_b(X).
2 rows:
  (2)
  (4)
(session: 1 rule(s))
> ?- common(X).
2 rows:
  (2)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_intersect_comp_n22t11
Knowledge graph 'test_intersect_comp_n22t11' dropped.
