Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_proper_sub_n22t13
Knowledge graph 'test_proper_sub_n22t13' created.
Switched to knowledge graph: test_proper_sub_n22t13
> .kg use test_proper_sub_n22t13
Switched to knowledge graph: test_proper_sub_n22t13
> +small[(1,), (2,)]
Inserted 2 fact(s) into 'small'.
> +large[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'large'.
> not_in_large(X) <- small(X), !large(X)
No results.
(session: 1 rule(s))
> ?not_in_large(X)
No results.
> extra_in_large(X) <- large(X), !small(X)
┌──────┐
│ col0 │
├──────┤
│    3 │
└──────┘
1 rows
(session: 2 rule(s))
> ?extra_in_large(X)
┌──────┐
│ col0 │
├──────┤
│    3 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_proper_sub_n22t13
Knowledge graph 'test_proper_sub_n22t13' dropped.
