Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_union_all
Knowledge graph 'test_union_all' created.
Switched to knowledge graph: test_union_all
> .kg use test_union_all
Switched to knowledge graph: test_union_all
> +set1[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'set1'.
> +set2[(2,), (3,), (4,)].
Inserted 3 fact(s) into 'set2'.
> combined(X) :- set1(X).
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> combined(X) :- set2(X).
4 rows:
  (1)
  (2)
  (3)
  (4)
(session: 2 rule(s))
> ?- combined(X).
4 rows:
  (1)
  (2)
  (3)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_union_all
Knowledge graph 'test_union_all' dropped.
