Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_sym_diff_n22t16
Knowledge graph 'test_sym_diff_n22t16' created.
Switched to knowledge graph: test_sym_diff_n22t16
> .kg use test_sym_diff_n22t16
Switched to knowledge graph: test_sym_diff_n22t16
> +set_a[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'set_a'.
> +set_b[(2,), (3,), (4,)]
Inserted 3 fact(s) into 'set_b'.
> only_a(X) <- set_a(X), !set_b(X)
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
(session: 1 rule(s))
> only_b(X) <- set_b(X), !set_a(X)
┌───┐
│ X │
├───┤
│ 4 │
└───┘
1 rows
(session: 2 rule(s))
> ?only_a(X)
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
> ?only_b(X)
┌───┐
│ X │
├───┤
│ 4 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_sym_diff_n22t16
Knowledge graph 'test_sym_diff_n22t16' dropped.
