Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_union_four
Knowledge graph 'test_union_four' created.
Switched to knowledge graph: test_union_four
> .kg use test_union_four
Switched to knowledge graph: test_union_four
> +src1[(1,), (2,)].
Inserted 2 fact(s) into 'src1'.
> +src2[(2,), (3,)].
Inserted 2 fact(s) into 'src2'.
> +src3[(3,), (4,)].
Inserted 2 fact(s) into 'src3'.
> +src4[(4,), (5,)].
Inserted 2 fact(s) into 'src4'.
> combined(X) :- src1(X).
2 rows:
  (1)
  (2)
(session: 1 rule(s))
> combined(X) :- src2(X).
3 rows:
  (1)
  (2)
  (3)
(session: 2 rule(s))
> combined(X) :- src3(X).
4 rows:
  (1)
  (2)
  (3)
  (4)
(session: 3 rule(s))
> combined(X) :- src4(X).
5 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
(session: 4 rule(s))
> ?- combined(X).
5 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_union_four
Knowledge graph 'test_union_four' dropped.
