Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_union_four_n22t20
Knowledge graph 'test_union_four_n22t20' created.
Switched to knowledge graph: test_union_four_n22t20
> .kg use test_union_four_n22t20
Switched to knowledge graph: test_union_four_n22t20
> +src1[(1,), (2,)]
Inserted 2 fact(s) into 'src1'.
> +src2[(2,), (3,)]
Inserted 2 fact(s) into 'src2'.
> +src3[(3,), (4,)]
Inserted 2 fact(s) into 'src3'.
> +src4[(4,), (5,)]
Inserted 2 fact(s) into 'src4'.
> combined(X) <- src1(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
└───┘
2 rows
(session: 1 rule(s))
> combined(X) <- src2(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
(session: 2 rule(s))
> combined(X) <- src3(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
│ 4 │
└───┘
4 rows
(session: 3 rule(s))
> combined(X) <- src4(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
│ 4 │
│ 5 │
└───┘
5 rows
(session: 4 rule(s))
> ?combined(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
│ 4 │
│ 5 │
└───┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_union_four_n22t20
Knowledge graph 'test_union_four_n22t20' dropped.
