Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_int_three_n22t21
Knowledge graph 'test_int_three_n22t21' created.
Switched to knowledge graph: test_int_three_n22t21
> .kg use test_int_three_n22t21
Switched to knowledge graph: test_int_three_n22t21
> +set1[(1,), (2,), (3,), (4,)]
Inserted 4 fact(s) into 'set1'.
> +set2[(2,), (3,), (4,), (5,)]
Inserted 4 fact(s) into 'set2'.
> +set3[(3,), (4,), (5,), (6,)]
Inserted 4 fact(s) into 'set3'.
> common(X) <- set1(X), set2(X), set3(X)
┌───┐
│ X │
├───┤
│ 3 │
│ 4 │
└───┘
2 rows
(session: 1 rule(s))
> ?common(X)
┌───┐
│ X │
├───┤
│ 3 │
│ 4 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_int_three_n22t21
Knowledge graph 'test_int_three_n22t21' dropped.
