Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_int_three
Knowledge graph 'test_int_three' created.
Switched to knowledge graph: test_int_three
> .kg use test_int_three
Switched to knowledge graph: test_int_three
> +set1[(1,), (2,), (3,), (4,)].
Inserted 4 fact(s) into 'set1'.
> +set2[(2,), (3,), (4,), (5,)].
Inserted 4 fact(s) into 'set2'.
> +set3[(3,), (4,), (5,), (6,)].
Inserted 4 fact(s) into 'set3'.
> common(X) :- set1(X), set2(X), set3(X).
2 rows:
  (3)
  (4)
(session: 1 rule(s))
> ?- common(X).
2 rows:
  (3)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_int_three
Knowledge graph 'test_int_three' dropped.
