Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cardinality_n22t26
Knowledge graph 'test_cardinality_n22t26' created.
Switched to knowledge graph: test_cardinality_n22t26
> .kg use test_cardinality_n22t26
Switched to knowledge graph: test_cardinality_n22t26
> +set_a[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'set_a'.
> +set_b[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'set_b'.
> count_a(count<X>) :- set_a(X).
1 rows:
  (3)
(session: 1 rule(s))
> count_b(count<X>) :- set_b(X).
1 rows:
  (5)
(session: 2 rule(s))
> ?- count_a(N).
1 rows:
  (3)
> ?- count_b(N).
1 rows:
  (5)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_cardinality_n22t26
Knowledge graph 'test_cardinality_n22t26' dropped.
