Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_minus_n22t29
Knowledge graph 'test_minus_n22t29' created.
Switched to knowledge graph: test_minus_n22t29
> .kg use test_minus_n22t29
Switched to knowledge graph: test_minus_n22t29
> +all_items[(1,), (2,), (3,), (4,), (5,)]
Inserted 5 fact(s) into 'all_items'.
> +to_remove[(2,), (4,)]
Inserted 2 fact(s) into 'to_remove'.
> remaining(X) <- all_items(X), !to_remove(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
│ 5 │
└───┘
3 rows
(session: 1 rule(s))
> ?remaining(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
│ 5 │
└───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_minus_n22t29
Knowledge graph 'test_minus_n22t29' dropped.
