Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_union_proj_n22t33
Knowledge graph 'test_union_proj_n22t33' created.
Switched to knowledge graph: test_union_proj_n22t33
> .kg use test_union_proj_n22t33
Switched to knowledge graph: test_union_proj_n22t33
> +employees[(1, "Alice", "Eng"), (2, "Bob", "Sales")]
Inserted 2 fact(s) into 'employees'.
> +contractors[(3, "Carol", "Eng"), (4, "Dave", "Marketing")]
Inserted 2 fact(s) into 'contractors'.
> all_names(Name) <- employees(_, Name, _)
┌─────────┐
│ X       │
├─────────┤
│ "Alice" │
│ "Bob"   │
└─────────┘
2 rows
(session: 1 rule(s))
> all_names(Name) <- contractors(_, Name, _)
┌─────────┐
│ X       │
├─────────┤
│ "Alice" │
│ "Bob"   │
│ "Carol" │
│ "Dave"  │
└─────────┘
4 rows
(session: 2 rule(s))
> ?all_names(Name)
┌─────────┐
│ Name    │
├─────────┤
│ "Alice" │
│ "Bob"   │
│ "Carol" │
│ "Dave"  │
└─────────┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_union_proj_n22t33
Knowledge graph 'test_union_proj_n22t33' dropped.
