Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_powerset_n22t34
Knowledge graph 'test_powerset_n22t34' created.
Switched to knowledge graph: test_powerset_n22t34
> .kg use test_powerset_n22t34
Switched to knowledge graph: test_powerset_n22t34
> +elements[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'elements'.
> pairs(A, B) :- elements(A), elements(B), A < B.
3 rows:
  (1, 2)
  (1, 3)
  (2, 3)
(session: 1 rule(s))
> ?- pairs(A, B).
3 rows:
  (1, 2)
  (1, 3)
  (2, 3)
> ordered_pairs(A, B) :- elements(A), elements(B), A != B.
6 rows:
  (1, 2)
  (1, 3)
  (2, 1)
  (2, 3)
  (3, 1)
  (3, 2)
(session: 2 rule(s))
> ?- ordered_pairs(A, B).
6 rows:
  (1, 2)
  (1, 3)
  (2, 1)
  (2, 3)
  (3, 1)
  (3, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_powerset_n22t34
Knowledge graph 'test_powerset_n22t34' dropped.
