Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_xor_n22t36
Knowledge graph 'test_xor_n22t36' created.
Switched to knowledge graph: test_xor_n22t36
> .kg use test_xor_n22t36
Switched to knowledge graph: test_xor_n22t36
> +set_a[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'set_a'.
> +set_b[(2,), (3,), (4,)]
Inserted 3 fact(s) into 'set_b'.
> +xor_ab(X) <- set_a(X), !set_b(X)
Rule 'xor_ab' registered.
> +xor_ab(X) <- set_b(X), !set_a(X)
Rule 'xor_ab' registered.
> ?xor_ab(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 4 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_xor_n22t36
Knowledge graph 'test_xor_n22t36' dropped.
