Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_schema_n24t01
Knowledge graph 'test_rel_schema_n24t01' created.
Switched to knowledge graph: test_rel_schema_n24t01
> .kg use test_rel_schema_n24t01
Switched to knowledge graph: test_rel_schema_n24t01
> +employee(emp_id: int, name: string, dept_id: int).
Schema 'employee' declared (persistent).
> +department(dept_id: int, dept_name: string).
Schema 'department' declared (persistent).
> +employee[(1, "Alice", 10), (2, "Bob", 10), (3, "Charlie", 20)].
Inserted 3 fact(s) into 'employee'.
> +department[(10, "Engineering"), (20, "Sales")].
Inserted 2 fact(s) into 'department'.
> ?- employee(Id, Name, Dept).
3 rows:
  (1, "Alice", 10)
  (2, "Bob", 10)
  (3, "Charlie", 20)
> ?- department(Id, Name).
2 rows:
  (10, "Engineering")
  (20, "Sales")
> +emp_dept(EmpName, DeptName) :- employee(_, EmpName, DeptId), department(DeptId, DeptName).
Rule 'emp_dept' registered.
> ?- emp_dept(E, D).
3 rows:
  ("Alice", "Engineering")
  ("Bob", "Engineering")
  ("Charlie", "Sales")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_schema_n24t01
Knowledge graph 'test_rel_schema_n24t01' dropped.
