Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_record_sugar_n24t02
Knowledge graph 'test_record_sugar_n24t02' created.
Switched to knowledge graph: test_record_sugar_n24t02
> .kg use test_record_sugar_n24t02
Switched to knowledge graph: test_record_sugar_n24t02
> type Person: { id: int, name: string, age: int }.
Type 'Person' declared (local only).
> type Address: { person_id: int, city: string }.
Type 'Address' declared (local only).
> +person(id: int, name: string, age: int).
Schema 'person' declared (persistent).
> +address(person_id: int, city: string).
Schema 'address' declared (persistent).
> +person[(1, "Alice", 30), (2, "Bob", 25), (3, "Charlie", 35)].
Inserted 3 fact(s) into 'person'.
> +address[(1, "New York"), (2, "Boston"), (3, "Chicago")].
Inserted 3 fact(s) into 'address'.
> ?- person(Id, Name, Age).
3 rows:
  (1, "Alice", 30)
  (2, "Bob", 25)
  (3, "Charlie", 35)
> ?- address(Pid, City).
3 rows:
  (1, "New York")
  (2, "Boston")
  (3, "Chicago")
> +person_location(Name, City) :- person(Id, Name, _), address(Id, City).
Rule 'person_location' registered.
> ?- person_location(N, C).
3 rows:
  ("Alice", "New York")
  ("Bob", "Boston")
  ("Charlie", "Chicago")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_record_sugar_n24t02
Knowledge graph 'test_record_sugar_n24t02' dropped.
