Executing script: examples/datalog/24_rel_schemas/03_schema_with_views.dl

> .db create test_schema_views
Database 'test_schema_views' created.
Switched to database: test_schema_views
> .db use test_schema_views
Switched to database: test_schema_views
> rel orders(order_id: int, customer_id: int, amount: int).
Relation 'orders' schema declared: (order_id: Base(Int), customer_id: Base(Int), amount: Base(Int))
> rel customers(customer_id: int, name: string).
Relation 'customers' schema declared: (customer_id: Base(Int), name: Base(String))
> +orders[(1, 100, 500), (2, 100, 300), (3, 200, 1500), (4, 200, 200)].
Inserted 4 facts into 'orders'.
> +customers[(100, "Acme Corp"), (200, "Widgets Inc")].
Inserted 2 facts into 'customers'.
> view customer_total(CustId: int, sum<Amount>: int) :- orders(_, CustId, Amount).
View 'customer_total' registered.
> ?- customer_total(C, T).
2 rows:
  (100, 800)
  (200, 1700)
> view high_value(CustId: int, Name: string, Total: int) :- customer_total(CustId, Total), customers(CustId, Name), Total > 500.
View 'high_value' registered.
> ?- high_value(Id, Name, Total).
2 rows:
  (100, "Acme Corp", 800)
  (200, "Widgets Inc", 1700)
> .db use default
Switched to database: default
> .db drop test_schema_views
Database 'test_schema_views' dropped.
