Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_schema_views
Knowledge graph 'test_schema_views' created.
Switched to knowledge graph: test_schema_views
> .kg use test_schema_views
Switched to knowledge graph: test_schema_views
> +orders(order_id: int, customer_id: int, amount: int).
Schema 'orders' declared (persistent).
> +customers(customer_id: int, name: string).
Schema 'customers' declared (persistent).
> +orders[(1, 100, 500), (2, 100, 300), (3, 200, 1500), (4, 200, 200)].
Inserted 4 fact(s) into 'orders'.
> +customers[(100, "Acme Corp"), (200, "Widgets Inc")].
Inserted 2 fact(s) into 'customers'.
> +customer_total(CustId, sum<Amount>) :- orders(_, CustId, Amount).
Rule 'customer_total' registered.
> ?- customer_total(C, T).
2 rows:
  (100, 800)
  (200, 1700)
> +high_value(CustId, Name, Total) :- customer_total(CustId, Total), customers(CustId, Name), Total > 500.
Rule 'high_value' registered.
> ?- high_value(Id, Name, Total).
2 rows:
  (100, "Acme Corp", 800)
  (200, "Widgets Inc", 1700)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_schema_views
Knowledge graph 'test_schema_views' dropped.
