Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arity_n24t04
Knowledge graph 'test_arity_n24t04' created.
Switched to knowledge graph: test_arity_n24t04
> .kg use test_arity_n24t04
Switched to knowledge graph: test_arity_n24t04
> +employees(id: int, name: string, dept: string).
Schema 'employees' declared (persistent).
> +employees[(1, "Alice", "Engineering"), (2, "Bob", "Sales")].
Inserted 2 fact(s) into 'employees'.
> ?- employees(Id, Name, Dept).
2 rows:
  (1, "Alice", "Engineering")
  (2, "Bob", "Sales")
> .rel employees
Relation: employees
  Columns: ["col0", "col1", "col2"]
  Total rows: 2
  Preview (first 2):
    (1, "Alice", "Engineering")
    (2, "Bob", "Sales")
> +projects(id: int, name: string).
Schema 'projects' declared (persistent).
> +projects[(100, "ProjectA"), (101, "ProjectB")].
Inserted 2 fact(s) into 'projects'.
> ?- projects(Id, Name).
2 rows:
  (100, "ProjectA")
  (101, "ProjectB")
> .rel
Relations:
  employees (arity: 3)
  projects (arity: 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_arity_n24t04
Knowledge graph 'test_arity_n24t04' dropped.
