Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_concat_n35t06
Knowledge graph 'test_concat_n35t06' created.
Switched to knowledge graph: test_concat_n35t06
> .kg use test_concat_n35t06
Switched to knowledge graph: test_concat_n35t06
> +parts[("hello", " ", "world"), ("foo", "", "bar")].
Inserted 2 fact(s) into 'parts'.
> concat_result(A, B, C, R) :- parts(A, B, C), R = CONCAT(A, B, C).
2 rows:
  ("foo", "", "bar", "foobar")
  ("hello", " ", "world", "hello world")
(session: 1 rule(s))
> ?- concat_result(A, B, C, R).
2 rows:
  ("foo", "", "bar", "foobar")
  ("hello", " ", "world", "hello world")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_concat_n35t06
Knowledge graph 'test_concat_n35t06' dropped.
