Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_case_n35t07
Knowledge graph 'test_case_n35t07' created.
Switched to knowledge graph: test_case_n35t07
> .kg use test_case_n35t07
Switched to knowledge graph: test_case_n35t07
> +words[("Hello",), ("WORLD",), ("MiXeD",)].
Inserted 3 fact(s) into 'words'.
> upper_result(S, U) :- words(S), U = UPPER(S).
3 rows:
  ("Hello", "HELLO")
  ("MiXeD", "MIXED")
  ("WORLD", "WORLD")
(session: 1 rule(s))
> lower_result(S, L) :- words(S), L = LOWER(S).
3 rows:
  ("Hello", "hello")
  ("MiXeD", "mixed")
  ("WORLD", "world")
(session: 2 rule(s))
> ?- upper_result(S, U).
3 rows:
  ("Hello", "HELLO")
  ("MiXeD", "MIXED")
  ("WORLD", "WORLD")
> ?- lower_result(S, L).
3 rows:
  ("Hello", "hello")
  ("MiXeD", "mixed")
  ("WORLD", "world")
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_case_n35t07
Knowledge graph 'test_case_n35t07' dropped.
