Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_trim_n35t08
Knowledge graph 'test_trim_n35t08' created.
Switched to knowledge graph: test_trim_n35t08
> .kg use test_trim_n35t08
Switched to knowledge graph: test_trim_n35t08
> +words[("  hello  ",), ("world",), (" spaced ",)].
Inserted 3 fact(s) into 'words'.
> trim_result(S, T) :- words(S), T = TRIM(S).
3 rows:
  ("  hello  ", "hello")
  (" spaced ", "spaced")
  ("world", "world")
(session: 1 rule(s))
> ?- trim_result(S, T).
3 rows:
  ("  hello  ", "hello")
  (" spaced ", "spaced")
  ("world", "world")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_trim_n35t08
Knowledge graph 'test_trim_n35t08' dropped.
