Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_starts_n35t20
Knowledge graph 'test_starts_n35t20' created.
Switched to knowledge graph: test_starts_n35t20
> .kg use test_starts_n35t20
Switched to knowledge graph: test_starts_n35t20
> +words[("hello",), ("help",), ("world",), ("held",)]
Inserted 4 fact(s) into 'words'.
> starts_hel(W) <- words(W), STARTS_WITH(W, "hel")
No results.
(session: 1 rule(s))
> ?starts_hel(W)
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_starts_n35t20
Knowledge graph 'test_starts_n35t20' dropped.
