Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ends_n35t21
Knowledge graph 'test_ends_n35t21' created.
Switched to knowledge graph: test_ends_n35t21
> .kg use test_ends_n35t21
Switched to knowledge graph: test_ends_n35t21
> +files[("test.txt",), ("data.csv",), ("report.txt",), ("image.png",)].
Inserted 4 fact(s) into 'files'.
> txt_files(F) :- files(F), ENDS_WITH(F, ".txt").
No results.
(session: 1 rule(s))
> ?- txt_files(F).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_ends_n35t21
Knowledge graph 'test_ends_n35t21' dropped.
