Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_string_path_n35t25
Knowledge graph 'test_string_path_n35t25' created.
Switched to knowledge graph: test_string_path_n35t25
> .kg use test_string_path_n35t25
Switched to knowledge graph: test_string_path_n35t25
> +paths[("/home/user/file.txt",), ("/var/log/app.log",)]
Inserted 2 fact(s) into 'paths'.
> path_info(P, L) <- paths(P), L = LEN(P)
┌───────────────────────┬────┐
│ X                     │ Y  │
├───────────────────────┼────┤
│ "/home/user/file.txt" │ 19 │
│ "/var/log/app.log"    │ 16 │
└───────────────────────┴────┘
2 rows
(session: 1 rule(s))
> ?path_info(P, L)
┌───────────────────────┬────┐
│ P                     │ L  │
├───────────────────────┼────┤
│ "/home/user/file.txt" │ 19 │
│ "/var/log/app.log"    │ 16 │
└───────────────────────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_string_path_n35t25
Knowledge graph 'test_string_path_n35t25' dropped.
