Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_special_chars_n35t29
Knowledge graph 'test_special_chars_n35t29' created.
Switched to knowledge graph: test_special_chars_n35t29
> .kg use test_special_chars_n35t29
Switched to knowledge graph: test_special_chars_n35t29
> +text[(1, "line1\nline2"), (2, "tab\there"), (3, "quote: \"hello\"")]
Inserted 3 fact(s) into 'text'.
> ?text(Id, T)
┌────┬────────────────────┐
│ Id │ T                  │
├────┼────────────────────┤
│  1 │ "line1\nline2"     │
│  2 │ "tab\there"        │
│  3 │ "quote: \"hello\"" │
└────┴────────────────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_special_chars_n35t29
Knowledge graph 'test_special_chars_n35t29' dropped.
