Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_string_n35t30
Knowledge graph 'test_empty_string_n35t30' created.
Switched to knowledge graph: test_empty_string_n35t30
> .kg use test_empty_string_n35t30
Switched to knowledge graph: test_empty_string_n35t30
> +name[(1, "alice"), (2, ""), (3, "bob"), (4, "")]
Inserted 4 fact(s) into 'name'.
> ?name(Id, N)
┌────┬─────────┐
│ Id │ N       │
├────┼─────────┤
│  1 │ "alice" │
│  2 │ ""      │
│  3 │ "bob"   │
│  4 │ ""      │
└────┴─────────┘
4 rows
> empty(Id) <- name(Id, N), N = ""
┌───┐
│ X │
├───┤
│ 2 │
│ 4 │
└───┘
2 rows
(session: 1 rule(s))
> ?empty(Id)
┌────┐
│ Id │
├────┤
│  2 │
│  4 │
└────┘
2 rows
> nonempty(Id, N) <- name(Id, N), N != ""
┌───┬─────────┐
│ X │ Y       │
├───┼─────────┤
│ 1 │ "alice" │
│ 3 │ "bob"   │
└───┴─────────┘
2 rows
(session: 2 rule(s))
> ?nonempty(Id, N)
┌────┬─────────┐
│ Id │ N       │
├────┼─────────┤
│  1 │ "alice" │
│  3 │ "bob"   │
└────┴─────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_empty_string_n35t30
Knowledge graph 'test_empty_string_n35t30' dropped.
