Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_escapes_n35t32
Knowledge graph 'test_escapes_n35t32' created.
Switched to knowledge graph: test_escapes_n35t32
> .kg use test_escapes_n35t32
Switched to knowledge graph: test_escapes_n35t32
> +quote_strings[(1, "He said \"hello\""), (2, "Contains \"quotes\" inside")]
Inserted 2 fact(s) into 'quote_strings'.
> ?quote_strings(Id, S)
┌────┬──────────────────────────────┐
│ Id │ S                            │
├────┼──────────────────────────────┤
│  1 │ "He said \"hello\""          │
│  2 │ "Contains \"quotes\" inside" │
└────┴──────────────────────────────┘
2 rows
> +newline_strings[(1, "line1\nline2"), (2, "first\nsecond\nthird")]
Inserted 2 fact(s) into 'newline_strings'.
> ?newline_strings(Id, S)
┌────┬────────────────────────┐
│ Id │ S                      │
├────┼────────────────────────┤
│  1 │ "line1\nline2"         │
│  2 │ "first\nsecond\nthird" │
└────┴────────────────────────┘
2 rows
> +tab_strings[(1, "col1\tcol2"), (2, "name\tage\tcity")]
Inserted 2 fact(s) into 'tab_strings'.
> ?tab_strings(Id, S)
┌────┬───────────────────┐
│ Id │ S                 │
├────┼───────────────────┤
│  1 │ "col1\tcol2"      │
│  2 │ "name\tage\tcity" │
└────┴───────────────────┘
2 rows
> +cr_strings[(1, "windows\r\nstyle"), (2, "old\rmac")]
Inserted 2 fact(s) into 'cr_strings'.
> ?cr_strings(Id, S)
┌────┬────────────────────┐
│ Id │ S                  │
├────┼────────────────────┤
│  1 │ "windows\r\nstyle" │
│  2 │ "old\rmac"         │
└────┴────────────────────┘
2 rows
> +mixed_escapes[(1, "path\\to\\file\twith \"tabs\""), (2, "line1\nline2\twith\ttabs")]
Inserted 2 fact(s) into 'mixed_escapes'.
> ?mixed_escapes(Id, S)
┌────┬─────────────────────────────────┐
│ Id │ S                               │
├────┼─────────────────────────────────┤
│  1 │ "path\\to\\file\twith \"tabs\"" │
│  2 │ "line1\nline2\twith\ttabs"      │
└────┴─────────────────────────────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_escapes_n35t32
Knowledge graph 'test_escapes_n35t32' dropped.
