Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_quotes_n35t33
Knowledge graph 'test_str_quotes_n35t33' created.
Switched to knowledge graph: test_str_quotes_n35t33
> .kg use test_str_quotes_n35t33
Switched to knowledge graph: test_str_quotes_n35t33
> +messages[(1, "He said \"hello\""), (2, "It's fine"), (3, "A 'quote' here")]
Inserted 3 fact(s) into 'messages'.
> ?messages(Id, Msg)
┌──────┬─────────────────────┐
│ col0 │ col1                │
├──────┼─────────────────────┤
│    1 │ "He said \"hello\"" │
│    2 │ "It's fine"         │
│    3 │ "A 'quote' here"    │
└──────┴─────────────────────┘
3 rows
> +simple[(1, "no quotes here"), (2, "plain text")]
Inserted 2 fact(s) into 'simple'.
> ?simple(Id, Text)
┌──────┬──────────────────┐
│ col0 │ col1             │
├──────┼──────────────────┤
│    1 │ "no quotes here" │
│    2 │ "plain text"     │
└──────┴──────────────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_quotes_n35t33
Knowledge graph 'test_str_quotes_n35t33' dropped.
