Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_multiline_n35t34
Knowledge graph 'test_multiline_n35t34' created.
Switched to knowledge graph: test_multiline_n35t34
> .kg use test_multiline_n35t34
Switched to knowledge graph: test_multiline_n35t34
> +text[("line1\nline2",), ("single",)]
Inserted 2 fact(s) into 'text'.
> ?text(T)
┌────────────────┐
│ T              │
├────────────────┤
│ "line1\nline2" │
│ "single"       │
└────────────────┘
2 rows
> has_newline(T) <- text(T), T = "line1\nline2"
┌────────────────┐
│ X              │
├────────────────┤
│ "line1\nline2" │
└────────────────┘
1 rows
(session: 1 rule(s))
> ?has_newline(T)
┌────────────────┐
│ T              │
├────────────────┤
│ "line1\nline2" │
└────────────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_multiline_n35t34
Knowledge graph 'test_multiline_n35t34' dropped.
