Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_to_float_basic_n34t01
Knowledge graph 'test_to_float_basic_n34t01' created.
Switched to knowledge graph: test_to_float_basic_n34t01
> .kg use test_to_float_basic_n34t01
Switched to knowledge graph: test_to_float_basic_n34t01
> +scores[(100,), (200,), (33,)]
Inserted 3 fact(s) into 'scores'.
> float_score(X, Y) <- scores(X), Y = to_float(X)
┌─────┬───────┐
│ X   │ Y     │
├─────┼───────┤
│  33 │  33.0 │
│ 100 │ 100.0 │
│ 200 │ 200.0 │
└─────┴───────┘
3 rows
(session: 1 rule(s))
> ?float_score(X, Y)
┌─────┬───────┐
│ X   │ Y     │
├─────┼───────┤
│  33 │  33.0 │
│ 100 │ 100.0 │
│ 200 │ 200.0 │
└─────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_to_float_basic_n34t01
Knowledge graph 'test_to_float_basic_n34t01' dropped.
