Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_to_float_rules_n34t03
Knowledge graph 'test_to_float_rules_n34t03' created.
Switched to knowledge graph: test_to_float_rules_n34t03
> .kg use test_to_float_rules_n34t03
Switched to knowledge graph: test_to_float_rules_n34t03
> +stats[("a", 10, 50), ("b", 25, 100), ("c", 3, 10)]
Inserted 3 fact(s) into 'stats'.
> float_count(Name, FC) <- stats(Name, Count, _Total), FC = to_float(Count)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│ "a"  │ 10.0 │
│ "b"  │ 25.0 │
│ "c"  │  3.0 │
└──────┴──────┘
3 rows
(session: 1 rule(s))
> float_total(Name, FT) <- stats(Name, _Count, Total), FT = to_float(Total)
┌──────┬───────┐
│ col0 │ col1  │
├──────┼───────┤
│ "a"  │  50.0 │
│ "b"  │ 100.0 │
│ "c"  │  10.0 │
└──────┴───────┘
3 rows
(session: 2 rule(s))
> ?float_count(Name, FC)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│ "a"  │ 10.0 │
│ "b"  │ 25.0 │
│ "c"  │  3.0 │
└──────┴──────┘
3 rows
> ?float_total(Name, FT)
┌──────┬───────┐
│ col0 │ col1  │
├──────┼───────┤
│ "a"  │  50.0 │
│ "b"  │ 100.0 │
│ "c"  │  10.0 │
└──────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_to_float_rules_n34t03
Knowledge graph 'test_to_float_rules_n34t03' dropped.
