Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_to_int_float_n34t04
Knowledge graph 'test_to_int_float_n34t04' created.
Switched to knowledge graph: test_to_int_float_n34t04
> .kg use test_to_int_float_n34t04
Switched to knowledge graph: test_to_int_float_n34t04
> +vals[(3.7,), (-3.7,), (0.9,), (-0.9,), (100.99,)]
Inserted 5 fact(s) into 'vals'.
> truncated(X, Y) <- vals(X), Y = to_int(X)
┌────────┬──────┐
│ col0   │ col1 │
├────────┼──────┤
│   -3.7 │   -3 │
│   -0.9 │    0 │
│    0.9 │    0 │
│    3.7 │    3 │
│ 100.99 │  100 │
└────────┴──────┘
5 rows
(session: 1 rule(s))
> ?truncated(X, Y)
┌────────┬──────┐
│ col0   │ col1 │
├────────┼──────┤
│   -3.7 │   -3 │
│   -0.9 │    0 │
│    0.9 │    0 │
│    3.7 │    3 │
│ 100.99 │  100 │
└────────┴──────┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_to_int_float_n34t04
Knowledge graph 'test_to_int_float_n34t04' dropped.
