Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_time_now
Knowledge graph 'test_time_now' created.
Switched to knowledge graph: test_time_now
> .kg use test_time_now
Switched to knowledge graph: test_time_now
> +ref[(1, 1736640000000)].
Inserted 1 fact(s) into 'ref'.
> valid_ref(Id, RefTime) :- ref(Id, RefTime), Now = time_now(), Now > RefTime.
1 rows:
  (1, 1736640000000)
(session: 1 rule(s))
> ?- valid_ref(Id, RefTime).
1 rows:
  (1, 1736640000000)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_time_now
Knowledge graph 'test_time_now' dropped.
