Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_time_diff_n29t02
Knowledge graph 'test_time_diff_n29t02' created.
Switched to knowledge graph: test_time_diff_n29t02
> .kg use test_time_diff_n29t02
Switched to knowledge graph: test_time_diff_n29t02
> +timestamps[(1, 1000, 500), (2, 2000, 1500), (3, 1000, 1000)].
Inserted 3 fact(s) into 'timestamps'.
> result(Id, Diff) :- timestamps(Id, T1, T2), Diff = time_diff(T1, T2).
3 rows:
  (1, 500)
  (2, 500)
  (3, 0)
(session: 1 rule(s))
> ?- result(Id, Diff).
3 rows:
  (1, 500)
  (2, 500)
  (3, 0)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_time_diff_n29t02
Knowledge graph 'test_time_diff_n29t02' dropped.
