Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_decay_linear
Knowledge graph 'test_decay_linear' created.
Switched to knowledge graph: test_decay_linear
> .kg use test_decay_linear
Switched to knowledge graph: test_decay_linear
> +events[(1, 10000, 10000, 10000), (2, 5000, 10000, 10000), (3, 0, 10000, 10000)].
Inserted 3 fact(s) into 'events'.
> linear_result(Id, Weight) :- events(Id, Ts, Now, MaxAge), Weight = time_decay_linear(Ts, Now, MaxAge).
3 rows:
  (1, 1.0)
  (2, 0.5)
  (3, 0.0)
(session: 1 rule(s))
> ?- linear_result(Id, Weight).
3 rows:
  (1, 1.0)
  (2, 0.5)
  (3, 0.0)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_decay_linear
Knowledge graph 'test_decay_linear' dropped.
