Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_time_cmp_n29t06
Knowledge graph 'test_time_cmp_n29t06' created.
Switched to knowledge graph: test_time_cmp_n29t06
> .kg use test_time_cmp_n29t06
Switched to knowledge graph: test_time_cmp_n29t06
> +pairs[(1, 100, 200), (2, 200, 100), (3, 100, 100)].
Inserted 3 fact(s) into 'pairs'.
> before_result(Id) :- pairs(Id, T1, T2), time_before(T1, T2).
No results.
(session: 1 rule(s))
> ?- before_result(Id).
No results.
> after_result(Id) :- pairs(Id, T1, T2), time_after(T1, T2).
No results.
(session: 2 rule(s))
> ?- after_result(Id).
No results.
> +ranges[(1, 150, 100, 200), (2, 100, 100, 200), (3, 200, 100, 200), (4, 50, 100, 200)].
Inserted 4 fact(s) into 'ranges'.
> between_result(Id) :- ranges(Id, Ts, Start, End), time_between(Ts, Start, End).
No results.
(session: 3 rule(s))
> ?- between_result(Id).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_time_cmp_n29t06
Knowledge graph 'test_time_cmp_n29t06' dropped.
