Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_interval_dur_n29t10
Knowledge graph 'test_interval_dur_n29t10' created.
Switched to knowledge graph: test_interval_dur_n29t10
> .kg use test_interval_dur_n29t10
Switched to knowledge graph: test_interval_dur_n29t10
> +intervals[(1, 100, 200), (2, 0, 1000), (3, 500, 500)]
Inserted 3 fact(s) into 'intervals'.
> duration_result(Id, Duration) <- intervals(Id, Start, End), Duration = interval_duration(Start, End)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │  100 │
│    2 │ 1000 │
│    3 │    0 │
└──────┴──────┘
3 rows
(session: 1 rule(s))
> ?duration_result(Id, Duration)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │  100 │
│    2 │ 1000 │
│    3 │    0 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_interval_dur_n29t10
Knowledge graph 'test_interval_dur_n29t10' dropped.
