Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_seq
Knowledge graph 'test_seq' created.
Switched to knowledge graph: test_seq
> .kg use test_seq
Switched to knowledge graph: test_seq
> +events[(1, "login", 100), (2, "click", 110), (3, "purchase", 120), (4, "logout", 200)].
Inserted 4 fact(s) into 'events'.
> post_login(Id, Action, Time) :- events(_, "login", LoginTime), events(Id, Action, Time), Time > LoginTime, Action != "login".
3 rows:
  (2, "click", 110)
  (3, "purchase", 120)
  (4, "logout", 200)
(session: 1 rule(s))
> ?- post_login(Id, Action, Time).
3 rows:
  (2, "click", 110)
  (3, "purchase", 120)
  (4, "logout", 200)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_seq
Knowledge graph 'test_seq' dropped.
