Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_time_edge_n29t13
Knowledge graph 'test_time_edge_n29t13' created.
Switched to knowledge graph: test_time_edge_n29t13
> .kg use test_time_edge_n29t13
Switched to knowledge graph: test_time_edge_n29t13
> +events[(1, 1000000), (2, 1000000), (3, 2000000)].
Inserted 3 fact(s) into 'events'.
> time_diff(A, B, D) :- events(A, T1), events(B, T2), A < B, D = T2 - T1.
3 rows:
  (1, 2, 0)
  (1, 3, 1000000)
  (2, 3, 1000000)
(session: 1 rule(s))
> ?- time_diff(A, B, D).
3 rows:
  (1, 2, 0)
  (1, 3, 1000000)
  (2, 3, 1000000)
> same_time(A, B) :- events(A, T), events(B, T), A < B.
1 rows:
  (1, 2)
(session: 2 rule(s))
> ?- same_time(A, B).
1 rows:
  (1, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_time_edge_n29t13
Knowledge graph 'test_time_edge_n29t13' dropped.
