Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_event_order
Knowledge graph 'test_event_order' created.
Switched to knowledge graph: test_event_order
> .kg use test_event_order
Switched to knowledge graph: test_event_order
> +events[(1, "login", 1000), (2, "click", 1100), (3, "logout", 1500), (4, "error", 1050)].
Inserted 4 fact(s) into 'events'.
> before_logout(Id, Action, Time) :- events(Id, Action, Time), events(_, "logout", LogoutTime), Time < LogoutTime.
3 rows:
  (1, "login", 1000)
  (2, "click", 1100)
  (4, "error", 1050)
(session: 1 rule(s))
> ?- before_logout(Id, Action, Time).
3 rows:
  (1, "login", 1000)
  (2, "click", 1100)
  (4, "error", 1050)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_event_order
Knowledge graph 'test_event_order' dropped.
