Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_session_dur_n29t16
Knowledge graph 'test_session_dur_n29t16' created.
Switched to knowledge graph: test_session_dur_n29t16
> .kg use test_session_dur_n29t16
Switched to knowledge graph: test_session_dur_n29t16
> +sessions[(1, "start", 1000), (1, "end", 1500), (2, "start", 2000), (2, "end", 2300)].
Inserted 4 fact(s) into 'sessions'.
> session_duration(SessId, Duration) :- sessions(SessId, "start", StartTime), sessions(SessId, "end", EndTime), Duration = EndTime - StartTime.
2 rows:
  (1, 500)
  (2, 300)
(session: 1 rule(s))
> ?- session_duration(SessId, Duration).
2 rows:
  (1, 500)
  (2, 300)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_session_dur_n29t16
Knowledge graph 'test_session_dur_n29t16' dropped.
