Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_point_in_interval_n29t20
Knowledge graph 'test_point_in_interval_n29t20' created.
Switched to knowledge graph: test_point_in_interval_n29t20
> .kg use test_point_in_interval_n29t20
Switched to knowledge graph: test_point_in_interval_n29t20
> +event[(1, 150, 100, 200), (2, 50, 100, 200), (3, 200, 100, 200), (4, 100, 100, 200)]
Inserted 4 fact(s) into 'event'.
> valid_event(Id, Ts) <- event(Id, Ts, Start, End), point_in_interval(Ts, Start, End)
No results.
(session: 1 rule(s))
> ?valid_event(Id, Ts)
No results.
> in_range(Id, Ts, InRange) <- event(Id, Ts, Start, End), InRange = point_in_interval(Ts, Start, End)
┌──────┬──────┬───────┐
│ col0 │ col1 │ col2  │
├──────┼──────┼───────┤
│    1 │  150 │ true  │
│    2 │   50 │ false │
│    3 │  200 │ true  │
│    4 │  100 │ true  │
└──────┴──────┴───────┘
4 rows
(session: 2 rule(s))
> ?in_range(Id, Ts, InRange)
┌──────┬──────┬───────┐
│ col0 │ col1 │ col2  │
├──────┼──────┼───────┤
│    1 │  150 │ true  │
│    2 │   50 │ false │
│    3 │  200 │ true  │
│    4 │  100 │ true  │
└──────┴──────┴───────┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_point_in_interval_n29t20
Knowledge graph 'test_point_in_interval_n29t20' dropped.
