Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_unified_rules_n25t02
Knowledge graph 'test_unified_rules_n25t02' created.
Switched to knowledge graph: test_unified_rules_n25t02
> .kg use test_unified_rules_n25t02
Switched to knowledge graph: test_unified_rules_n25t02
> +edge(1, 2)
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3)
Inserted 1 fact(s) into 'edge'.
> +edge(3, 4)
Inserted 1 fact(s) into 'edge'.
> +edge(1, 3)
Inserted 1 fact(s) into 'edge'.
> +reachable(X, Y) <- edge(X, Y)
Rule 'reachable' registered.
> +reachable(X, Z) <- reachable(X, Y), edge(Y, Z)
Rule 'reachable' registered.
> ?reachable(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 4 │
└───┴───┘
6 rows
> -reachable
Rule 'reachable' dropped.
> .rule
No rules defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_unified_rules_n25t02
Knowledge graph 'test_unified_rules_n25t02' dropped.
