Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_unified_rules
Knowledge graph 'test_unified_rules' created.
Switched to knowledge graph: test_unified_rules
> .kg use test_unified_rules
Switched to knowledge graph: test_unified_rules
> +edge(1, 2).
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3).
Inserted 1 fact(s) into 'edge'.
> +edge(3, 4).
Inserted 1 fact(s) into 'edge'.
> +edge(1, 3).
Inserted 1 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> ?- reachable(X, Y).
6 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 3)
  (2, 4)
  (3, 4)
> -reachable.
Rule 'reachable' deleted.
> .rule
No rules defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_unified_rules
Knowledge graph 'test_unified_rules' dropped.
