Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mixed_n25t03
Knowledge graph 'test_mixed_n25t03' created.
Switched to knowledge graph: test_mixed_n25t03
> .kg use test_mixed_n25t03
Switched to knowledge graph: test_mixed_n25t03
> +base[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'base'.
> +doubled(X, Y) :- base(X), Y = X * 2.
Rule 'doubled' registered.
> tripled(X, Y) :- base(X), Y = X * 3.
3 rows:
  (1, 3)
  (2, 6)
  (3, 9)
(session: 1 rule(s))
> ?- doubled(X, Y).
3 rows:
  (1, 2)
  (2, 4)
  (3, 6)
> ?- tripled(X, Y).
3 rows:
  (1, 3)
  (2, 6)
  (3, 9)
> .rule
Rules:
  doubled (1 clause(s))
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_mixed_n25t03
Knowledge graph 'test_mixed_n25t03' dropped.
