Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_schema_constraints
Knowledge graph 'test_schema_constraints' created.
Switched to knowledge graph: test_schema_constraints
> .kg use test_schema_constraints
Switched to knowledge graph: test_schema_constraints
> +user(id: int @key, name: string, email: string @unique).
Schema 'user' declared (persistent).
> +product(sku: string @key, name: string @not_empty, price: int).
Schema 'product' declared (persistent).
> +user[(1, "Alice", "alice@example.com"), (2, "Bob", "bob@example.com")].
Inserted 2 fact(s) into 'user'.
> +product[("SKU001", "Widget", 100), ("SKU002", "Gadget", 200)].
Inserted 2 fact(s) into 'product'.
> ?- user(Id, Name, Email).
2 rows:
  (1, "Alice", "alice@example.com")
  (2, "Bob", "bob@example.com")
> ?- product(Sku, Name, Price).
2 rows:
  ("SKU001", "Widget", 100)
  ("SKU002", "Gadget", 200)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_schema_constraints
Knowledge graph 'test_schema_constraints' dropped.
