Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_load
Knowledge graph 'test_load' created.
Switched to knowledge graph: test_load
> .kg use test_load
Switched to knowledge graph: test_load
> +edge(1, 2).
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3).
Inserted 1 fact(s) into 'edge'.
> +edge(3, 4).
Inserted 1 fact(s) into 'edge'.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_load
Knowledge graph 'test_load' dropped.
