Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_load_n25t05
Knowledge graph 'test_load_n25t05' created.
Switched to knowledge graph: test_load_n25t05
> .kg use test_load_n25t05
Switched to knowledge graph: test_load_n25t05
> +edge(1, 2)
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3)
Inserted 1 fact(s) into 'edge'.
> +edge(3, 4)
Inserted 1 fact(s) into 'edge'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_load_n25t05
Knowledge graph 'test_load_n25t05' dropped.
