Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_schema_vs_data_n25t06
Knowledge graph 'test_schema_vs_data_n25t06' created.
Switched to knowledge graph: test_schema_vs_data_n25t06
> .kg use test_schema_vs_data_n25t06
Switched to knowledge graph: test_schema_vs_data_n25t06
> +person(id: int, name: string, age: int)
Schema for 'person' registered with 3 columns (persistent)
> +person(1, "Alice", 30)
Inserted 1 fact(s) into 'person'.
> +person(2, "Bob", 25)
Inserted 1 fact(s) into 'person'.
> ?person(Id, Name, Age)
┌────┬─────────┬─────┐
│ id │ name    │ age │
├────┼─────────┼─────┤
│  1 │ "Alice" │  30 │
│  2 │ "Bob"   │  25 │
└────┴─────────┴─────┘
2 rows
> +product(sku: string, price: int)
Schema for 'product' registered with 2 columns (persistent)
> +product("SKU001", 100)
Inserted 1 fact(s) into 'product'.
> +product("SKU002", 200)
Inserted 1 fact(s) into 'product'.
> ?product(Sku, Price)
┌──────────┬───────┐
│ sku      │ price │
├──────────┼───────┤
│ "SKU001" │   100 │
│ "SKU002" │   200 │
└──────────┴───────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_schema_vs_data_n25t06
Knowledge graph 'test_schema_vs_data_n25t06' dropped.
