Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_mixed_rules_n25t07
Knowledge graph 'test_mixed_rules_n25t07' created.
Switched to knowledge graph: test_mixed_rules_n25t07
> .kg use test_mixed_rules_n25t07
Switched to knowledge graph: test_mixed_rules_n25t07
> +base[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'base'.
> +step1(X, Y) <- base(X, Y), Y > 10
Rule 'step1' registered.
> step2(X, Z) <- step1(X, Y), Z = Y + 5
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 2 │ 25 │
│ 3 │ 35 │
└───┴────┘
2 rows
(session: 1 rule(s))
> ?step1(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 2 │ 20 │
│ 3 │ 30 │
└───┴────┘
2 rows
> ?step2(X, Z)
┌───┬────┐
│ X │ Z  │
├───┼────┤
│ 2 │ 25 │
│ 3 │ 35 │
└───┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_mixed_rules_n25t07
Knowledge graph 'test_mixed_rules_n25t07' dropped.
