Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_err
Knowledge graph 'test_err' created.
Switched to knowledge graph: test_err
> .kg use test_err
Switched to knowledge graph: test_err
> ?- nonexistent(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_err
Knowledge graph 'test_err' dropped.
