Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_err_n12t01
Knowledge graph 'test_err_n12t01' created.
Switched to knowledge graph: test_err_n12t01
> .kg use test_err_n12t01
Switched to knowledge graph: test_err_n12t01
> ?- nonexistent(X, Y).
No results.
> +nonexistent[(1, 2)].
Inserted 1 fact(s) into 'nonexistent'.
> ?- nonexistent(X, Y).
1 rows:
  (1, 2)
> ?- nonexistent(X, Y, Z).
1 rows:
  (1, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_err_n12t01
Knowledge graph 'test_err_n12t01' dropped.
