Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_dup_err_n12t03
Knowledge graph 'test_dup_err_n12t03' created.
Switched to knowledge graph: test_dup_err_n12t03
> .kg use test_dup_err_n12t03
Switched to knowledge graph: test_dup_err_n12t03
> .kg create test_dup_err_n12t03
Create failed: Knowledge graph already exists: test_dup_err_n12t03
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dup_err_n12t03
Knowledge graph 'test_dup_err_n12t03' dropped.
