> .db create test_str_err
Database 'test_str_err' created.
Switched to database: test_str_err
> .db use test_str_err
Switched to database: test_str_err
> +person[("alice", 25), ("bob", 30)].
Inserted 2 facts into 'person'.
> .db use default
Switched to database: default
> .db drop test_str_err
Database 'test_str_err' dropped.
