Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_err
Knowledge graph 'test_str_err' created.
Switched to knowledge graph: test_str_err
> .kg use test_str_err
Switched to knowledge graph: test_str_err
> +person[("alice", 25), ("bob", 30)].
Inserted 2 fact(s) into 'person'.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_err
Knowledge graph 'test_str_err' dropped.
