Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty
Knowledge graph 'test_empty' created.
Switched to knowledge graph: test_empty
> .kg use test_empty
Switched to knowledge graph: test_empty
> +empty[].
Inserted 0 fact(s) into 'empty'.
> ?- empty(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty
Knowledge graph 'test_empty' dropped.
