Executing script: examples/datalog/12_errors/07_empty_insert_error.dl

> .db create test_empty
Database 'test_empty' created.
Switched to database: test_empty
> .db use test_empty
Switched to database: test_empty
> ?- empty(X, Y).
No results.
> .db use default
Switched to database: default
> .db drop test_empty
Database 'test_empty' dropped.
