Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_n12t07
Knowledge graph 'test_empty_n12t07' created.
Switched to knowledge graph: test_empty_n12t07
> .kg use test_empty_n12t07
Switched to knowledge graph: test_empty_n12t07
> +empty[].
Inserted 0 fact(s) into 'empty'.
> ?- empty(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty_n12t07
Knowledge graph 'test_empty_n12t07' dropped.
