Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_div_zero_n12t08
Knowledge graph 'test_div_zero_n12t08' created.
Switched to knowledge graph: test_div_zero_n12t08
> .kg use test_div_zero_n12t08
Switched to knowledge graph: test_div_zero_n12t08
> +numbers[(10), (20), (0), (5)]
Inserted 4 fact(s) into 'numbers'.
> +pairs[(10, 2), (20, 4), (15, 0), (8, 2)]
Inserted 4 fact(s) into 'pairs'.
> safe_div(X, Y, X/Y) <- pairs(X, Y), Y != 0
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    8 │    2 │  4.0 │
│   10 │    2 │  5.0 │
│   20 │    4 │  5.0 │
└──────┴──────┴──────┘
3 rows
(session: 1 rule(s))
> ?safe_div(A, B, C)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    8 │    2 │  4.0 │
│   10 │    2 │  5.0 │
│   20 │    4 │  5.0 │
└──────┴──────┴──────┘
3 rows
> all_div(X, Y, X/Y) <- pairs(X, Y)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    8 │    2 │ 4.0  │
│   10 │    2 │ 5.0  │
│   15 │    0 │ null │
│   20 │    4 │ 5.0  │
└──────┴──────┴──────┘
4 rows
(session: 2 rule(s))
> ?all_div(A, B, C)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    8 │    2 │ 4.0  │
│   10 │    2 │ 5.0  │
│   15 │    0 │ null │
│   20 │    4 │ 5.0  │
└──────┴──────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_div_zero_n12t08
Knowledge graph 'test_div_zero_n12t08' dropped.
