Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_div_zero
Knowledge graph 'test_div_zero' created.
Switched to knowledge graph: test_div_zero
> .kg use test_div_zero
Switched to knowledge graph: test_div_zero
> +numbers[(10), (20), (0), (5)].
Inserted 4 fact(s) into 'numbers'.
> +pairs[(10, 2), (20, 4), (15, 0), (8, 2)].
Inserted 4 fact(s) into 'pairs'.
> safe_div(X, Y, X/Y) :- pairs(X, Y), Y != 0.
3 rows:
  (8, 2, 4.0)
  (10, 2, 5.0)
  (20, 4, 5.0)
(session: 1 rule(s))
> ?- safe_div(A, B, C).
3 rows:
  (8, 2, 4.0)
  (10, 2, 5.0)
  (20, 4, 5.0)
> all_div(X, Y, X/Y) :- pairs(X, Y).
4 rows:
  (8, 2, 4.0)
  (10, 2, 5.0)
  (15, 0, null)
  (20, 4, 5.0)
(session: 2 rule(s))
> ?- all_div(A, B, C).
4 rows:
  (8, 2, 4.0)
  (10, 2, 5.0)
  (15, 0, null)
  (20, 4, 5.0)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_div_zero
Knowledge graph 'test_div_zero' dropped.
