Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_overflow_n12t09
Knowledge graph 'test_overflow_n12t09' created.
Switched to knowledge graph: test_overflow_n12t09
> .kg use test_overflow_n12t09
Switched to knowledge graph: test_overflow_n12t09
> +large_nums[(1000000000), (2000000000), (3000000000)]
Inserted 3 fact(s) into 'large_nums'.
> +mult_result(X, Y, X*Y) <- large_nums(X), large_nums(Y), X != Y
Rule 'mult_result' registered.
> ?mult_result(A, B, C)
┌────────────┬────────────┬─────────────────────┐
│ A          │ B          │ C                   │
├────────────┼────────────┼─────────────────────┤
│ 1000000000 │ 2000000000 │ 2000000000000000000 │
│ 1000000000 │ 3000000000 │ 3000000000000000000 │
│ 2000000000 │ 1000000000 │ 2000000000000000000 │
│ 2000000000 │ 3000000000 │ 6000000000000000000 │
│ 3000000000 │ 1000000000 │ 3000000000000000000 │
│ 3000000000 │ 2000000000 │ 6000000000000000000 │
└────────────┴────────────┴─────────────────────┘
6 rows
> +big_add[(1000000000000, 2000000000000), (500000000000, 500000000000)]
Inserted 2 fact(s) into 'big_add'.
> +add_result(X, Y, X+Y) <- big_add(X, Y)
Rule 'add_result' registered.
> ?add_result(A, B, C)
┌───────────────┬───────────────┬───────────────┐
│ A             │ B             │ C             │
├───────────────┼───────────────┼───────────────┤
│  500000000000 │  500000000000 │ 1000000000000 │
│ 1000000000000 │ 2000000000000 │ 3000000000000 │
└───────────────┴───────────────┴───────────────┘
2 rows
> +exp_base[(2, 10), (2, 20), (2, 30)]
Inserted 3 fact(s) into 'exp_base'.
> +power_of_two(X, 1024) <- exp_base(X, 10), X = 2
Rule 'power_of_two' registered.
> ?power_of_two(B, R)
┌───┬──────┐
│ B │ R    │
├───┼──────┤
│ 2 │ 1024 │
└───┴──────┘
1 rows
> +sub_pairs[(100, 200), (50, 100)]
Inserted 2 fact(s) into 'sub_pairs'.
> +sub_result(X, Y, X-Y) <- sub_pairs(X, Y)
Rule 'sub_result' registered.
> ?sub_result(A, B, C)
┌─────┬─────┬──────┐
│ A   │ B   │ C    │
├─────┼─────┼──────┤
│  50 │ 100 │  -50 │
│ 100 │ 200 │ -100 │
└─────┴─────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_overflow_n12t09
Knowledge graph 'test_overflow_n12t09' dropped.
