Executing script: examples/datalog/12_errors/12_deep_nesting_limit.dl

> .db create test_deep_nest
Database 'test_deep_nest' created.
Switched to database: test_deep_nest
> .db use test_deep_nest
Switched to database: test_deep_nest
> +base[(1), (2), (3)].
Inserted 3 facts into 'base'.
> nest5(X, ((((X+1)+1)+1)+1)+1) := base(X).
View 'nest5' registered.
> ?- nest5(A, B).
3 rows:
  (1, 6)
  (2, 7)
  (3, 8)
> nest10(X, ((((((((((X+1)+1)+1)+1)+1)+1)+1)+1)+1)+1) := base(X).
