Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_deep_nest_n12t12
Knowledge graph 'test_deep_nest_n12t12' created.
Switched to knowledge graph: test_deep_nest_n12t12
> .kg use test_deep_nest_n12t12
Switched to knowledge graph: test_deep_nest_n12t12
> +base[(1), (2), (3)]
Inserted 3 fact(s) into 'base'.
> +nest5(X, ((((X+1)+1)+1)+1)+1) <- base(X)
Rule 'nest5' registered.
> ?nest5(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 1 │ 6 │
│ 2 │ 7 │
│ 3 │ 8 │
└───┴───┘
3 rows
> +mixed_nest(X, (((X*2)+3)*2)+1) <- base(X)
Rule 'mixed_nest' registered.
> ?mixed_nest(A, B)
┌───┬────┐
│ A │ B  │
├───┼────┤
│ 1 │ 11 │
│ 2 │ 15 │
│ 3 │ 19 │
└───┴────┘
3 rows
> +add_one(X, X+1) <- base(X)
Rule 'add_one' registered.
> +add_two(X, Y+1) <- add_one(X, Y)
Rule 'add_two' registered.
> +add_three(X, Y+1) <- add_two(X, Y)
Rule 'add_three' registered.
> ?add_three(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 1 │ 4 │
│ 2 │ 5 │
│ 3 │ 6 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_deep_nest_n12t12
Knowledge graph 'test_deep_nest_n12t12' dropped.
