Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_edge_rules_n12t15
Knowledge graph 'test_edge_rules_n12t15' created.
Switched to knowledge graph: test_edge_rules_n12t15
> .kg use test_edge_rules_n12t15
Switched to knowledge graph: test_edge_rules_n12t15
> +trigger[(1)]
Inserted 1 fact(s) into 'trigger'.
> +constant_fact(0, 1) <- trigger(_)
Rule 'constant_fact' registered.
> ?constant_fact(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 0 │ 1 │
└───┴───┘
1 rows
> +source[(1, 100), (2, 100), (3, 100)]
Inserted 3 fact(s) into 'source'.
> +extract_second(Y) <- source(_, Y)
Rule 'extract_second' registered.
> ?extract_second(X)
┌─────┐
│ X   │
├─────┤
│ 100 │
└─────┘
1 rows
> +any_data[(1), (2), (3)]
Inserted 3 fact(s) into 'any_data'.
> +always_true(0, 1) <- any_data(_)
Rule 'always_true' registered.
> ?always_true(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 0 │ 1 │
└───┴───┘
1 rows
> +pairs[(1, 1), (2, 2), (3, 4), (5, 5)]
Inserted 4 fact(s) into 'pairs'.
> +diagonal(X) <- pairs(X, X)
Rule 'diagonal' registered.
> ?diagonal(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 5 │
└───┘
3 rows
> +nums[(1), (2), (3), (4)]
Inserted 4 fact(s) into 'nums'.
> +doubled(X, X*2) <- nums(X)
Rule 'doubled' registered.
> +same_double(X, Y) <- doubled(X, D), doubled(Y, D), X != Y
Rule 'same_double' registered.
> ?same_double(X, Y)
No results.
> +edges[(1, 2), (2, 3), (1, 3)]
Inserted 3 fact(s) into 'edges'.
> +triangle(A, B, C) <- edges(A, B), edges(B, C), edges(A, C), A < B, B < C
Rule 'triangle' registered.
> ?triangle(A, B, C)
┌───┬───┬───┐
│ A │ B │ C │
├───┼───┼───┤
│ 1 │ 2 │ 3 │
└───┴───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_edge_rules_n12t15
Knowledge graph 'test_edge_rules_n12t15' dropped.
