Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_insert_view_n12t21
Knowledge graph 'test_insert_view_n12t21' created.
Switched to knowledge graph: test_insert_view_n12t21
> .kg use test_insert_view_n12t21
Switched to knowledge graph: test_insert_view_n12t21
> +base[(1), (2), (3)]
Inserted 3 fact(s) into 'base'.
> +derived(X) <- base(X), X > 1
Rule 'derived' registered.
> +derived[(99)]
Cannot insert into 'derived': it is a derived relation (view). Use a base relation or drop the rule first with '.rule drop derived'.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_insert_view_n12t21
Knowledge graph 'test_insert_view_n12t21' dropped.
