Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_missing_period_n12t24
Knowledge graph 'test_missing_period_n12t24' created.
Switched to knowledge graph: test_missing_period_n12t24
> .kg use test_missing_period_n12t24
Switched to knowledge graph: test_missing_period_n12t24
> +edge(1, 2)
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3)
Inserted 1 fact(s) into 'edge'.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_missing_period_n12t24
Knowledge graph 'test_missing_period_n12t24' dropped.
