Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arity_query
Knowledge graph 'test_arity_query' created.
Switched to knowledge graph: test_arity_query
> .kg use test_arity_query
Switched to knowledge graph: test_arity_query
> +triple(1, 2, 3).
Inserted 1 fact(s) into 'triple'.
> ?- triple(X, Y).
1 rows:
  (1, 2, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_arity_query
Knowledge graph 'test_arity_query' dropped.
