Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_agg_err_n12t32
Knowledge graph 'test_agg_err_n12t32' created.
Switched to knowledge graph: test_agg_err_n12t32
> .kg use test_agg_err_n12t32
Switched to knowledge graph: test_agg_err_n12t32
> +nums[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'nums'.
> total(sum<X>) <- nums(X)
┌───┐
│ X │
├───┤
│ 6 │
└───┘
1 rows
(session: 1 rule(s))
> ?total(T)
┌───┐
│ T │
├───┤
│ 6 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_agg_err_n12t32
Knowledge graph 'test_agg_err_n12t32' dropped.
