Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dup_head_var
Knowledge graph 'test_dup_head_var' created.
Switched to knowledge graph: test_dup_head_var
> .kg use test_dup_head_var
Switched to knowledge graph: test_dup_head_var
> +data[(1, 1), (2, 2), (3, 4), (4, 4)].
Inserted 4 fact(s) into 'data'.
> +same_pair(X, X) :- data(X, X).
Rule 'same_pair' registered.
> ?- same_pair(A, B).
4 rows:
  (1, 1)
  (2, 2)
  (3, 3)
  (4, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dup_head_var
Knowledge graph 'test_dup_head_var' dropped.
