Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_cycle
Knowledge graph 'test_neg_cycle' created.
Switched to knowledge graph: test_neg_cycle
> .kg use test_neg_cycle
Switched to knowledge graph: test_neg_cycle
> +base(1).
Inserted 1 fact(s) into 'base'.
> a(X) :- base(X), !b(X).
1 rows:
  (1)
(session: 1 rule(s))
> b(X) :- base(X), !a(X).
No results.
(session: 2 rule(s))
> ?- a(X).
1 rows:
  (1)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_neg_cycle
Knowledge graph 'test_neg_cycle' dropped.
