Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_invalid_id
Knowledge graph 'test_invalid_id' created.
Switched to knowledge graph: test_invalid_id
> .kg use test_invalid_id
Switched to knowledge graph: test_invalid_id
> +123invalid(1, 2).
Inserted 1 fact(s) into '123invalid'.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_invalid_id
Knowledge graph 'test_invalid_id' dropped.
