Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_invalid_id_n12t37
Knowledge graph 'test_invalid_id_n12t37' created.
Switched to knowledge graph: test_invalid_id_n12t37
> .kg use test_invalid_id_n12t37
Switched to knowledge graph: test_invalid_id_n12t37
> +123invalid(1, 2)
Inserted 1 fact(s) into '123invalid'.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_invalid_id_n12t37
Knowledge graph 'test_invalid_id_n12t37' dropped.
