Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_unbound_cmp_n12t39
Knowledge graph 'test_unbound_cmp_n12t39' created.
Switched to knowledge graph: test_unbound_cmp_n12t39
> .kg use test_unbound_cmp_n12t39
Switched to knowledge graph: test_unbound_cmp_n12t39
> +data[(1, 10), (2, 20)]
Inserted 2 fact(s) into 'data'.
> bad(X) <- data(X, _), Y > 5
Query execution failed: Variable 'Y' not found in schema ["X", "_ph_data_1"]
> ?bad(X)
Query execution failed: Variable 'Y' not found in schema ["X", "_ph_data_1"]
> .kg use default
Switched to knowledge graph: default
> .kg drop test_unbound_cmp_n12t39
Knowledge graph 'test_unbound_cmp_n12t39' dropped.
