Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arity_err
Knowledge graph 'test_arity_err' created.
Switched to knowledge graph: test_arity_err
> .kg use test_arity_err
Switched to knowledge graph: test_arity_err
> +data[(1, "a", 100)].
Inserted 1 fact(s) into 'data'.
> ?- data(X, Y).
1 rows:
  (1, "a", 100)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_arity_err
Knowledge graph 'test_arity_err' dropped.
