Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arity_err_n12t40
Knowledge graph 'test_arity_err_n12t40' created.
Switched to knowledge graph: test_arity_err_n12t40
> .kg use test_arity_err_n12t40
Switched to knowledge graph: test_arity_err_n12t40
> +data[(1, "a", 100)]
Inserted 1 fact(s) into 'data'.
> ?data(X, Y)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │ "a"  │  100 │
└──────┴──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_arity_err_n12t40
Knowledge graph 'test_arity_err_n12t40' dropped.
