Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_undef_rel
Knowledge graph 'test_undef_rel' created.
Switched to knowledge graph: test_undef_rel
> .kg use test_undef_rel
Switched to knowledge graph: test_undef_rel
> ?- nonexistent_relation(X, Y).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_undef_rel
Knowledge graph 'test_undef_rel' dropped.
