Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_missing_body
Knowledge graph 'test_missing_body' created.
Switched to knowledge graph: test_missing_body
> .kg use test_missing_body
Switched to knowledge graph: test_missing_body
> derived(X) :- undefined_source(X).
No results.
(session: 1 rule(s))
> ?- derived(X).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_missing_body
Knowledge graph 'test_missing_body' dropped.
