Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dup_head_n12t50
Knowledge graph 'test_dup_head_n12t50' created.
Switched to knowledge graph: test_dup_head_n12t50
> .kg use test_dup_head_n12t50
Switched to knowledge graph: test_dup_head_n12t50
> +data[(1, 1), (2, 3), (3, 3)]
Inserted 3 fact(s) into 'data'.
> duplicate_head(X, X) <- data(X, X)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 3 │ 3 │
└───┴───┘
2 rows
(session: 1 rule(s))
> ?duplicate_head(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 1 │ 1 │
│ 3 │ 3 │
└───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_dup_head_n12t50
Knowledge graph 'test_dup_head_n12t50' dropped.
