Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_del_n12t51
Knowledge graph 'test_self_del_n12t51' created.
Switched to knowledge graph: test_self_del_n12t51
> .kg use test_self_del_n12t51
Switched to knowledge graph: test_self_del_n12t51
> +items[(1, 100), (2, 200), (3, 300)].
Inserted 3 fact(s) into 'items'.
> ?- items(Id, Val).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> -items(Id, Val) :- items(Id, Val), Val > 150.
Conditional delete: 2 fact(s) deleted from 'items'.
> ?- items(Id, Val).
1 rows:
  (1, 100)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_self_del_n12t51
Knowledge graph 'test_self_del_n12t51' dropped.
