Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mod_zero_n12t52
Knowledge graph 'test_mod_zero_n12t52' created.
Switched to knowledge graph: test_mod_zero_n12t52
> .kg use test_mod_zero_n12t52
Switched to knowledge graph: test_mod_zero_n12t52
> +nums[(10,), (0,)]
Inserted 2 fact(s) into 'nums'.
> result(X, Y) <- nums(X), Y = 100 % X
┌────┬──────┐
│ X  │ Y    │
├────┼──────┤
│  0 │ null │
│ 10 │ 0    │
└────┴──────┘
2 rows
(session: 1 rule(s))
> ?result(X, Y)
┌────┬──────┐
│ X  │ Y    │
├────┼──────┤
│  0 │ null │
│ 10 │ 0    │
└────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_mod_zero_n12t52
Knowledge graph 'test_mod_zero_n12t52' dropped.
