Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_empty_batch_n12t55
Knowledge graph 'test_empty_batch_n12t55' created.
Switched to knowledge graph: test_empty_batch_n12t55
> .kg use test_empty_batch_n12t55
Switched to knowledge graph: test_empty_batch_n12t55
> +data[]
Inserted 0 fact(s) into 'data'.
> ?data(X)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty_batch_n12t55
Knowledge graph 'test_empty_batch_n12t55' dropped.
