Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_long_name_n12t56
Knowledge graph 'test_long_name_n12t56' created.
Switched to knowledge graph: test_long_name_n12t56
> .kg use test_long_name_n12t56
Switched to knowledge graph: test_long_name_n12t56
> +this_is_a_very_long_relation_name_that_goes_on_for_quite_some_time[(1,), (2,)].
Inserted 2 fact(s) into 'this_is_a_very_long_relation_name_that_goes_on_for_quite_some_time'.
> ?- this_is_a_very_long_relation_name_that_goes_on_for_quite_some_time(X).
2 rows:
  (1)
  (2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_long_name_n12t56
Knowledge graph 'test_long_name_n12t56' dropped.
