Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_unbound_cmp_n12t61
Knowledge graph 'test_unbound_cmp_n12t61' created.
Switched to knowledge graph: test_unbound_cmp_n12t61
> .kg use test_unbound_cmp_n12t61
Switched to knowledge graph: test_unbound_cmp_n12t61
> +data[(1,), (2,)]
Inserted 2 fact(s) into 'data'.
> bad(X) <- data(X), Y > 5
Query execution failed: Variable 'Y' not found in schema ["X"]
> .kg use default
Switched to knowledge graph: default
> .kg drop test_unbound_cmp_n12t61
Knowledge graph 'test_unbound_cmp_n12t61' dropped.
