Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_wrong_agg_n12t62
Knowledge graph 'test_wrong_agg_n12t62' created.
Switched to knowledge graph: test_wrong_agg_n12t62
> .kg use test_wrong_agg_n12t62
Switched to knowledge graph: test_wrong_agg_n12t62
> +strings[("hello",), ("world",)]
Inserted 2 fact(s) into 'strings'.
> sum_str(sum<S>) <- strings(S)
┌───┐
│ X │
├───┤
│ 0 │
└───┘
1 rows
(session: 1 rule(s))
> ?sum_str(R)
┌───┐
│ R │
├───┤
│ 0 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_wrong_agg_n12t62
Knowledge graph 'test_wrong_agg_n12t62' dropped.
