Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_arity_query_n12t63
Knowledge graph 'test_arity_query_n12t63' created.
Switched to knowledge graph: test_arity_query_n12t63
> .kg use test_arity_query_n12t63
Switched to knowledge graph: test_arity_query_n12t63
> +triple(1, 2, 3)
Inserted 1 fact(s) into 'triple'.
> ?triple(X, Y)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    2 │    3 │
└──────┴──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_arity_query_n12t63
Knowledge graph 'test_arity_query_n12t63' dropped.
