Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_body_n12t64
Knowledge graph 'test_empty_body_n12t64' created.
Switched to knowledge graph: test_empty_body_n12t64
> .kg use test_empty_body_n12t64
Switched to knowledge graph: test_empty_body_n12t64
> bad_rule(X) <- .
Parse error: Invalid atom: .
> .kg use default
Switched to knowledge graph: default
> .kg drop test_empty_body_n12t64
Knowledge graph 'test_empty_body_n12t64' dropped.
