Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_cycle_n12t66
Knowledge graph 'test_neg_cycle_n12t66' created.
Switched to knowledge graph: test_neg_cycle_n12t66
> .kg use test_neg_cycle_n12t66
Switched to knowledge graph: test_neg_cycle_n12t66
> +base(1)
Inserted 1 fact(s) into 'base'.
> a(X) <- base(X), !b(X)
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
(session: 1 rule(s))
> b(X) <- base(X), !a(X)
No results.
(session: 2 rule(s))
> ?a(X)
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_neg_cycle_n12t66
Knowledge graph 'test_neg_cycle_n12t66' dropped.
