Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_undef_rel_n12t68
Knowledge graph 'test_undef_rel_n12t68' created.
Switched to knowledge graph: test_undef_rel_n12t68
> .kg use test_undef_rel_n12t68
Switched to knowledge graph: test_undef_rel_n12t68
> ?nonexistent_relation(X, Y)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_undef_rel_n12t68
Knowledge graph 'test_undef_rel_n12t68' dropped.
