Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_load_basic_n40t01
Knowledge graph 'test_load_basic_n40t01' created.
Switched to knowledge graph: test_load_basic_n40t01
> .kg use test_load_basic_n40t01
Switched to knowledge graph: test_load_basic_n40t01
> .load examples/datalog/40_load_command/_helper_data.dl
Loading file: examples/datalog/40_load_command/_helper_data.dl
> +loaded_relation[(1, "from_file"), (2, "also_loaded")].
Inserted 2 fact(s) into 'loaded_relation'.
> +loaded_rule(X, Y) :- loaded_relation(X, Y).
Rule 'loaded_rule' registered.
File loaded.
> ?- loaded_relation(X, Y).
2 rows:
  (1, "from_file")
  (2, "also_loaded")
> ?- loaded_rule(X, Y).
2 rows:
  (1, "from_file")
  (2, "also_loaded")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_load_basic_n40t01
Knowledge graph 'test_load_basic_n40t01' dropped.
