Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_load_replace_n40t02
Knowledge graph 'test_load_replace_n40t02' created.
Switched to knowledge graph: test_load_replace_n40t02
> .kg use test_load_replace_n40t02
Switched to knowledge graph: test_load_replace_n40t02
> +existing_data[(1, "original"), (2, "also_original")]
Inserted 2 fact(s) into 'existing_data'.
> ?existing_data(X, Y)
┌──────┬─────────────────┐
│ col0 │ col1            │
├──────┼─────────────────┤
│    1 │ "original"      │
│    2 │ "also_original" │
└──────┴─────────────────┘
2 rows
> .load examples/datalog/40_load_command/_helper_data.dl --replace
Loading file: examples/datalog/40_load_command/_helper_data.dl
Script error: Failed to read script 'examples/datalog/40_load_command/_helper_data.dl': No such file or directory (os error 2)
