Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_load_replace_n40t02
Knowledge graph 'test_load_replace_n40t02' created.
Switched to knowledge graph: test_load_replace_n40t02
> .kg use test_load_replace_n40t02
Switched to knowledge graph: test_load_replace_n40t02
> +existing_data[(1, "original"), (2, "also_original")]
Inserted 2 fact(s) into 'existing_data'.
> ?existing_data(X, Y)
┌───┬─────────────────┐
│ X │ Y               │
├───┼─────────────────┤
│ 1 │ "original"      │
│ 2 │ "also_original" │
└───┴─────────────────┘
2 rows
> .load examples/datalog/40_load_command/_helper_data.idl --replace
Loading file: examples/datalog/40_load_command/_helper_data.idl
> +loaded_relation[(1, "from_file"), (2, "also_loaded")]
Inserted 2 fact(s) into 'loaded_relation'.
> +loaded_rule(X, Y) <- loaded_relation(X, Y)
Rule 'loaded_rule' registered.
File loaded.
> ?loaded_relation(X, Y)
┌───┬───────────────┐
│ X │ Y             │
├───┼───────────────┤
│ 1 │ "from_file"   │
│ 2 │ "also_loaded" │
└───┴───────────────┘
2 rows
> ?loaded_rule(X, Y)
┌───┬───────────────┐
│ X │ Y             │
├───┼───────────────┤
│ 1 │ "from_file"   │
│ 2 │ "also_loaded" │
└───┴───────────────┘
2 rows
> ?existing_data(X, Y)
┌───┬─────────────────┐
│ X │ Y               │
├───┼─────────────────┤
│ 1 │ "original"      │
│ 2 │ "also_original" │
└───┴─────────────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_load_replace_n40t02
Knowledge graph 'test_load_replace_n40t02' dropped.
