Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_load_merge
Knowledge graph 'test_load_merge' created.
Switched to knowledge graph: test_load_merge
> .kg use test_load_merge
Switched to knowledge graph: test_load_merge
> +existing_data[(1, "original"), (2, "also_original")].
Inserted 2 fact(s) into 'existing_data'.
> +loaded_relation[(0, "pre_existing")].
Inserted 1 fact(s) into 'loaded_relation'.
> ?- loaded_relation(X, Y).
1 rows:
  (0, "pre_existing")
> .load examples/datalog/40_load_command/_helper_data.dl --merge
Loading file: examples/datalog/40_load_command/_helper_data.dl
> +loaded_relation[(1, "from_file"), (2, "also_loaded")].
Inserted 2 fact(s) into 'loaded_relation'.
> +loaded_rule(X, Y) :- loaded_relation(X, Y).
Rule 'loaded_rule' registered.
File loaded.
> ?- loaded_relation(X, Y).
3 rows:
  (0, "pre_existing")
  (1, "from_file")
  (2, "also_loaded")
> ?- existing_data(X, Y).
2 rows:
  (1, "original")
  (2, "also_original")
> ?- loaded_rule(X, Y).
3 rows:
  (0, "pre_existing")
  (1, "from_file")
  (2, "also_loaded")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_load_merge
Knowledge graph 'test_load_merge' dropped.
