Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_load_empty
Knowledge graph 'test_load_empty' created.
Switched to knowledge graph: test_load_empty
> .kg use test_load_empty
Switched to knowledge graph: test_load_empty
> +marker[(1,)].
Inserted 1 fact(s) into 'marker'.
> ?- marker(X).
1 rows:
  (1)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_load_empty
Knowledge graph 'test_load_empty' dropped.
