Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_load_empty_n40t06
Knowledge graph 'test_load_empty_n40t06' created.
Switched to knowledge graph: test_load_empty_n40t06
> .kg use test_load_empty_n40t06
Switched to knowledge graph: test_load_empty_n40t06
> +marker[(1,)]
Inserted 1 fact(s) into 'marker'.
> ?marker(X)
┌───┐
│ X │
├───┤
│ 1 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_load_empty_n40t06
Knowledge graph 'test_load_empty_n40t06' dropped.
