Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arith_inc
Knowledge graph 'test_arith_inc' created.
Switched to knowledge graph: test_arith_inc
> .kg use test_arith_inc
Switched to knowledge graph: test_arith_inc
> +edge[(1, 2), (2, 3), (3, 4)].
Inserted 3 fact(s) into 'edge'.
> +dist[(1, 0)].
Inserted 1 fact(s) into 'dist'.
> dist(Y, D+1) :- dist(X, D), edge(X, Y).
1 rows:
  (2, 1)
(session: 1 rule(s))
> ?- dist(X, Y).
1 rows:
  (2, 1)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_arith_inc
Knowledge graph 'test_arith_inc' dropped.
