Executing script: examples/datalog/15_arithmetic/01_increment.dl

> .db create test_arith_inc
Database 'test_arith_inc' created.
Switched to database: test_arith_inc
> .db use test_arith_inc
Switched to database: test_arith_inc
> +edge[(1, 2), (2, 3), (3, 4)].
Inserted 3 facts into 'edge'.
> +dist[(1, 0)].
Inserted 1 fact into 'dist'.
> dist(Y, D+1) :- dist(X, D), edge(X, Y).
1 rows:
  (2, 1)
(session: 1 rule(s))
> ?- dist(X, Y).
1 rows:
  (2, 1)
> .db use default
Switched to database: default
(Cleared 1 session rule(s))
> .db drop test_arith_inc
Database 'test_arith_inc' dropped.
