Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arith_mul
Knowledge graph 'test_arith_mul' created.
Switched to knowledge graph: test_arith_mul
> .kg use test_arith_mul
Switched to knowledge graph: test_arith_mul
> +item[(1, 10), (2, 25), (3, 15)].
Inserted 3 fact(s) into 'item'.
> double_price(Id, Price*2) :- item(Id, Price).
3 rows:
  (1, 20)
  (2, 50)
  (3, 30)
(session: 1 rule(s))
> ?- double_price(X, Y).
3 rows:
  (1, 20)
  (2, 50)
  (3, 30)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_arith_mul
Knowledge graph 'test_arith_mul' dropped.
