Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_arith_sub_n15t03
Knowledge graph 'test_arith_sub_n15t03' created.
Switched to knowledge graph: test_arith_sub_n15t03
> .kg use test_arith_sub_n15t03
Switched to knowledge graph: test_arith_sub_n15t03
> +value[(1, 100), (2, 250), (3, 175)]
Inserted 3 fact(s) into 'value'.
> reduced(Id, Amount-50) <- value(Id, Amount)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │  50 │
│ 2 │ 200 │
│ 3 │ 125 │
└───┴─────┘
3 rows
(session: 1 rule(s))
> ?reduced(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │  50 │
│ 2 │ 200 │
│ 3 │ 125 │
└───┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_arith_sub_n15t03
Knowledge graph 'test_arith_sub_n15t03' dropped.
