Executing script: examples/datalog/15_arithmetic/03_subtract.dl

> .db create test_arith_sub
Database 'test_arith_sub' created.
Switched to database: test_arith_sub
> .db use test_arith_sub
Switched to database: test_arith_sub
> +value[(1, 100), (2, 250), (3, 175)].
Inserted 3 facts into 'value'.
> reduced(Id, Amount-50) :- value(Id, Amount).
3 rows:
  (1, 50)
  (2, 200)
  (3, 125)
(session: 1 rule(s))
> ?- reduced(X, Y).
3 rows:
  (1, 50)
  (2, 200)
  (3, 125)
> .db use default
Switched to database: default
(Cleared 1 session rule(s))
> .db drop test_arith_sub
Database 'test_arith_sub' dropped.
