Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arith_div
Knowledge graph 'test_arith_div' created.
Switched to knowledge graph: test_arith_div
> .kg use test_arith_div
Switched to knowledge graph: test_arith_div
> +total[(1, 100), (2, 200), (3, 150)].
Inserted 3 fact(s) into 'total'.
> half(Id, Amount/2) :- total(Id, Amount).
3 rows:
  (1, 50.0)
  (2, 100.0)
  (3, 75.0)
(session: 1 rule(s))
> ?- half(X, Y).
3 rows:
  (1, 50.0)
  (2, 100.0)
  (3, 75.0)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_arith_div
Knowledge graph 'test_arith_div' dropped.
