Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_arith_mod_n15t05
Knowledge graph 'test_arith_mod_n15t05' created.
Switched to knowledge graph: test_arith_mod_n15t05
> .kg use test_arith_mod_n15t05
Switched to knowledge graph: test_arith_mod_n15t05
> +num[(1, 17), (2, 24), (3, 35), (4, 12)]
Inserted 4 fact(s) into 'num'.
> remainder(Id, Value%5) <- num(Id, Value)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 4 │
│ 3 │ 0 │
│ 4 │ 2 │
└───┴───┘
4 rows
(session: 1 rule(s))
> ?remainder(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 4 │
│ 3 │ 0 │
│ 4 │ 2 │
└───┴───┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_arith_mod_n15t05
Knowledge graph 'test_arith_mod_n15t05' dropped.
