Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_inc_edge
Knowledge graph 'test_inc_edge' created.
Switched to knowledge graph: test_inc_edge
> .kg use test_inc_edge
Switched to knowledge graph: test_inc_edge
> +zero_base[(1, 0)].
Inserted 1 fact(s) into 'zero_base'.
> +link1[(1, 2)].
Inserted 1 fact(s) into 'link1'.
> from_zero(Y, D+1) :- zero_base(X, D), link1(X, Y).
1 rows:
  (2, 1)
(session: 1 rule(s))
> ?- from_zero(A, B).
1 rows:
  (2, 1)
> +neg_base[(1, -5), (2, -1)].
Inserted 2 fact(s) into 'neg_base'.
> +link2[(1, 10), (2, 20)].
Inserted 2 fact(s) into 'link2'.
> from_neg(Y, D+1) :- neg_base(X, D), link2(X, Y).
2 rows:
  (10, -4)
  (20, 0)
(session: 2 rule(s))
> ?- from_neg(A, B).
2 rows:
  (10, -4)
  (20, 0)
> +dec_base[(1, 10), (2, 5)].
Inserted 2 fact(s) into 'dec_base'.
> +link3[(1, 100), (2, 200)].
Inserted 2 fact(s) into 'link3'.
> decremented(Y, D-1) :- dec_base(X, D), link3(X, Y).
2 rows:
  (100, 9)
  (200, 4)
(session: 3 rule(s))
> ?- decremented(A, B).
2 rows:
  (100, 9)
  (200, 4)
> +large_base[(1, 1000000)].
Inserted 1 fact(s) into 'large_base'.
> +link4[(1, 2)].
Inserted 1 fact(s) into 'link4'.
> large_inc(Y, D+1) :- large_base(X, D), link4(X, Y).
1 rows:
  (2, 1000001)
(session: 4 rule(s))
> ?- large_inc(A, B).
1 rows:
  (2, 1000001)
> +multi_base[(1, 0), (2, 0), (3, 0)].
Inserted 3 fact(s) into 'multi_base'.
> +link5[(1, 10), (2, 20), (3, 30)].
Inserted 3 fact(s) into 'link5'.
> multi_inc(Y, D+1) :- multi_base(X, D), link5(X, Y).
3 rows:
  (10, 1)
  (20, 1)
  (30, 1)
(session: 5 rule(s))
> ?- multi_inc(A, B).
3 rows:
  (10, 1)
  (20, 1)
  (30, 1)
> .kg use default
Switched to knowledge graph: default
(Cleared 5 session rule(s), 0 session fact(s))
> .kg drop test_inc_edge
Knowledge graph 'test_inc_edge' dropped.
