Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_inc_rev_n15t09
Knowledge graph 'test_inc_rev_n15t09' created.
Switched to knowledge graph: test_inc_rev_n15t09
> .kg use test_inc_rev_n15t09
Switched to knowledge graph: test_inc_rev_n15t09
> +edge[(1, 2), (2, 3)]
Inserted 2 fact(s) into 'edge'.
> +dist[(1, 0)]
Inserted 1 fact(s) into 'dist'.
> normal_order(Y, D+1) <- dist(X, D), edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 2 │ 1 │
└───┴───┘
1 rows
(session: 1 rule(s))
> ?normal_order(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 2 │ 1 │
└───┴───┘
1 rows
> reversed_order(Y, D+1) <- edge(X, Y), dist(X, D)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 2 │ 1 │
└───┴───┘
1 rows
(session: 2 rule(s))
> ?reversed_order(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 2 │ 1 │
└───┴───┘
1 rows
> +weight[(1, 100), (2, 200)]
Inserted 2 fact(s) into 'weight'.
> order_a(Y, W, D+1) <- dist(X, D), edge(X, Y), weight(Y, W)
┌───┬─────┬───┐
│ X │ Y   │ Z │
├───┼─────┼───┤
│ 2 │ 200 │ 1 │
└───┴─────┴───┘
1 rows
(session: 3 rule(s))
> ?order_a(A, B, C)
┌───┬─────┬───┐
│ A │ B   │ C │
├───┼─────┼───┤
│ 2 │ 200 │ 1 │
└───┴─────┴───┘
1 rows
> order_b(Y, W, D+1) <- edge(X, Y), dist(X, D), weight(Y, W)
┌───┬─────┬───┐
│ X │ Y   │ Z │
├───┼─────┼───┤
│ 2 │ 200 │ 1 │
└───┴─────┴───┘
1 rows
(session: 4 rule(s))
> ?order_b(A, B, C)
┌───┬─────┬───┐
│ A │ B   │ C │
├───┼─────┼───┤
│ 2 │ 200 │ 1 │
└───┴─────┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_inc_rev_n15t09
Knowledge graph 'test_inc_rev_n15t09' dropped.
