
Executing script: /Users/samuel.picek/InputLayer/FlowLog/course/final-project/examples/datalog/15_arithmetic/14_arity_5col.dl

> .db create test_arity_5col
Database 'test_arity_5col' created.
Switched to database: test_arity_5col
> .db use test_arity_5col
Switched to database: test_arity_5col
> +src5[(1, 10, 20, 30, 40), (2, 100, 200, 300, 400)].
Inserted 2 facts into 'src5'.
> +link[(1, 1000), (2, 2000)].
Inserted 2 facts into 'link'.
> inc_a(Y, A+1) :- src5(X, A, _, _, _), link(X, Y).
2 rows:
  (1000, 11)
  (2000, 101)
(session: 1 rule(s))
> ?- inc_a(R, V).
2 rows:
  (1000, 11)
  (2000, 101)
> inc_b(Y, B+1) :- src5(X, _, B, _, _), link(X, Y).
2 rows:
  (1000, 21)
  (2000, 201)
(session: 2 rule(s))
> ?- inc_b(R, V).
2 rows:
  (1000, 21)
  (2000, 201)
> inc_c(Y, C+1) :- src5(X, _, _, C, _), link(X, Y).
2 rows:
  (1000, 31)
  (2000, 301)
(session: 3 rule(s))
> ?- inc_c(R, V).
2 rows:
  (1000, 31)
  (2000, 301)
> inc_d(Y, D+1) :- src5(X, _, _, _, D), link(X, Y).
2 rows:
  (1000, 41)
  (2000, 401)
(session: 4 rule(s))
> ?- inc_d(R, V).
2 rows:
  (1000, 41)
  (2000, 401)
> partial1(Y, A+B) :- src5(X, A, B, _, _), link(X, Y).
2 rows:
  (1000, 30)
  (2000, 300)
(session: 5 rule(s))
> ?- partial1(R, V).
2 rows:
  (1000, 30)
  (2000, 300)
> partial2(Y, C+D) :- src5(X, _, _, C, D), link(X, Y).
2 rows:
  (1000, 70)
  (2000, 700)
(session: 6 rule(s))
> ?- partial2(R, V).
2 rows:
  (1000, 70)
  (2000, 700)
> partial3(Y, A+C) :- src5(X, A, _, C, _), link(X, Y).
2 rows:
  (1000, 40)
  (2000, 400)
(session: 7 rule(s))
> ?- partial3(R, V).
2 rows:
  (1000, 40)
  (2000, 400)
> all_bound(Y, A+1, B, C, D) :- src5(X, A, B, C, D), link(X, Y).
No results for 'all_bound'.
(session: 8 rule(s))
> ?- all_bound(R, V1, V2, V3, V4).
2 rows:
  (1000, 11, 20, 30, 40)
  (2000, 101, 200, 300, 400)
> multi_ops(Y, A+1, B*2, C-10, D/2) :- src5(X, A, B, C, D), link(X, Y).
No results for 'multi_ops'.
(session: 9 rule(s))
> ?- multi_ops(R, V1, V2, V3, V4).
2 rows:
  (1000, 11, 40, 20, 20)
  (2000, 101, 400, 290, 200)
> sum_all(X, A+B+C+D) :- src5(X, A, B, C, D).
2 rows:
  (1, 100)
  (2, 1000)
(session: 10 rule(s))
> ?- sum_all(K, V).
2 rows:
  (1, 100)
  (2, 1000)
> .db use default
Switched to database: default
(Cleared 10 session rule(s))
> .db drop test_arity_5col
Database 'test_arity_5col' dropped.

