Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_arity_5col_n15t14
Knowledge graph 'test_arity_5col_n15t14' created.
Switched to knowledge graph: test_arity_5col_n15t14
> .kg use test_arity_5col_n15t14
Switched to knowledge graph: test_arity_5col_n15t14
> +src5[(1, 10, 20, 30, 40), (2, 100, 200, 300, 400)]
Inserted 2 fact(s) into 'src5'.
> +link[(1, 1000), (2, 2000)]
Inserted 2 fact(s) into 'link'.
> inc_a(Y, A+1) <- src5(X, A, _, _, _), link(X, Y)
┌──────┬─────┐
│ X    │ Y   │
├──────┼─────┤
│ 1000 │  11 │
│ 2000 │ 101 │
└──────┴─────┘
2 rows
(session: 1 rule(s))
> ?inc_a(R, V)
┌──────┬─────┐
│ R    │ V   │
├──────┼─────┤
│ 1000 │  11 │
│ 2000 │ 101 │
└──────┴─────┘
2 rows
> inc_b(Y, B+1) <- src5(X, _, B, _, _), link(X, Y)
┌──────┬─────┐
│ X    │ Y   │
├──────┼─────┤
│ 1000 │  21 │
│ 2000 │ 201 │
└──────┴─────┘
2 rows
(session: 2 rule(s))
> ?inc_b(R, V)
┌──────┬─────┐
│ R    │ V   │
├──────┼─────┤
│ 1000 │  21 │
│ 2000 │ 201 │
└──────┴─────┘
2 rows
> inc_c(Y, C+1) <- src5(X, _, _, C, _), link(X, Y)
┌──────┬─────┐
│ X    │ Y   │
├──────┼─────┤
│ 1000 │  31 │
│ 2000 │ 301 │
└──────┴─────┘
2 rows
(session: 3 rule(s))
> ?inc_c(R, V)
┌──────┬─────┐
│ R    │ V   │
├──────┼─────┤
│ 1000 │  31 │
│ 2000 │ 301 │
└──────┴─────┘
2 rows
> inc_d(Y, D+1) <- src5(X, _, _, _, D), link(X, Y)
┌──────┬─────┐
│ X    │ Y   │
├──────┼─────┤
│ 1000 │  41 │
│ 2000 │ 401 │
└──────┴─────┘
2 rows
(session: 4 rule(s))
> ?inc_d(R, V)
┌──────┬─────┐
│ R    │ V   │
├──────┼─────┤
│ 1000 │  41 │
│ 2000 │ 401 │
└──────┴─────┘
2 rows
> partial1(Y, A+B) <- src5(X, A, B, _, _), link(X, Y)
┌──────┬─────┐
│ X    │ Y   │
├──────┼─────┤
│ 1000 │  30 │
│ 2000 │ 300 │
└──────┴─────┘
2 rows
(session: 5 rule(s))
> ?partial1(R, V)
┌──────┬─────┐
│ R    │ V   │
├──────┼─────┤
│ 1000 │  30 │
│ 2000 │ 300 │
└──────┴─────┘
2 rows
> partial2(Y, C+D) <- src5(X, _, _, C, D), link(X, Y)
┌──────┬─────┐
│ X    │ Y   │
├──────┼─────┤
│ 1000 │  70 │
│ 2000 │ 700 │
└──────┴─────┘
2 rows
(session: 6 rule(s))
> ?partial2(R, V)
┌──────┬─────┐
│ R    │ V   │
├──────┼─────┤
│ 1000 │  70 │
│ 2000 │ 700 │
└──────┴─────┘
2 rows
> partial3(Y, A+C) <- src5(X, A, _, C, _), link(X, Y)
┌──────┬─────┐
│ X    │ Y   │
├──────┼─────┤
│ 1000 │  40 │
│ 2000 │ 400 │
└──────┴─────┘
2 rows
(session: 7 rule(s))
> ?partial3(R, V)
┌──────┬─────┐
│ R    │ V   │
├──────┼─────┤
│ 1000 │  40 │
│ 2000 │ 400 │
└──────┴─────┘
2 rows
> all_bound(Y, A+1, B, C, D) <- src5(X, A, B, C, D), link(X, Y)
┌──────┬─────┬─────┬─────┬─────┐
│ X    │ Y   │ Z   │ W   │ V   │
├──────┼─────┼─────┼─────┼─────┤
│ 1000 │  11 │  20 │  30 │  40 │
│ 2000 │ 101 │ 200 │ 300 │ 400 │
└──────┴─────┴─────┴─────┴─────┘
2 rows
(session: 8 rule(s))
> ?all_bound(R, V1, V2, V3, V4)
┌──────┬─────┬─────┬─────┬─────┐
│ R    │ V1  │ V2  │ V3  │ V4  │
├──────┼─────┼─────┼─────┼─────┤
│ 1000 │  11 │  20 │  30 │  40 │
│ 2000 │ 101 │ 200 │ 300 │ 400 │
└──────┴─────┴─────┴─────┴─────┘
2 rows
> multi_ops(Y, A+1, B*2, C-10, D/2) <- src5(X, A, B, C, D), link(X, Y)
┌──────┬─────┬─────┬─────┬───────┐
│ X    │ Y   │ Z   │ W   │ V     │
├──────┼─────┼─────┼─────┼───────┤
│ 1000 │  11 │  40 │  20 │  20.0 │
│ 2000 │ 101 │ 400 │ 290 │ 200.0 │
└──────┴─────┴─────┴─────┴───────┘
2 rows
(session: 9 rule(s))
> ?multi_ops(R, V1, V2, V3, V4)
┌──────┬─────┬─────┬─────┬───────┐
│ R    │ V1  │ V2  │ V3  │ V4    │
├──────┼─────┼─────┼─────┼───────┤
│ 1000 │  11 │  40 │  20 │  20.0 │
│ 2000 │ 101 │ 400 │ 290 │ 200.0 │
└──────┴─────┴─────┴─────┴───────┘
2 rows
> sum_all(X, A+B+C+D) <- src5(X, A, B, C, D)
┌───┬──────┐
│ X │ Y    │
├───┼──────┤
│ 1 │  100 │
│ 2 │ 1000 │
└───┴──────┘
2 rows
(session: 10 rule(s))
> ?sum_all(K, V)
┌───┬──────┐
│ K │ V    │
├───┼──────┤
│ 1 │  100 │
│ 2 │ 1000 │
└───┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 10 session rule(s), 0 session fact(s))
> .kg drop test_arity_5col_n15t14
Knowledge graph 'test_arity_5col_n15t14' dropped.
