Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_division_n15t16
Knowledge graph 'test_division_n15t16' created.
Switched to knowledge graph: test_division_n15t16
> .kg use test_division_n15t16
Switched to knowledge graph: test_division_n15t16
> +div_data[(10, 2), (20, 4), (15, 3), (100, 0), (50, 0)].
Inserted 5 fact(s) into 'div_data'.
> +safe_div(X, Y, X/Y) :- div_data(X, Y), Y != 0.
Rule 'safe_div' registered.
> ?- safe_div(A, B, C).
3 rows:
  (10, 2, 5.0)
  (15, 3, 5.0)
  (20, 4, 5.0)
> +numerators[(100), (200), (300)].
Inserted 3 fact(s) into 'numerators'.
> +denominators[(10), (20), (0)].
Inserted 3 fact(s) into 'denominators'.
> +cross_div(N, D, N/D) :- numerators(N), denominators(D), D != 0.
Rule 'cross_div' registered.
> ?- cross_div(N, D, R).
6 rows:
  (100, 10, 10.0)
  (100, 20, 5.0)
  (200, 10, 20.0)
  (200, 20, 10.0)
  (300, 10, 30.0)
  (300, 20, 15.0)
> +safe_mod(X, Y, X%Y) :- div_data(X, Y), Y != 0.
Rule 'safe_mod' registered.
> ?- safe_mod(A, B, C).
3 rows:
  (10, 2, 0)
  (15, 3, 0)
  (20, 4, 0)
> +int_div_data[(7, 2), (10, 3), (15, 4), (100, 7)].
Inserted 4 fact(s) into 'int_div_data'.
> +int_div_result(X, Y, X/Y) :- int_div_data(X, Y).
Rule 'int_div_result' registered.
> ?- int_div_result(A, B, C).
4 rows:
  (7, 2, 3.5)
  (10, 3, 3.3333333333333335)
  (15, 4, 3.75)
  (100, 7, 14.285714285714286)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_division_n15t16
Knowledge graph 'test_division_n15t16' dropped.
