Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arith_agg
Knowledge graph 'test_arith_agg' created.
Switched to knowledge graph: test_arith_agg
> .kg use test_arith_agg
Switched to knowledge graph: test_arith_agg
> +sales[(1, 100, 500), (1, 101, 300), (1, 102, 200), (2, 100, 400), (2, 101, 600), (3, 100, 700), (3, 101, 100), (3, 102, 200), (3, 103, 300)].
Inserted 9 fact(s) into 'sales'.
> +store_total(Store, sum<Amount>) :- sales(Store, _, Amount).
Rule 'store_total' registered.
> +store_count(Store, count<Product>) :- sales(Store, Product, _).
Rule 'store_count' registered.
> ?- store_total(S, T).
3 rows:
  (1, 1000)
  (2, 1000)
  (3, 1300)
> ?- store_count(S, C).
3 rows:
  (1, 3)
  (2, 2)
  (3, 4)
> +doubled_total(Store, Total*2) :- store_total(Store, Total).
Script error: Parse error: Invalid term: 'Total*2'
