Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arith_agg_n15t17
Knowledge graph 'test_arith_agg_n15t17' created.
Switched to knowledge graph: test_arith_agg_n15t17
> .kg use test_arith_agg_n15t17
Switched to knowledge graph: test_arith_agg_n15t17
> +sales[(1, 100, 500), (1, 101, 300), (1, 102, 200), (2, 100, 400), (2, 101, 600), (3, 100, 700), (3, 101, 100), (3, 102, 200), (3, 103, 300)].
Inserted 9 fact(s) into 'sales'.
> +store_total(Store, sum<Amount>) :- sales(Store, _, Amount).
Rule 'store_total' registered.
> +store_count(Store, count<Product>) :- sales(Store, Product, _).
Rule 'store_count' registered.
> ?- store_total(S, T).
3 rows:
  (1, 1000)
  (2, 1000)
  (3, 1300)
> ?- store_count(S, C).
3 rows:
  (1, 3)
  (2, 2)
  (3, 4)
> +doubled_total(Store, Total*2) :- store_total(Store, Total).
Rule 'doubled_total' registered.
> ?- doubled_total(S, D).
3 rows:
  (1, 2000)
  (2, 2000)
  (3, 2600)
> +manual_avg(Store, Total/Count) :- store_total(Store, Total), store_count(Store, Count).
Rule 'manual_avg' registered.
> ?- manual_avg(S, A).
3 rows:
  (1, 333.3333333333333)
  (2, 500.0)
  (3, 325.0)
> +builtin_avg(Store, avg<Amount>) :- sales(Store, _, Amount).
Rule 'builtin_avg' registered.
> ?- builtin_avg(S, A).
3 rows:
  (1, 333.3333333333333)
  (2, 500.0)
  (3, 325.0)
> +grand_total(sum<A>) :- sales(_, _, A).
Rule 'grand_total' registered.
> ?- grand_total(G).
1 rows:
  (3300)
> +with_bonus(Store, Total + Total/10) :- store_total(Store, Total).
Rule 'with_bonus' registered.
> ?- with_bonus(S, B).
3 rows:
  (1, 1100.0)
  (2, 1100.0)
  (3, 1430.0)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_arith_agg_n15t17
Knowledge graph 'test_arith_agg_n15t17' dropped.
