Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_chained_n15t18
Knowledge graph 'test_chained_n15t18' created.
Switched to knowledge graph: test_chained_n15t18
> .kg use test_chained_n15t18
Switched to knowledge graph: test_chained_n15t18
> +values[(10,), (20,), (30,)]
Inserted 3 fact(s) into 'values'.
> result_add(X, Y) <- values(X), Y = X + 1 + 2 + 3
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   10 │   16 │
│   20 │   26 │
│   30 │   36 │
└──────┴──────┘
3 rows
(session: 1 rule(s))
> ?result_add(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   10 │   16 │
│   20 │   26 │
│   30 │   36 │
└──────┴──────┘
3 rows
> result_sub(X, Y) <- values(X), Y = X - 5 - 3
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   10 │    2 │
│   20 │   12 │
│   30 │   22 │
└──────┴──────┘
3 rows
(session: 2 rule(s))
> ?result_sub(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   10 │    2 │
│   20 │   12 │
│   30 │   22 │
└──────┴──────┘
3 rows
> result_mixed(X, Y) <- values(X), Y = X + 10 - 5 + 2
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   10 │   17 │
│   20 │   27 │
│   30 │   37 │
└──────┴──────┘
3 rows
(session: 3 rule(s))
> ?result_mixed(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   10 │   17 │
│   20 │   27 │
│   30 │   37 │
└──────┴──────┘
3 rows
> result_mul(X, Y) <- values(X), Y = X * 2 * 3
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   10 │   60 │
│   20 │  120 │
│   30 │  180 │
└──────┴──────┘
3 rows
(session: 4 rule(s))
> ?result_mul(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   10 │   60 │
│   20 │  120 │
│   30 │  180 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_chained_n15t18
Knowledge graph 'test_chained_n15t18' dropped.
