Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_mixed_arith_n15t19
Knowledge graph 'test_mixed_arith_n15t19' created.
Switched to knowledge graph: test_mixed_arith_n15t19
> .kg use test_mixed_arith_n15t19
Switched to knowledge graph: test_mixed_arith_n15t19
> +ints[(10,), (20,)]
Inserted 2 fact(s) into 'ints'.
> +floats[(1.5,), (2.5,)]
Inserted 2 fact(s) into 'floats'.
> +pairs[(10, 1.5), (20, 2.5)]
Inserted 2 fact(s) into 'pairs'.
> mixed_add(I, F, R) <- pairs(I, F), R = I + F
┌────┬─────┬──────┐
│ X  │ Y   │ Z    │
├────┼─────┼──────┤
│ 10 │ 1.5 │ 11.5 │
│ 20 │ 2.5 │ 22.5 │
└────┴─────┴──────┘
2 rows
(session: 1 rule(s))
> ?mixed_add(I, F, R)
┌────┬─────┬──────┐
│ I  │ F   │ R    │
├────┼─────┼──────┤
│ 10 │ 1.5 │ 11.5 │
│ 20 │ 2.5 │ 22.5 │
└────┴─────┴──────┘
2 rows
> mixed_mul(I, F, R) <- pairs(I, F), R = I * F
┌────┬─────┬──────┐
│ X  │ Y   │ Z    │
├────┼─────┼──────┤
│ 10 │ 1.5 │ 15.0 │
│ 20 │ 2.5 │ 50.0 │
└────┴─────┴──────┘
2 rows
(session: 2 rule(s))
> ?mixed_mul(I, F, R)
┌────┬─────┬──────┐
│ I  │ F   │ R    │
├────┼─────┼──────┤
│ 10 │ 1.5 │ 15.0 │
│ 20 │ 2.5 │ 50.0 │
└────┴─────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_mixed_arith_n15t19
Knowledge graph 'test_mixed_arith_n15t19' dropped.
