Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_div_var_n15t20
Knowledge graph 'test_div_var_n15t20' created.
Switched to knowledge graph: test_div_var_n15t20
> .kg use test_div_var_n15t20
Switched to knowledge graph: test_div_var_n15t20
> +data[(100, 10), (200, 20), (150, 5), (80, 8)]
Inserted 4 fact(s) into 'data'.
> computed(A, B, Result) <- data(A, B), Result = A / B
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│   80 │    8 │ 10.0 │
│  100 │   10 │ 10.0 │
│  150 │    5 │ 30.0 │
│  200 │   20 │ 10.0 │
└──────┴──────┴──────┘
4 rows
(session: 1 rule(s))
> ?computed(A, B, R)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│   80 │    8 │ 10.0 │
│  100 │   10 │ 10.0 │
│  150 │    5 │ 30.0 │
│  200 │   20 │ 10.0 │
└──────┴──────┴──────┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_div_var_n15t20
Knowledge graph 'test_div_var_n15t20' dropped.
