Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_arith_filter_n15t23
Knowledge graph 'test_arith_filter_n15t23' created.
Switched to knowledge graph: test_arith_filter_n15t23
> .kg use test_arith_filter_n15t23
Switched to knowledge graph: test_arith_filter_n15t23
> +items[(1, 10, 2), (2, 20, 3), (3, 15, 1), (4, 25, 2)]
Inserted 4 fact(s) into 'items'.
> expensive(Id, Q, P) <- items(Id, Q, P), Q * P > 30
┌───┬────┬───┐
│ X │ Y  │ Z │
├───┼────┼───┤
│ 2 │ 20 │ 3 │
│ 4 │ 25 │ 2 │
└───┴────┴───┘
2 rows
(session: 1 rule(s))
> ?expensive(Id, Q, P)
┌────┬────┬───┐
│ Id │ Q  │ P │
├────┼────┼───┤
│  2 │ 20 │ 3 │
│  4 │ 25 │ 2 │
└────┴────┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_arith_filter_n15t23
Knowledge graph 'test_arith_filter_n15t23' dropped.
