Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_negative_n15t24
Knowledge graph 'test_negative_n15t24' created.
Switched to knowledge graph: test_negative_n15t24
> .kg use test_negative_n15t24
Switched to knowledge graph: test_negative_n15t24
> +temps[(-10,), (0,), (10,), (-5,), (20,)].
Inserted 5 fact(s) into 'temps'.
> negative(T) :- temps(T), T < 0.
2 rows:
  (-10)
  (-5)
(session: 1 rule(s))
> non_negative(T) :- temps(T), T >= 0.
3 rows:
  (0)
  (10)
  (20)
(session: 2 rule(s))
> ?- negative(T).
2 rows:
  (-10)
  (-5)
> ?- non_negative(T).
3 rows:
  (0)
  (10)
  (20)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_negative_n15t24
Knowledge graph 'test_negative_n15t24' dropped.
