Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_order_n15t25
Knowledge graph 'test_order_n15t25' created.
Switched to knowledge graph: test_order_n15t25
> .kg use test_order_n15t25
Switched to knowledge graph: test_order_n15t25
> +nums[(10,), (20,)].
Inserted 2 fact(s) into 'nums'.
> result(X, R) :- nums(X), R = X + 5 * 2.
2 rows:
  (10, 20)
  (20, 30)
(session: 1 rule(s))
> result_paren(X, R) :- nums(X), R = (X + 5) * 2.
2 rows:
  (10, 30)
  (20, 50)
(session: 2 rule(s))
> ?- result(X, R).
2 rows:
  (10, 20)
  (20, 30)
> ?- result_paren(X, R).
2 rows:
  (10, 30)
  (20, 50)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_order_n15t25
Knowledge graph 'test_order_n15t25' dropped.
