Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_abs_n15t28
Knowledge graph 'test_abs_n15t28' created.
Switched to knowledge graph: test_abs_n15t28
> .kg use test_abs_n15t28
Switched to knowledge graph: test_abs_n15t28
> +values[(-10,), (5,), (-3,), (0,), (7,)]
Inserted 5 fact(s) into 'values'.
> +positive(V) <- values(V), V >= 0
Rule 'positive' registered.
> +negative(V) <- values(V), V < 0
Rule 'negative' registered.
> ?positive(V)
┌──────┐
│ col0 │
├──────┤
│    0 │
│    5 │
│    7 │
└──────┘
3 rows
> ?negative(V)
┌──────┐
│ col0 │
├──────┤
│  -10 │
│   -3 │
└──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_abs_n15t28
Knowledge graph 'test_abs_n15t28' dropped.
