Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_abs
Knowledge graph 'test_abs' created.
Switched to knowledge graph: test_abs
> .kg use test_abs
Switched to knowledge graph: test_abs
> +values[(-10,), (5,), (-3,), (0,), (7,)].
Inserted 5 fact(s) into 'values'.
> +positive(V) :- values(V), V >= 0.
Rule 'positive' registered.
> +negative(V) :- values(V), V < 0.
Rule 'negative' registered.
> ?- positive(V).
3 rows:
  (0)
  (5)
  (7)
> ?- negative(V).
2 rows:
  (-10)
  (-3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_abs
Knowledge graph 'test_abs' dropped.
