Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_compare_n15t30
Knowledge graph 'test_compare_n15t30' created.
Switched to knowledge graph: test_compare_n15t30
> .kg use test_compare_n15t30
Switched to knowledge graph: test_compare_n15t30
> +pairs[(10, 5), (3, 7), (5, 5), (8, 2)]
Inserted 4 fact(s) into 'pairs'.
> first_bigger(A, B) <- pairs(A, B), A > B
┌────┬───┐
│ X  │ Y │
├────┼───┤
│  8 │ 2 │
│ 10 │ 5 │
└────┴───┘
2 rows
(session: 1 rule(s))
> equal_vals(A, B) <- pairs(A, B), A = B
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 5 │ 5 │
└───┴───┘
1 rows
(session: 2 rule(s))
> ?first_bigger(A, B)
┌────┬───┐
│ A  │ B │
├────┼───┤
│  8 │ 2 │
│ 10 │ 5 │
└────┴───┘
2 rows
> ?equal_vals(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 5 │ 5 │
└───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_compare_n15t30
Knowledge graph 'test_compare_n15t30' dropped.
