Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_add_n15t33
Knowledge graph 'test_add_n15t33' created.
Switched to knowledge graph: test_add_n15t33
> .kg use test_add_n15t33
Switched to knowledge graph: test_add_n15t33
> +pairs[(10, 5), (20, 30), (7, 3)]
Inserted 3 fact(s) into 'pairs'.
> sum_pair(A, B, Result) <- pairs(A, B), Result = A + B
┌────┬────┬────┐
│ X  │ Y  │ Z  │
├────┼────┼────┤
│  7 │  3 │ 10 │
│ 10 │  5 │ 15 │
│ 20 │ 30 │ 50 │
└────┴────┴────┘
3 rows
(session: 1 rule(s))
> ?sum_pair(A, B, R)
┌────┬────┬────┐
│ A  │ B  │ R  │
├────┼────┼────┤
│  7 │  3 │ 10 │
│ 10 │  5 │ 15 │
│ 20 │ 30 │ 50 │
└────┴────┴────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_add_n15t33
Knowledge graph 'test_add_n15t33' dropped.
