Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_float_arith_n15t34
Knowledge graph 'test_float_arith_n15t34' created.
Switched to knowledge graph: test_float_arith_n15t34
> .kg use test_float_arith_n15t34
Switched to knowledge graph: test_float_arith_n15t34
> +floats[(1.5, 2.5), (3.0, 1.5), (0.5, 0.5)]
Inserted 3 fact(s) into 'floats'.
> computed(A, B, Sum, Prod) <- floats(A, B), Sum = A + B, Prod = A * B
┌─────┬─────┬─────┬──────┐
│ X   │ Y   │ Z   │ W    │
├─────┼─────┼─────┼──────┤
│ 0.5 │ 0.5 │ 1.0 │ 0.25 │
│ 1.5 │ 2.5 │ 4.0 │ 3.75 │
│ 3.0 │ 1.5 │ 4.5 │  4.5 │
└─────┴─────┴─────┴──────┘
3 rows
(session: 1 rule(s))
> ?computed(A, B, S, P)
┌─────┬─────┬─────┬──────┐
│ A   │ B   │ S   │ P    │
├─────┼─────┼─────┼──────┤
│ 0.5 │ 0.5 │ 1.0 │ 0.25 │
│ 1.5 │ 2.5 │ 4.0 │ 3.75 │
│ 3.0 │ 1.5 │ 4.5 │  4.5 │
└─────┴─────┴─────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_float_arith_n15t34
Knowledge graph 'test_float_arith_n15t34' dropped.
