Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_arith_n15t36
Knowledge graph 'test_bool_arith_n15t36' created.
Switched to knowledge graph: test_bool_arith_n15t36
> .kg use test_bool_arith_n15t36
Switched to knowledge graph: test_bool_arith_n15t36
> +flags[(1, true), (2, false), (3, true)]
Inserted 3 fact(s) into 'flags'.
> ?flags(Id, Val)
┌──────┬───────┐
│ col0 │ col1  │
├──────┼───────┤
│    1 │ true  │
│    2 │ false │
│    3 │ true  │
└──────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_bool_arith_n15t36
Knowledge graph 'test_bool_arith_n15t36' dropped.
