Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_unary_n15t37
Knowledge graph 'test_unary_n15t37' created.
Switched to knowledge graph: test_unary_n15t37
> .kg use test_unary_n15t37
Switched to knowledge graph: test_unary_n15t37
> +nums[(10,), (20,), (-5,)]
Inserted 3 fact(s) into 'nums'.
> negated(X, N) <- nums(X), N = 0 - X
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   -5 │    5 │
│   10 │  -10 │
│   20 │  -20 │
└──────┴──────┘
3 rows
(session: 1 rule(s))
> ?negated(X, N)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│   -5 │    5 │
│   10 │  -10 │
│   20 │  -20 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_unary_n15t37
Knowledge graph 'test_unary_n15t37' dropped.
