Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_prec_n15t42
Knowledge graph 'test_prec_n15t42' created.
Switched to knowledge graph: test_prec_n15t42
> .kg use test_prec_n15t42
Switched to knowledge graph: test_prec_n15t42
> +val[(5,)]
Inserted 1 fact(s) into 'val'.
> result(V, R) <- val(V), R = V + 3 * 2
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    5 │   11 │
└──────┴──────┘
1 rows
(session: 1 rule(s))
> ?result(V, R)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    5 │   11 │
└──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_prec_n15t42
Knowledge graph 'test_prec_n15t42' dropped.
