Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_unary_minus_n15t44
Knowledge graph 'test_unary_minus_n15t44' created.
Switched to knowledge graph: test_unary_minus_n15t44
> .kg use test_unary_minus_n15t44
Switched to knowledge graph: test_unary_minus_n15t44
> +vals[(5,), (10,), (15,)]
Inserted 3 fact(s) into 'vals'.
> neg_result(X, Y) <- vals(X), Y = X - 20
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│  5 │ -15 │
│ 10 │ -10 │
│ 15 │  -5 │
└────┴─────┘
3 rows
(session: 1 rule(s))
> ?neg_result(X, Y)
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│  5 │ -15 │
│ 10 │ -10 │
│ 15 │  -5 │
└────┴─────┘
3 rows
> negate(X, Y) <- vals(X), Y = X * -1
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│  5 │  -5 │
│ 10 │ -10 │
│ 15 │ -15 │
└────┴─────┘
3 rows
(session: 2 rule(s))
> ?negate(X, Y)
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│  5 │  -5 │
│ 10 │ -10 │
│ 15 │ -15 │
└────┴─────┘
3 rows
> double_neg(X, Y) <- vals(X), Y = 0 - (0 - X)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  5 │  5 │
│ 10 │ 10 │
│ 15 │ 15 │
└────┴────┘
3 rows
(session: 3 rule(s))
> ?double_neg(X, Y)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  5 │  5 │
│ 10 │ 10 │
│ 15 │ 15 │
└────┴────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_unary_minus_n15t44
Knowledge graph 'test_unary_minus_n15t44' dropped.
