Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_unary_minus_n15t44
Knowledge graph 'test_unary_minus_n15t44' created.
Switched to knowledge graph: test_unary_minus_n15t44
> .kg use test_unary_minus_n15t44
Switched to knowledge graph: test_unary_minus_n15t44
> +vals[(5,), (10,), (15,)].
Inserted 3 fact(s) into 'vals'.
> neg_result(X, Y) :- vals(X), Y = X - 20.
3 rows:
  (5, -15)
  (10, -10)
  (15, -5)
(session: 1 rule(s))
> ?- neg_result(X, Y).
3 rows:
  (5, -15)
  (10, -10)
  (15, -5)
> negate(X, Y) :- vals(X), Y = X * -1.
3 rows:
  (5, -5)
  (10, -10)
  (15, -15)
(session: 2 rule(s))
> ?- negate(X, Y).
3 rows:
  (5, -5)
  (10, -10)
  (15, -15)
> double_neg(X, Y) :- vals(X), Y = 0 - (0 - X).
3 rows:
  (5, 5)
  (10, 10)
  (15, 15)
(session: 3 rule(s))
> ?- double_neg(X, Y).
3 rows:
  (5, 5)
  (10, 10)
  (15, 15)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_unary_minus_n15t44
Knowledge graph 'test_unary_minus_n15t44' dropped.
