Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_float_int_n15t45
Knowledge graph 'test_float_int_n15t45' created.
Switched to knowledge graph: test_float_int_n15t45
> .kg use test_float_int_n15t45
Switched to knowledge graph: test_float_int_n15t45
> +ints[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'ints'.
> +floats[(1.5,), (2.5,), (3.5,)]
Inserted 3 fact(s) into 'floats'.
> int_to_float(X, Y) <- ints(X), Y = X * 1.0
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
│    2 │    2 │
│    3 │    3 │
└──────┴──────┘
3 rows
(session: 1 rule(s))
> ?int_to_float(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
│    2 │    2 │
│    3 │    3 │
└──────┴──────┘
3 rows
> float_plus_one(X, Y) <- floats(X), Y = X + 1
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│  1.5 │  2.5 │
│  2.5 │  3.5 │
│  3.5 │  4.5 │
└──────┴──────┘
3 rows
(session: 2 rule(s))
> ?float_plus_one(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│  1.5 │  2.5 │
│  2.5 │  3.5 │
│  3.5 │  4.5 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_float_int_n15t45
Knowledge graph 'test_float_int_n15t45' dropped.
