Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_div_trunc_n15t48
Knowledge graph 'test_div_trunc_n15t48' created.
Switched to knowledge graph: test_div_trunc_n15t48
> .kg use test_div_trunc_n15t48
Switched to knowledge graph: test_div_trunc_n15t48
> +vals[(7,), (10,), (15,), (-7,), (-10,)]
Inserted 5 fact(s) into 'vals'.
> int_div(X, Y) <- vals(X), Y = X / 3
┌──────┬─────────────────────┐
│ col0 │ col1                │
├──────┼─────────────────────┤
│  -10 │ -3.3333333333333335 │
│   -7 │ -2.3333333333333335 │
│    7 │  2.3333333333333335 │
│   10 │  3.3333333333333335 │
│   15 │                 5.0 │
└──────┴─────────────────────┘
5 rows
(session: 1 rule(s))
> ?int_div(X, Y)
┌──────┬─────────────────────┐
│ col0 │ col1                │
├──────┼─────────────────────┤
│  -10 │ -3.3333333333333335 │
│   -7 │ -2.3333333333333335 │
│    7 │  2.3333333333333335 │
│   10 │  3.3333333333333335 │
│   15 │                 5.0 │
└──────┴─────────────────────┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_div_trunc_n15t48
Knowledge graph 'test_div_trunc_n15t48' dropped.
