Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_modulo_n15t49
Knowledge graph 'test_modulo_n15t49' created.
Switched to knowledge graph: test_modulo_n15t49
> .kg use test_modulo_n15t49
Switched to knowledge graph: test_modulo_n15t49
> +numbers[(10,), (15,), (20,), (25,), (30,)]
Inserted 5 fact(s) into 'numbers'.
> even(X) <- numbers(X), X % 2 = 0
┌────┐
│ X  │
├────┤
│ 10 │
│ 20 │
│ 30 │
└────┘
3 rows
(session: 1 rule(s))
> div_by_5(X) <- numbers(X), X % 5 = 0
┌────┐
│ X  │
├────┤
│ 10 │
│ 15 │
│ 20 │
│ 25 │
│ 30 │
└────┘
5 rows
(session: 2 rule(s))
> div_by_10(X) <- numbers(X), X % 10 = 0
┌────┐
│ X  │
├────┤
│ 10 │
│ 20 │
│ 30 │
└────┘
3 rows
(session: 3 rule(s))
> ?even(X)
┌────┐
│ X  │
├────┤
│ 10 │
│ 20 │
│ 30 │
└────┘
3 rows
> ?div_by_5(X)
┌────┐
│ X  │
├────┤
│ 10 │
│ 15 │
│ 20 │
│ 25 │
│ 30 │
└────┘
5 rows
> ?div_by_10(X)
┌────┐
│ X  │
├────┤
│ 10 │
│ 20 │
│ 30 │
└────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_modulo_n15t49
Knowledge graph 'test_modulo_n15t49' dropped.
