Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mod_n15t50
Knowledge graph 'test_mod_n15t50' created.
Switched to knowledge graph: test_mod_n15t50
> .kg use test_mod_n15t50
Switched to knowledge graph: test_mod_n15t50
> +vals[(7,), (10,), (15,), (8,)]
Inserted 4 fact(s) into 'vals'.
> mod_3(X, Y) <- vals(X), Y = X % 3
┌────┬───┐
│ X  │ Y │
├────┼───┤
│  7 │ 1 │
│  8 │ 2 │
│ 10 │ 1 │
│ 15 │ 0 │
└────┴───┘
4 rows
(session: 1 rule(s))
> ?mod_3(X, Y)
┌────┬───┐
│ X  │ Y │
├────┼───┤
│  7 │ 1 │
│  8 │ 2 │
│ 10 │ 1 │
│ 15 │ 0 │
└────┴───┘
4 rows
> divisible_by_5(X) <- vals(X), X % 5 = 0
┌────┐
│ X  │
├────┤
│ 10 │
│ 15 │
└────┘
2 rows
(session: 2 rule(s))
> ?divisible_by_5(X)
┌────┐
│ X  │
├────┤
│ 10 │
│ 15 │
└────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_mod_n15t50
Knowledge graph 'test_mod_n15t50' dropped.
