Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_subtract_n15t52
Knowledge graph 'test_subtract_n15t52' created.
Switched to knowledge graph: test_subtract_n15t52
> .kg use test_subtract_n15t52
Switched to knowledge graph: test_subtract_n15t52
> +pairs[(100, 30), (50, 20), (75, 75)]
Inserted 3 fact(s) into 'pairs'.
> diff(A, B, Result) <- pairs(A, B), Result = A - B
┌─────┬────┬────┐
│ X   │ Y  │ Z  │
├─────┼────┼────┤
│  50 │ 20 │ 30 │
│  75 │ 75 │  0 │
│ 100 │ 30 │ 70 │
└─────┴────┴────┘
3 rows
(session: 1 rule(s))
> ?diff(A, B, R)
┌─────┬────┬────┐
│ A   │ B  │ R  │
├─────┼────┼────┤
│  50 │ 20 │ 30 │
│  75 │ 75 │  0 │
│ 100 │ 30 │ 70 │
└─────┴────┴────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_subtract_n15t52
Knowledge graph 'test_subtract_n15t52' dropped.
