Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_complex_expr_n15t53
Knowledge graph 'test_complex_expr_n15t53' created.
Switched to knowledge graph: test_complex_expr_n15t53
> .kg use test_complex_expr_n15t53
Switched to knowledge graph: test_complex_expr_n15t53
> +nums[(2,), (3,), (5,)]
Inserted 3 fact(s) into 'nums'.
> complex(X, Y) <- nums(X), Y = (X + 1) * (X - 1) + X * X
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 2 │  7 │
│ 3 │ 17 │
│ 5 │ 49 │
└───┴────┘
3 rows
(session: 1 rule(s))
> ?complex(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 2 │  7 │
│ 3 │ 17 │
│ 5 │ 49 │
└───┴────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_complex_expr_n15t53
Knowledge graph 'test_complex_expr_n15t53' dropped.
