Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_parens_n15t55
Knowledge graph 'test_parens_n15t55' created.
Switched to knowledge graph: test_parens_n15t55
> .kg use test_parens_n15t55
Switched to knowledge graph: test_parens_n15t55
> +val[(10,)]
Inserted 1 fact(s) into 'val'.
> result(V, R1, R2) <- val(V), R1 = V + 2 * 3, R2 = (V + 2) * 3
┌────┬────┬────┐
│ X  │ Y  │ Z  │
├────┼────┼────┤
│ 10 │ 16 │ 36 │
└────┴────┴────┘
1 rows
(session: 1 rule(s))
> ?result(V, R1, R2)
┌────┬────┬────┐
│ V  │ R1 │ R2 │
├────┼────┼────┤
│ 10 │ 16 │ 36 │
└────┴────┴────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_parens_n15t55
Knowledge graph 'test_parens_n15t55' dropped.
