Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_n11t01
Knowledge graph 'test_str_n11t01' created.
Switched to knowledge graph: test_str_n11t01
> .kg use test_str_n11t01
Switched to knowledge graph: test_str_n11t01
> +person[("alice", 25), ("bob", 30), ("charlie", 35)]
Inserted 3 fact(s) into 'person'.
> ?person(Name, Age)
┌───────────┬─────┐
│ Name      │ Age │
├───────────┼─────┤
│ "alice"   │  25 │
│ "bob"     │  30 │
│ "charlie" │  35 │
└───────────┴─────┘
3 rows
> +city[("alice", "new_york"), ("bob", "boston"), ("charlie", "chicago")]
Inserted 3 fact(s) into 'city'.
> +person_city(Name, Age, City) <- person(Name, Age), city(Name, City)
Rule 'person_city' registered.
> ?person_city(N, A, C)
┌───────────┬────┬────────────┐
│ N         │ A  │ C          │
├───────────┼────┼────────────┤
│ "alice"   │ 25 │ "new_york" │
│ "bob"     │ 30 │ "boston"   │
│ "charlie" │ 35 │ "chicago"  │
└───────────┴────┴────────────┘
3 rows
> +in_boston(Name, Age) <- person(Name, Age), city(Name, "boston")
Rule 'in_boston' registered.
> ?in_boston(X, Y)
┌───────┬────┐
│ X     │ Y  │
├───────┼────┤
│ "bob" │ 30 │
└───────┴────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_n11t01
Knowledge graph 'test_str_n11t01' dropped.
