Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str
Knowledge graph 'test_str' created.
Switched to knowledge graph: test_str
> .kg use test_str
Switched to knowledge graph: test_str
> +person[(1, 25), (2, 30), (3, 35)].
Inserted 3 fact(s) into 'person'.
> ?- person(Id, Age).
3 rows:
  (1, 25)
  (2, 30)
  (3, 35)
> +older(Id, Age) :- person(Id, Age), Age > 28.
Rule 'older' registered.
> ?- older(X, Y).
2 rows:
  (2, 30)
  (3, 35)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str
Knowledge graph 'test_str' dropped.
