Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_int
Knowledge graph 'test_int' created.
Switched to knowledge graph: test_int
> .kg use test_int
Switched to knowledge graph: test_int
> +positive[(1, 100), (2, 200), (3, 300)].
Inserted 3 fact(s) into 'positive'.
> +negative[(-1, -100), (-2, -200), (-3, -300)].
Inserted 3 fact(s) into 'negative'.
> +zeros[(0, 0), (0, 1), (1, 0)].
Inserted 3 fact(s) into 'zeros'.
> ?- positive(X, Y).
3 rows:
  (1, 100)
  (2, 200)
  (3, 300)
> ?- negative(X, Y).
3 rows:
  (-3, -300)
  (-2, -200)
  (-1, -100)
> ?- zeros(X, Y).
3 rows:
  (0, 0)
  (0, 1)
  (1, 0)
> +neg_large(X, Y) :- negative(X, Y), Y < -150.
Rule 'neg_large' registered.
> ?- neg_large(X, Y).
2 rows:
  (-3, -300)
  (-2, -200)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_int
Knowledge graph 'test_int' dropped.
