
> .db create test_large_int
Database 'test_large_int' created.
Switched to database: test_large_int
> .db use test_large_int
Switched to database: test_large_int
> +large_pos[(1000000, 2000000), (999999, 1000001)].
Inserted 2 facts into 'large_pos'.
> +large_neg[(-1000000, -2000000), (-999999, -1000001)].
Inserted 2 facts into 'large_neg'.
> +mixed[(1000000, -1000000), (-999999, 999999)].
Inserted 2 facts into 'mixed'.
> ?- large_pos(X, Y).
2 rows:
  (999999, 1000001)
  (1000000, 2000000)
> ?- large_neg(X, Y).
2 rows:
  (-1000000, -2000000)
  (-999999, -1000001)
> ?- mixed(X, Y).
2 rows:
  (-999999, 999999)
  (1000000, -1000000)
> sum_large(X, Y) := large_pos(X, Y), X + Y > 2500000.
View 'sum_large' registered.
> ?- sum_large(X, Y).
