Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mixed
Knowledge graph 'test_mixed' created.
Switched to knowledge graph: test_mixed
> .kg use test_mixed
Switched to knowledge graph: test_mixed
> +mixed[(1, 100, 10000), (2, 200, 20000), (3, 300, 30000)].
Inserted 3 fact(s) into 'mixed'.
> ?- mixed(Id, Mid, Large).
3 rows:
  (1, 100, 10000)
  (2, 200, 20000)
  (3, 300, 30000)
> +small_ids(Id, M, L) :- mixed(Id, M, L), Id < 10.
Rule 'small_ids' registered.
> ?- small_ids(X, Y, Z).
3 rows:
  (1, 100, 10000)
  (2, 200, 20000)
  (3, 300, 30000)
> +combined(Id, M+L) :- mixed(Id, M, L).
Script error: Parse error: Invalid term: 'M+L'
