Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_int_arith_n11t06
Knowledge graph 'test_int_arith_n11t06' created.
Switched to knowledge graph: test_int_arith_n11t06
> .kg use test_int_arith_n11t06
Switched to knowledge graph: test_int_arith_n11t06
> +nums[(1, 10), (2, 20), (3, 30), (4, 0), (5, -10)].
Inserted 5 fact(s) into 'nums'.
> +added(Id, V+5) :- nums(Id, V).
Rule 'added' registered.
> ?- added(X, Y).
5 rows:
  (1, 15)
  (2, 25)
  (3, 35)
  (4, 5)
  (5, -5)
> +subtracted(Id, V-5) :- nums(Id, V).
Rule 'subtracted' registered.
> ?- subtracted(X, Y).
5 rows:
  (1, 5)
  (2, 15)
  (3, 25)
  (4, -5)
  (5, -15)
> +multiplied(Id, V*2) :- nums(Id, V).
Rule 'multiplied' registered.
> ?- multiplied(X, Y).
5 rows:
  (1, 20)
  (2, 40)
  (3, 60)
  (4, 0)
  (5, -20)
> +divisible[(10, 2), (20, 4), (30, 5), (100, 10)].
Inserted 4 fact(s) into 'divisible'.
> +divided(N, D, N/D) :- divisible(N, D).
Rule 'divided' registered.
> ?- divided(X, Y, Z).
4 rows:
  (10, 2, 5.0)
  (20, 4, 5.0)
  (30, 5, 6.0)
  (100, 10, 10.0)
> +mods[(10, 3), (20, 7), (15, 4)].
Inserted 3 fact(s) into 'mods'.
> +modded(N, D, N%D) :- mods(N, D).
Rule 'modded' registered.
> ?- modded(X, Y, Z).
3 rows:
  (10, 3, 1)
  (15, 4, 3)
  (20, 7, 6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_int_arith_n11t06
Knowledge graph 'test_int_arith_n11t06' dropped.
