Executing script: examples/datalog/11_types/07_numeric_bounds.dl

> .db create test_bounds
Database 'test_bounds' created.
Switched to database: test_bounds
> .db use test_bounds
Switched to database: test_bounds
> +large_pos[(1, 1000000), (2, 2000000), (3, 999999999)].
Inserted 3 facts into 'large_pos'.
> +large_neg[(1, -1000000), (2, -2000000)].
Inserted 2 facts into 'large_neg'.
> ?- large_pos(Id, Val).
3 rows:
  (1, 1000000)
  (2, 2000000)
  (3, 999999999)
> ?- large_neg(Id, Val).
2 rows:
  (1, -1000000)
  (2, -2000000)
> large_sum(Id, V+1) := large_pos(Id, V).
View 'large_sum' registered.
> ?- large_sum(X, Y).
3 rows:
  (1, 1000001)
  (2, 2000001)
  (3, 1000000000)
> big_enough(Id, V) := large_pos(Id, V), V > 1500000.
View 'big_enough' registered.
> ?- big_enough(X, Y).
2 rows:
  (2, 2000000)
  (3, 999999999)
> total_large(sum<V>) := large_pos(_, V).
View 'total_large' registered.
> ?- total_large(S).
1 rows:
  (1002999999)
> .db use default
Switched to database: default
> .db drop test_bounds
Database 'test_bounds' dropped.
