Executing script: examples/datalog/11_types/07_numeric_bounds.dl

> .db create test_bounds
Database 'test_bounds' created.
Switched to database: test_bounds
> .db use test_bounds
Switched to database: test_bounds
> +large_pos[(1, 1000000), (2, 2000000), (3, 999999999)].
Inserted 3 facts into 'large_pos'.
> +large_neg[(1, -1000000), (2, -2000000)].
Inserted 2 facts into 'large_neg'.
> ?- large_pos(Id, Val).
3 rows:
  (1, 1000000)
  (2, 2000000)
  (3, 999999999)
> ?- large_neg(Id, Val).
2 rows:
  (1, -1000000)
  (2, -2000000)
> +large_sum(Id, V+1) :- large_pos(Id, V).
Script error: Line 21: Parse error: Invalid term: 'V+1'
