Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bounds
Knowledge graph 'test_bounds' created.
Switched to knowledge graph: test_bounds
> .kg use test_bounds
Switched to knowledge graph: test_bounds
> +large_pos[(1, 1000000), (2, 2000000), (3, 999999999)].
Inserted 3 fact(s) into 'large_pos'.
> +large_neg[(1, -1000000), (2, -2000000)].
Inserted 2 fact(s) into 'large_neg'.
> ?- large_pos(Id, Val).
3 rows:
  (1, 1000000)
  (2, 2000000)
  (3, 999999999)
> ?- large_neg(Id, Val).
2 rows:
  (1, -1000000)
  (2, -2000000)
> +large_sum(Id, V+1) :- large_pos(Id, V).
Script error: Parse error: Invalid term: 'V+1'
