Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_compare
Knowledge graph 'test_compare' created.
Switched to knowledge graph: test_compare
> .kg use test_compare
Switched to knowledge graph: test_compare
> +vals[(1, 10), (2, 20), (3, 30), (4, 20), (5, 40)].
Inserted 5 fact(s) into 'vals'.
> +less_than_25(Id, V) :- vals(Id, V), V < 25.
Rule 'less_than_25' registered.
> ?- less_than_25(X, Y).
3 rows:
  (1, 10)
  (2, 20)
  (4, 20)
> +less_eq_20(Id, V) :- vals(Id, V), V <= 20.
Rule 'less_eq_20' registered.
> ?- less_eq_20(X, Y).
3 rows:
  (1, 10)
  (2, 20)
  (4, 20)
> +greater_than_25(Id, V) :- vals(Id, V), V > 25.
Rule 'greater_than_25' registered.
> ?- greater_than_25(X, Y).
2 rows:
  (3, 30)
  (5, 40)
> +greater_eq_20(Id, V) :- vals(Id, V), V >= 20.
Rule 'greater_eq_20' registered.
> ?- greater_eq_20(X, Y).
4 rows:
  (2, 20)
  (3, 30)
  (4, 20)
  (5, 40)
> +targets[(20)].
Inserted 1 fact(s) into 'targets'.
> +equals_target(Id, V) :- vals(Id, V), targets(V).
Rule 'equals_target' registered.
> ?- equals_target(X, Y).
2 rows:
  (20, 2)
  (20, 4)
> +not_twenty(Id, V) :- vals(Id, V), !targets(V).
Rule 'not_twenty' registered.
> ?- not_twenty(X, Y).
3 rows:
  (1, 10)
  (3, 30)
  (5, 40)
> +in_range(Id, V) :- vals(Id, V), V > 15, V < 35.
Rule 'in_range' registered.
> ?- in_range(X, Y).
3 rows:
  (2, 20)
  (3, 30)
  (4, 20)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_compare
Knowledge graph 'test_compare' dropped.
