Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_zero
Knowledge graph 'test_zero' created.
Switched to knowledge graph: test_zero
> .kg use test_zero
Switched to knowledge graph: test_zero
> +data[(1, 0), (2, 10), (3, 0), (4, 20)].
Inserted 4 fact(s) into 'data'.
> +zeros(Id) :- data(Id, 0).
Rule 'zeros' registered.
> ?- zeros(X).
2 rows:
  (1)
  (3)
> +nonzeros(Id, V) :- data(Id, V), V > 0.
Rule 'nonzeros' registered.
> ?- nonzeros(X, Y).
2 rows:
  (2, 10)
  (4, 20)
> +plus_zero(Id, V+0) :- data(Id, V).
Script error: Parse error: Invalid term: 'V+0'
