Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_negative
Knowledge graph 'test_negative' created.
Switched to knowledge graph: test_negative
> .kg use test_negative
Switched to knowledge graph: test_negative
> +temps[(1, -10), (2, 5), (3, -20), (4, 15), (5, 0)].
Inserted 5 fact(s) into 'temps'.
> +negatives(Id, T) :- temps(Id, T), T < 0.
Rule 'negatives' registered.
> ?- negatives(X, Y).
2 rows:
  (1, -10)
  (3, -20)
> +non_neg(Id, T) :- temps(Id, T), T >= 0.
Rule 'non_neg' registered.
> ?- non_neg(X, Y).
3 rows:
  (2, 5)
  (4, 15)
  (5, 0)
> +minus_ten(Id, T-10) :- temps(Id, T).
Script error: Parse error: Invalid term: 'T-10'
