Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_negative_n11t10
Knowledge graph 'test_negative_n11t10' created.
Switched to knowledge graph: test_negative_n11t10
> .kg use test_negative_n11t10
Switched to knowledge graph: test_negative_n11t10
> +temps[(1, -10), (2, 5), (3, -20), (4, 15), (5, 0)].
Inserted 5 fact(s) into 'temps'.
> +negatives(Id, T) :- temps(Id, T), T < 0.
Rule 'negatives' registered.
> ?- negatives(X, Y).
2 rows:
  (1, -10)
  (3, -20)
> +non_neg(Id, T) :- temps(Id, T), T >= 0.
Rule 'non_neg' registered.
> ?- non_neg(X, Y).
3 rows:
  (2, 5)
  (4, 15)
  (5, 0)
> +minus_ten(Id, T-10) :- temps(Id, T).
Rule 'minus_ten' registered.
> ?- minus_ten(X, Y).
5 rows:
  (1, -20)
  (2, -5)
  (3, -30)
  (4, 5)
  (5, -10)
> +colder_than_neg5(Id, T) :- temps(Id, T), T < -5.
Rule 'colder_than_neg5' registered.
> ?- colder_than_neg5(X, Y).
2 rows:
  (1, -10)
  (3, -20)
> +total_temp(sum<T>) :- temps(_, T).
Rule 'total_temp' registered.
> ?- total_temp(S).
1 rows:
  (-10)
> +min_temp(min<T>) :- temps(_, T).
Rule 'min_temp' registered.
> +max_temp(max<T>) :- temps(_, T).
Rule 'max_temp' registered.
> ?- min_temp(M).
1 rows:
  (-20)
> ?- max_temp(M).
1 rows:
  (15)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_negative_n11t10
Knowledge graph 'test_negative_n11t10' dropped.
