Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_const_filter
Knowledge graph 'test_const_filter' created.
Switched to knowledge graph: test_const_filter
> .kg use test_const_filter
Switched to knowledge graph: test_const_filter
> +products[(1, "apple", 199, "fruit"), (2, "banana", 99, "fruit"), (3, "bread", 250, "bakery"), (4, "milk", 150, "dairy")].
Inserted 4 fact(s) into 'products'.
> +id_one(Name) :- products(1, Name, _, _).
Rule 'id_one' registered.
> ?- id_one(X).
1 rows:
  ("apple")
> +fruits(Id, Name, Price) :- products(Id, Name, Price, "fruit").
Rule 'fruits' registered.
> ?- fruits(X, Y, Z).
2 rows:
  (1, "apple", 199)
  (2, "banana", 99)
> +find_apple(Id, Price) :- products(Id, "apple", Price, _).
Rule 'find_apple' registered.
> ?- find_apple(X, Y).
1 rows:
  (1, 199)
> +non_fruit(Id, Name) :- products(Id, Name, _, Category), Category != "fruit".
Rule 'non_fruit' registered.
> ?- non_fruit(X, Y).
2 rows:
  (3, "bread")
  (4, "milk")
> +cheap(Id, Name, Price) :- products(Id, Name, Price, _), Price < 200.
Rule 'cheap' registered.
> ?- cheap(X, Y, Z).
3 rows:
  (1, "apple", 199)
  (2, "banana", 99)
  (4, "milk", 150)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_const_filter
Knowledge graph 'test_const_filter' dropped.
