Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_const_filter_n11t13
Knowledge graph 'test_const_filter_n11t13' created.
Switched to knowledge graph: test_const_filter_n11t13
> .kg use test_const_filter_n11t13
Switched to knowledge graph: test_const_filter_n11t13
> +products[(1, "apple", 199, "fruit"), (2, "banana", 99, "fruit"), (3, "bread", 250, "bakery"), (4, "milk", 150, "dairy")]
Inserted 4 fact(s) into 'products'.
> +id_one(Name) <- products(1, Name, _, _)
Rule 'id_one' registered.
> ?id_one(X)
┌─────────┐
│ X       │
├─────────┤
│ "apple" │
└─────────┘
1 rows
> +fruits(Id, Name, Price) <- products(Id, Name, Price, "fruit")
Rule 'fruits' registered.
> ?fruits(X, Y, Z)
┌───┬──────────┬─────┐
│ X │ Y        │ Z   │
├───┼──────────┼─────┤
│ 1 │ "apple"  │ 199 │
│ 2 │ "banana" │  99 │
└───┴──────────┴─────┘
2 rows
> +find_apple(Id, Price) <- products(Id, "apple", Price, _)
Rule 'find_apple' registered.
> ?find_apple(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 199 │
└───┴─────┘
1 rows
> +non_fruit(Id, Name) <- products(Id, Name, _, Category), Category != "fruit"
Rule 'non_fruit' registered.
> ?non_fruit(X, Y)
┌───┬─────────┐
│ X │ Y       │
├───┼─────────┤
│ 3 │ "bread" │
│ 4 │ "milk"  │
└───┴─────────┘
2 rows
> +cheap(Id, Name, Price) <- products(Id, Name, Price, _), Price < 200
Rule 'cheap' registered.
> ?cheap(X, Y, Z)
┌───┬──────────┬─────┐
│ X │ Y        │ Z   │
├───┼──────────┼─────┤
│ 1 │ "apple"  │ 199 │
│ 2 │ "banana" │  99 │
│ 4 │ "milk"   │ 150 │
└───┴──────────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_const_filter_n11t13
Knowledge graph 'test_const_filter_n11t13' dropped.
