Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_null
Knowledge graph 'test_null' created.
Switched to knowledge graph: test_null
> .kg use test_null
Switched to knowledge graph: test_null
> +data[(1, 0), (2, 100), (3, 0), (4, 50)].
Inserted 4 fact(s) into 'data'.
> ?- data(Id, Val), Val = 0.
2 rows:
  (1, 0)
  (3, 0)
> ?- data(Id, Val), Val != 0.
2 rows:
  (2, 100)
  (4, 50)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_null
Knowledge graph 'test_null' dropped.
