Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_cmp_n11t17
Knowledge graph 'test_bool_cmp_n11t17' created.
Switched to knowledge graph: test_bool_cmp_n11t17
> .kg use test_bool_cmp_n11t17
Switched to knowledge graph: test_bool_cmp_n11t17
> +flags[(1, true), (2, false), (3, true), (4, false)].
Inserted 4 fact(s) into 'flags'.
> active(Id) :- flags(Id, Val), Val = true.
2 rows:
  (1)
  (3)
(session: 1 rule(s))
> ?- active(Id).
2 rows:
  (1)
  (3)
> inactive(Id) :- flags(Id, Val), Val = false.
2 rows:
  (2)
  (4)
(session: 2 rule(s))
> ?- inactive(Id).
2 rows:
  (2)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_bool_cmp_n11t17
Knowledge graph 'test_bool_cmp_n11t17' dropped.
