Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_bool_cmp_n11t17
Knowledge graph 'test_bool_cmp_n11t17' created.
Switched to knowledge graph: test_bool_cmp_n11t17
> .kg use test_bool_cmp_n11t17
Switched to knowledge graph: test_bool_cmp_n11t17
> +flags[(1, true), (2, false), (3, true), (4, false)]
Inserted 4 fact(s) into 'flags'.
> active(Id) <- flags(Id, Val), Val = true
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
(session: 1 rule(s))
> ?active(Id)
┌────┐
│ Id │
├────┤
│  1 │
│  3 │
└────┘
2 rows
> inactive(Id) <- flags(Id, Val), Val = false
┌───┐
│ X │
├───┤
│ 2 │
│ 4 │
└───┘
2 rows
(session: 2 rule(s))
> ?inactive(Id)
┌────┐
│ Id │
├────┤
│  2 │
│  4 │
└────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_bool_cmp_n11t17
Knowledge graph 'test_bool_cmp_n11t17' dropped.
