Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mixed_num
Knowledge graph 'test_mixed_num' created.
Switched to knowledge graph: test_mixed_num
> .kg use test_mixed_num
Switched to knowledge graph: test_mixed_num
> +values[(1, 100), (2, 200.5), (3, 300), (4, 400.75)].
Inserted 4 fact(s) into 'values'.
> ?- values(Id, Val).
4 rows:
  (1, 100)
  (2, 200.5)
  (3, 300)
  (4, 400.75)
> ?- values(Id, Val), Val > 200.0.
3 rows:
  (2, 200.5)
  (3, 300)
  (4, 400.75)
> +int_vals[(1, 100), (2, 200), (3, 300)].
Inserted 3 fact(s) into 'int_vals'.
> ?- int_vals(I, V), V > 150.
2 rows:
  (2, 200)
  (3, 300)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_mixed_num
Knowledge graph 'test_mixed_num' dropped.
