Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_n11t20
Knowledge graph 'test_bool_n11t20' created.
Switched to knowledge graph: test_bool_n11t20
> .kg use test_bool_n11t20
Switched to knowledge graph: test_bool_n11t20
> +flags[("feature_a", true), ("feature_b", false), ("feature_c", true)]
Inserted 3 fact(s) into 'flags'.
> ?flags(Name, Value)
┌─────────────┬──────┐
│ col0        │ col1 │
├─────────────┼──────┤
│ "feature_a" │    1 │
│ "feature_b" │    0 │
│ "feature_c" │    1 │
└─────────────┴──────┘
3 rows
> enabled(Name) <- flags(Name, true)
No results.
(session: 1 rule(s))
> ?enabled(Name)
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_bool_n11t20
Knowledge graph 'test_bool_n11t20' dropped.
