Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_bool_n11t20
Knowledge graph 'test_bool_n11t20' created.
Switched to knowledge graph: test_bool_n11t20
> .kg use test_bool_n11t20
Switched to knowledge graph: test_bool_n11t20
> +flags[("feature_a", true), ("feature_b", false), ("feature_c", true)]
Inserted 3 fact(s) into 'flags'.
> ?flags(Name, Value)
┌─────────────┬───────┐
│ Name        │ Value │
├─────────────┼───────┤
│ "feature_a" │ true  │
│ "feature_b" │ false │
│ "feature_c" │ true  │
└─────────────┴───────┘
3 rows
> enabled(Name) <- flags(Name, true)
┌─────────────┐
│ X           │
├─────────────┤
│ "feature_a" │
│ "feature_c" │
└─────────────┘
2 rows
(session: 1 rule(s))
> ?enabled(Name)
┌─────────────┐
│ Name        │
├─────────────┤
│ "feature_a" │
│ "feature_c" │
└─────────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_bool_n11t20
Knowledge graph 'test_bool_n11t20' dropped.
