Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_cmp_n11t22
Knowledge graph 'test_bool_cmp_n11t22' created.
Switched to knowledge graph: test_bool_cmp_n11t22
> .kg use test_bool_cmp_n11t22
Switched to knowledge graph: test_bool_cmp_n11t22
> +flags[(1, true), (2, false), (3, true)]
Inserted 3 fact(s) into 'flags'.
> is_true(Id) <- flags(Id, B), B = true
No results.
(session: 1 rule(s))
> ?is_true(Id)
No results.
> is_false(Id) <- flags(Id, B), B = false
No results.
(session: 2 rule(s))
> ?is_false(Id)
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_bool_cmp_n11t22
Knowledge graph 'test_bool_cmp_n11t22' dropped.
