Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_cmp
Knowledge graph 'test_bool_cmp' created.
Switched to knowledge graph: test_bool_cmp
> .kg use test_bool_cmp
Switched to knowledge graph: test_bool_cmp
> +flags[(1, true), (2, false), (3, true)].
Inserted 3 fact(s) into 'flags'.
> is_true(Id) :- flags(Id, B), B = true.
2 rows:
  (1)
  (3)
(session: 1 rule(s))
> ?- is_true(Id).
2 rows:
  (1)
  (3)
> is_false(Id) :- flags(Id, B), B = false.
1 rows:
  (2)
(session: 2 rule(s))
> ?- is_false(Id).
1 rows:
  (2)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_bool_cmp
Knowledge graph 'test_bool_cmp' dropped.
