Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_nums
Knowledge graph 'test_str_nums' created.
Switched to knowledge graph: test_str_nums
> .kg use test_str_nums
Switched to knowledge graph: test_str_nums
> +codes[("123",), ("456",), ("789",)].
Inserted 3 fact(s) into 'codes'.
> +ids[(123,), (456,), (789,)].
Inserted 3 fact(s) into 'ids'.
> ?- codes(C).
3 rows:
  ("123")
  ("456")
  ("789")
> ?- ids(I).
3 rows:
  (123)
  (456)
  (789)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_nums
Knowledge graph 'test_str_nums' dropped.
