Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_float_prec_n11t23
Knowledge graph 'test_float_prec_n11t23' created.
Switched to knowledge graph: test_float_prec_n11t23
> .kg use test_float_prec_n11t23
Switched to knowledge graph: test_float_prec_n11t23
> +values[(1.1,), (2.22,), (3.333,), (0.1,), (0.01,)]
Inserted 5 fact(s) into 'values'.
> ?values(V)
┌───────┐
│ V     │
├───────┤
│  0.01 │
│   0.1 │
│   1.1 │
│  2.22 │
│ 3.333 │
└───────┘
5 rows
> computed(V, R) <- values(V), R = V * 2.0
┌───────┬───────┐
│ X     │ Y     │
├───────┼───────┤
│  0.01 │  0.02 │
│   0.1 │   0.2 │
│   1.1 │   2.2 │
│  2.22 │  4.44 │
│ 3.333 │ 6.666 │
└───────┴───────┘
5 rows
(session: 1 rule(s))
> ?computed(V, R)
┌───────┬───────┐
│ V     │ R     │
├───────┼───────┤
│  0.01 │  0.02 │
│   0.1 │   0.2 │
│   1.1 │   2.2 │
│  2.22 │  4.44 │
│ 3.333 │ 6.666 │
└───────┴───────┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_float_prec_n11t23
Knowledge graph 'test_float_prec_n11t23' dropped.
