Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_coerce
Knowledge graph 'test_coerce' created.
Switched to knowledge graph: test_coerce
> .kg use test_coerce
Switched to knowledge graph: test_coerce
> +int_vals[(10,), (20,), (30,)].
Inserted 3 fact(s) into 'int_vals'.
> +float_vals[(10.0,), (25.0,), (30.0,)].
Inserted 3 fact(s) into 'float_vals'.
> ?- int_vals(X).
3 rows:
  (10)
  (20)
  (30)
> ?- float_vals(X).
3 rows:
  (10.0)
  (25.0)
  (30.0)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_coerce
Knowledge graph 'test_coerce' dropped.
