Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_int_ops_n11t25
Knowledge graph 'test_int_ops_n11t25' created.
Switched to knowledge graph: test_int_ops_n11t25
> .kg use test_int_ops_n11t25
Switched to knowledge graph: test_int_ops_n11t25
> +nums[(10,), (20,), (30,)].
Inserted 3 fact(s) into 'nums'.
> computed(X, Add, Sub, Mul, Div, Mod) :- nums(X), Add = X + 5, Sub = X - 5, Mul = X * 2, Div = X / 5, Mod = X % 7.
3 rows:
  (10, 15, 5, 20, 2.0, 3)
  (20, 25, 15, 40, 4.0, 6)
  (30, 35, 25, 60, 6.0, 2)
(session: 1 rule(s))
> ?- computed(X, A, S, M, D, R).
3 rows:
  (10, 15, 5, 20, 2.0, 3)
  (20, 25, 15, 40, 4.0, 6)
  (30, 35, 25, 60, 6.0, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_int_ops_n11t25
Knowledge graph 'test_int_ops_n11t25' dropped.
