Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_coerce
Knowledge graph 'test_coerce' created.
Switched to knowledge graph: test_coerce
> .kg use test_coerce
Switched to knowledge graph: test_coerce
> +ints[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'ints'.
> +floats[(1.0,), (2.0,), (4.0,)].
Inserted 3 fact(s) into 'floats'.
> bigger_than_1_5(X) :- ints(X), X > 1.5.
2 rows:
  (2)
  (3)
(session: 1 rule(s))
> ?- bigger_than_1_5(X).
2 rows:
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_coerce
Knowledge graph 'test_coerce' dropped.
