Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_logic_n11t27
Knowledge graph 'test_bool_logic_n11t27' created.
Switched to knowledge graph: test_bool_logic_n11t27
> .kg use test_bool_logic_n11t27
Switched to knowledge graph: test_bool_logic_n11t27
> +flags[(1, true), (2, false), (3, true), (4, false)].
Inserted 4 fact(s) into 'flags'.
> enabled(Id) :- flags(Id, true).
2 rows:
  (1)
  (3)
(session: 1 rule(s))
> disabled(Id) :- flags(Id, false).
2 rows:
  (2)
  (4)
(session: 2 rule(s))
> ?- enabled(Id).
2 rows:
  (1)
  (3)
> ?- disabled(Id).
2 rows:
  (2)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_bool_logic_n11t27
Knowledge graph 'test_bool_logic_n11t27' dropped.
