Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_float_n11t28
Knowledge graph 'test_neg_float_n11t28' created.
Switched to knowledge graph: test_neg_float_n11t28
> .kg use test_neg_float_n11t28
Switched to knowledge graph: test_neg_float_n11t28
> +temps[(-10.5,), (0.0,), (10.5,), (-5.25,)]
Inserted 4 fact(s) into 'temps'.
> ?temps(T)
┌───────┐
│ T     │
├───────┤
│ -10.5 │
│ -5.25 │
│   0.0 │
│  10.5 │
└───────┘
4 rows
> negative(T) <- temps(T), T < 0.0
┌───────┐
│ X     │
├───────┤
│ -10.5 │
│ -5.25 │
└───────┘
2 rows
(session: 1 rule(s))
> ?negative(T)
┌───────┐
│ T     │
├───────┤
│ -10.5 │
│ -5.25 │
└───────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_neg_float_n11t28
Knowledge graph 'test_neg_float_n11t28' dropped.
