Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_float
Knowledge graph 'test_neg_float' created.
Switched to knowledge graph: test_neg_float
> .kg use test_neg_float
Switched to knowledge graph: test_neg_float
> +temps[(-10.5,), (0.0,), (10.5,), (-5.25,)].
Inserted 4 fact(s) into 'temps'.
> ?- temps(T).
4 rows:
  (-10.5)
  (-5.25)
  (0.0)
  (10.5)
> negative(T) :- temps(T), T < 0.0.
2 rows:
  (-10.5)
  (-5.25)
(session: 1 rule(s))
> ?- negative(T).
2 rows:
  (-10.5)
  (-5.25)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_neg_float
Knowledge graph 'test_neg_float' dropped.
