Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_filter_n11t29
Knowledge graph 'test_bool_filter_n11t29' created.
Switched to knowledge graph: test_bool_filter_n11t29
> .kg use test_bool_filter_n11t29
Switched to knowledge graph: test_bool_filter_n11t29
> +features[(1, "feature_a", true), (2, "feature_b", false), (3, "feature_c", true)]
Inserted 3 fact(s) into 'features'.
> enabled(Id, Name) <- features(Id, Name, true)
┌───┬─────────────┐
│ X │ Y           │
├───┼─────────────┤
│ 1 │ "feature_a" │
│ 3 │ "feature_c" │
└───┴─────────────┘
2 rows
(session: 1 rule(s))
> disabled(Id, Name) <- features(Id, Name, false)
┌───┬─────────────┐
│ X │ Y           │
├───┼─────────────┤
│ 2 │ "feature_b" │
└───┴─────────────┘
1 rows
(session: 2 rule(s))
> ?enabled(Id, N)
┌────┬─────────────┐
│ Id │ N           │
├────┼─────────────┤
│  1 │ "feature_a" │
│  3 │ "feature_c" │
└────┴─────────────┘
2 rows
> ?disabled(Id, N)
┌────┬─────────────┐
│ Id │ N           │
├────┼─────────────┤
│  2 │ "feature_b" │
└────┴─────────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_bool_filter_n11t29
Knowledge graph 'test_bool_filter_n11t29' dropped.
