Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_large_int_n11t30
Knowledge graph 'test_large_int_n11t30' created.
Switched to knowledge graph: test_large_int_n11t30
> .kg use test_large_int_n11t30
Switched to knowledge graph: test_large_int_n11t30
> +big_nums[(1000000000,), (2000000000,), (3000000000,)].
Inserted 3 fact(s) into 'big_nums'.
> sum_big(sum<X>) :- big_nums(X).
1 rows:
  (6000000000)
(session: 1 rule(s))
> ?- sum_big(S).
1 rows:
  (6000000000)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_large_int_n11t30
Knowledge graph 'test_large_int_n11t30' dropped.
