Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_lit
Knowledge graph 'test_str_lit' created.
Switched to knowledge graph: test_str_lit
> .kg use test_str_lit
Switched to knowledge graph: test_str_lit
> +items[(1, "active"), (2, "pending"), (3, "active")].
Inserted 3 fact(s) into 'items'.
> active_items(Id) :- items(Id, "active").
2 rows:
  (1)
  (3)
(session: 1 rule(s))
> ?- active_items(Id).
2 rows:
  (1)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_str_lit
Knowledge graph 'test_str_lit' dropped.
