Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_float_prec_n11t31
Knowledge graph 'test_float_prec_n11t31' created.
Switched to knowledge graph: test_float_prec_n11t31
> .kg use test_float_prec_n11t31
Switched to knowledge graph: test_float_prec_n11t31
> +floats[(0.1,), (0.2,), (0.3,)].
Inserted 3 fact(s) into 'floats'.
> sum_float(sum<X>) :- floats(X).
1 rows:
  (0)
(session: 1 rule(s))
> ?- sum_float(S).
1 rows:
  (0)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_float_prec_n11t31
Knowledge graph 'test_float_prec_n11t31' dropped.
