Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mixed
Knowledge graph 'test_mixed' created.
Switched to knowledge graph: test_mixed
> .kg use test_mixed
Switched to knowledge graph: test_mixed
> +mixed[(1, "text", 3.14, true)].
Inserted 1 fact(s) into 'mixed'.
> ?- mixed(I, S, F, B).
1 rows:
  (1, "text", 3.14, "true")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_mixed
Knowledge graph 'test_mixed' dropped.
