Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sci_n11t32
Knowledge graph 'test_sci_n11t32' created.
Switched to knowledge graph: test_sci_n11t32
> .kg use test_sci_n11t32
Switched to knowledge graph: test_sci_n11t32
> +large[(1000000.0,), (2500000.0,)]
Inserted 2 fact(s) into 'large'.
> +small[(0.001,), (0.0025,)]
Inserted 2 fact(s) into 'small'.
> ?large(V)
┌───────────┐
│ col0      │
├───────────┤
│ 1000000.0 │
│ 2500000.0 │
└───────────┘
2 rows
> ?small(V)
┌────────┐
│ col0   │
├────────┤
│  0.001 │
│ 0.0025 │
└────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sci_n11t32
Knowledge graph 'test_sci_n11t32' dropped.
