Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sci
Knowledge graph 'test_sci' created.
Switched to knowledge graph: test_sci
> .kg use test_sci
Switched to knowledge graph: test_sci
> +large[(1000000.0,), (2500000.0,)].
Inserted 2 fact(s) into 'large'.
> +small[(0.001,), (0.0025,)].
Inserted 2 fact(s) into 'small'.
> ?- large(V).
2 rows:
  (1000000.0)
  (2500000.0)
> ?- small(V).
2 rows:
  (0.001)
  (0.0025)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sci
Knowledge graph 'test_sci' dropped.
