Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_int_arith_n11t33
Knowledge graph 'test_int_arith_n11t33' created.
Switched to knowledge graph: test_int_arith_n11t33
> .kg use test_int_arith_n11t33
Switched to knowledge graph: test_int_arith_n11t33
> +nums[(100,), (7,)]
Inserted 2 fact(s) into 'nums'.
> ops(N, Add, Sub, Mul, Div, Mod) <- nums(N), N = 100,
Unsafe rule 'ops': Head variable(s) Add, Div, Mod, Mul, Sub not bound by any positive body atom. All head variables must appear in at least one positive body predicate.
> Add = N + 23,
Parse error: Unrecognized statement: Add = N + 23,
> Sub = N - 23,
Parse error: Unrecognized statement: Sub = N - 23,
> Mul = N * 3,
Parse error: Unrecognized statement: Mul = N * 3,
> Div = N / 7,
Parse error: Unrecognized statement: Div = N / 7,
> Mod = N % 7
Parse error: Unrecognized statement: Mod = N % 7
> ?ops(N, A, S, M, D, R)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_int_arith_n11t33
Knowledge graph 'test_int_arith_n11t33' dropped.
