Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_int_arith_n11t33
Knowledge graph 'test_int_arith_n11t33' created.
Switched to knowledge graph: test_int_arith_n11t33
> .kg use test_int_arith_n11t33
Switched to knowledge graph: test_int_arith_n11t33
> +nums[(100,), (7,)].
Inserted 2 fact(s) into 'nums'.
> ops(N, Add, Sub, Mul, Div, Mod) :- nums(N), N = 100, Add = N + 23, Sub = N - 23, Mul = N * 3, Div = N / 7, Mod = N % 7.
1 rows:
  (100, 123, 77, 300, 14.285714285714286, 2)
(session: 1 rule(s))
> ?- ops(N, A, S, M, D, R).
1 rows:
  (100, 123, 77, 300, 14.285714285714286, 2)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_int_arith_n11t33
Knowledge graph 'test_int_arith_n11t33' dropped.
