Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bool_ops_n11t34
Knowledge graph 'test_bool_ops_n11t34' created.
Switched to knowledge graph: test_bool_ops_n11t34
> .kg use test_bool_ops_n11t34
Switched to knowledge graph: test_bool_ops_n11t34
> +flags[(1, true), (2, false), (3, true), (4, false)]
Inserted 4 fact(s) into 'flags'.
> true_flags(Id) <- flags(Id, true)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
└──────┘
2 rows
(session: 1 rule(s))
> false_flags(Id) <- flags(Id, false)
┌──────┐
│ col0 │
├──────┤
│    2 │
│    4 │
└──────┘
2 rows
(session: 2 rule(s))
> ?true_flags(Id)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
└──────┘
2 rows
> ?false_flags(Id)
┌──────┐
│ col0 │
├──────┤
│    2 │
│    4 │
└──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_bool_ops_n11t34
Knowledge graph 'test_bool_ops_n11t34' dropped.
