Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_empty_type
Knowledge graph 'test_empty_type' created.
Switched to knowledge graph: test_empty_type
> .kg use test_empty_type
Switched to knowledge graph: test_empty_type
> +data[(1, "a"), (2, "b")].
Inserted 2 fact(s) into 'data'.
> empty_result(Id, Val) :- data(Id, Val), Id > 100.
No results.
(session: 1 rule(s))
> ?- empty_result(Id, Val).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_empty_type
Knowledge graph 'test_empty_type' dropped.
