Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_special_n11t37
Knowledge graph 'test_str_special_n11t37' created.
Switched to knowledge graph: test_str_special_n11t37
> .kg use test_str_special_n11t37
Switched to knowledge graph: test_str_special_n11t37
> +text[("hello-world",), ("foo_bar",), ("test.case",), ("a/b/c",)]
Inserted 4 fact(s) into 'text'.
> ?text(T)
┌───────────────┐
│ T             │
├───────────────┤
│ "a/b/c"       │
│ "foo_bar"     │
│ "hello-world" │
│ "test.case"   │
└───────────────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_special_n11t37
Knowledge graph 'test_str_special_n11t37' dropped.
