Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_special
Knowledge graph 'test_str_special' created.
Switched to knowledge graph: test_str_special
> .kg use test_str_special
Switched to knowledge graph: test_str_special
> +text[("hello-world",), ("foo_bar",), ("test.case",), ("a/b/c",)].
Inserted 4 fact(s) into 'text'.
> ?- text(T).
4 rows:
  ("a/b/c")
  ("foo_bar")
  ("hello-world")
  ("test.case")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_special
Knowledge graph 'test_str_special' dropped.
