Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_float_cmp_n11t38
Knowledge graph 'test_float_cmp_n11t38' created.
Switched to knowledge graph: test_float_cmp_n11t38
> .kg use test_float_cmp_n11t38
Switched to knowledge graph: test_float_cmp_n11t38
> +values[(1.5,), (2.5,), (0.5,), (3.0,)]
Inserted 4 fact(s) into 'values'.
> big(V) <- values(V), V > 1.0
┌──────┐
│ col0 │
├──────┤
│  1.5 │
│  2.5 │
│  3.0 │
└──────┘
3 rows
(session: 1 rule(s))
> ?big(V)
┌──────┐
│ col0 │
├──────┤
│  1.5 │
│  2.5 │
│  3.0 │
└──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_float_cmp_n11t38
Knowledge graph 'test_float_cmp_n11t38' dropped.
