Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_type_infer
Knowledge graph 'test_type_infer' created.
Switched to knowledge graph: test_type_infer
> .kg use test_type_infer
Switched to knowledge graph: test_type_infer
> +mixed[(1, "text", 1.5, true)].
Inserted 1 fact(s) into 'mixed'.
> ?- mixed(A, B, C, D).
1 rows:
  (1, "text", 1.5, "true")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_type_infer
Knowledge graph 'test_type_infer' dropped.
