Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_true_false_n11t40
Knowledge graph 'test_true_false_n11t40' created.
Switched to knowledge graph: test_true_false_n11t40
> .kg use test_true_false_n11t40
Switched to knowledge graph: test_true_false_n11t40
> +flags[(1, true), (2, false), (3, true)]
Inserted 3 fact(s) into 'flags'.
> is_true(Id) <- flags(Id, true)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
(session: 1 rule(s))
> is_false(Id) <- flags(Id, false)
┌───┐
│ X │
├───┤
│ 2 │
└───┘
1 rows
(session: 2 rule(s))
> ?is_true(Id)
┌────┐
│ Id │
├────┤
│  1 │
│  3 │
└────┘
2 rows
> ?is_false(Id)
┌────┐
│ Id │
├────┤
│  2 │
└────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_true_false_n11t40
Knowledge graph 'test_true_false_n11t40' dropped.
