Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_zero_empty
Knowledge graph 'test_zero_empty' created.
Switched to knowledge graph: test_zero_empty
> .kg use test_zero_empty
Switched to knowledge graph: test_zero_empty
> +data[(0, "", 0.0, false)].
Inserted 1 fact(s) into 'data'.
> ?- data(A, B, C, D).
1 rows:
  (0, "", 0.0, "false")
> has_zero(A, B, C, D) :- data(A, B, C, D), A = 0.
1 rows:
  (0, "", 0.0, "false")
(session: 1 rule(s))
> ?- has_zero(A, B, C, D).
1 rows:
  (0, "", 0.0, "false")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_zero_empty
Knowledge graph 'test_zero_empty' dropped.
