Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_zero_empty_n11t41
Knowledge graph 'test_zero_empty_n11t41' created.
Switched to knowledge graph: test_zero_empty_n11t41
> .kg use test_zero_empty_n11t41
Switched to knowledge graph: test_zero_empty_n11t41
> +data[(0, "", 0.0, false)]
Inserted 1 fact(s) into 'data'.
> ?data(A, B, C, D)
┌──────┬──────┬──────┬───────┐
│ col0 │ col1 │ col2 │ col3  │
├──────┼──────┼──────┼───────┤
│    0 │ ""   │  0.0 │ false │
└──────┴──────┴──────┴───────┘
1 rows
> has_zero(A, B, C, D) <- data(A, B, C, D), A = 0
┌──────┬──────┬──────┬───────┐
│ col0 │ col1 │ col2 │ col3  │
├──────┼──────┼──────┼───────┤
│    0 │ ""   │  0.0 │ false │
└──────┴──────┴──────┴───────┘
1 rows
(session: 1 rule(s))
> ?has_zero(A, B, C, D)
┌──────┬──────┬──────┬───────┐
│ col0 │ col1 │ col2 │ col3  │
├──────┼──────┼──────┼───────┤
│    0 │ ""   │  0.0 │ false │
└──────┴──────┴──────┴───────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_zero_empty_n11t41
Knowledge graph 'test_zero_empty_n11t41' dropped.
