Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_null_n11t45
Knowledge graph 'test_null_n11t45' created.
Switched to knowledge graph: test_null_n11t45
> .kg use test_null_n11t45
Switched to knowledge graph: test_null_n11t45
> +data[(1, 0), (2, 100), (3, 0), (4, 50)]
Inserted 4 fact(s) into 'data'.
> ?data(Id, Val), Val = 0
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │   0 │
│  3 │   0 │
└────┴─────┘
2 rows
> ?data(Id, Val), Val != 0
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  2 │ 100 │
│  4 │  50 │
└────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_null_n11t45
Knowledge graph 'test_null_n11t45' dropped.
