Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_float_special_n11t48
Knowledge graph 'test_float_special_n11t48' created.
Switched to knowledge graph: test_float_special_n11t48
> .kg use test_float_special_n11t48
Switched to knowledge graph: test_float_special_n11t48
> +divs[(10.0, 0.0), (5.0, 2.0), (-10.0, 0.0)].
Inserted 3 fact(s) into 'divs'.
> div_result(A, B, R) :- divs(A, B), B != 0.0, R = A / B.
1 rows:
  (5.0, 2.0, 2.5)
(session: 1 rule(s))
> ?- div_result(A, B, R).
1 rows:
  (5.0, 2.0, 2.5)
> +big_floats[(1.0e308, 1), (1.0e-308, 2)].
Inserted 2 fact(s) into 'big_floats'.
> ?- big_floats(Val, Id).
2 rows:
  (1e-308, 2)
  (1e308, 1)
> +tiny[(1.0e-100, 2.0e-100)].
Inserted 1 fact(s) into 'tiny'.
> tiny_add(A, B, R) :- tiny(A, B), R = A + B.
1 rows:
  (1e-100, 2e-100, 3e-100)
(session: 2 rule(s))
> ?- tiny_add(A, B, R).
1 rows:
  (1e-100, 2e-100, 3e-100)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_float_special_n11t48
Knowledge graph 'test_float_special_n11t48' dropped.
