Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_float_special_n11t48
Knowledge graph 'test_float_special_n11t48' created.
Switched to knowledge graph: test_float_special_n11t48
> .kg use test_float_special_n11t48
Switched to knowledge graph: test_float_special_n11t48
> +divs[(10.0, 0.0), (5.0, 2.0), (-10.0, 0.0)]
Inserted 3 fact(s) into 'divs'.
> div_result(A, B, R) <- divs(A, B), B != 0.0, R = A / B
┌─────┬─────┬─────┐
│ X   │ Y   │ Z   │
├─────┼─────┼─────┤
│ 5.0 │ 2.0 │ 2.5 │
└─────┴─────┴─────┘
1 rows
(session: 1 rule(s))
> ?div_result(A, B, R)
┌─────┬─────┬─────┐
│ A   │ B   │ R   │
├─────┼─────┼─────┤
│ 5.0 │ 2.0 │ 2.5 │
└─────┴─────┴─────┘
1 rows
> +big_floats[(1.0e308, 1), (1.0e-308, 2)]
Inserted 2 fact(s) into 'big_floats'.
> ?big_floats(Val, Id)
┌────────┬────┐
│ Val    │ Id │
├────────┼────┤
│ 1e-308 │  2 │
│  1e308 │  1 │
└────────┴────┘
2 rows
> +tiny[(1.0e-100, 2.0e-100)]
Inserted 1 fact(s) into 'tiny'.
> tiny_add(A, B, R) <- tiny(A, B), R = A + B
┌────────┬────────┬────────┐
│ X      │ Y      │ Z      │
├────────┼────────┼────────┤
│ 1e-100 │ 2e-100 │ 3e-100 │
└────────┴────────┴────────┘
1 rows
(session: 2 rule(s))
> ?tiny_add(A, B, R)
┌────────┬────────┬────────┐
│ A      │ B      │ R      │
├────────┼────────┼────────┤
│ 1e-100 │ 2e-100 │ 3e-100 │
└────────┴────────┴────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_float_special_n11t48
Knowledge graph 'test_float_special_n11t48' dropped.
