Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mixed_cmp_n11t50
Knowledge graph 'test_mixed_cmp_n11t50' created.
Switched to knowledge graph: test_mixed_cmp_n11t50
> .kg use test_mixed_cmp_n11t50
Switched to knowledge graph: test_mixed_cmp_n11t50
> +int_vals[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'int_vals'.
> +float_vals[(1.5,), (2.5,), (3.5,)]
Inserted 3 fact(s) into 'float_vals'.
> big_int(X) <- int_vals(X), X > 1.5
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
└───┘
2 rows
(session: 1 rule(s))
> small_float(X) <- float_vals(X), X < 3
┌─────┐
│ X   │
├─────┤
│ 1.5 │
│ 2.5 │
└─────┘
2 rows
(session: 2 rule(s))
> ?big_int(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
└───┘
2 rows
> ?small_float(X)
┌─────┐
│ X   │
├─────┤
│ 1.5 │
│ 2.5 │
└─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_mixed_cmp_n11t50
Knowledge graph 'test_mixed_cmp_n11t50' dropped.
