Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_mixed_num_n11t51
Knowledge graph 'test_mixed_num_n11t51' created.
Switched to knowledge graph: test_mixed_num_n11t51
> .kg use test_mixed_num_n11t51
Switched to knowledge graph: test_mixed_num_n11t51
> +measurements[(1, 10, 2.5), (2, 20, 3.0), (3, 15, 1.5)]
Inserted 3 fact(s) into 'measurements'.
> computed(Id, Result) <- measurements(Id, Int, Float), Result = Int * Float
┌───┬──────┐
│ X │ Y    │
├───┼──────┤
│ 1 │ 25.0 │
│ 2 │ 60.0 │
│ 3 │ 22.5 │
└───┴──────┘
3 rows
(session: 1 rule(s))
> ?computed(Id, R)
┌────┬──────┐
│ Id │ R    │
├────┼──────┤
│  1 │ 25.0 │
│  2 │ 60.0 │
│  3 │ 22.5 │
└────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_mixed_num_n11t51
Knowledge graph 'test_mixed_num_n11t51' dropped.
