Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_str_ops_n11t52
Knowledge graph 'test_str_ops_n11t52' created.
Switched to knowledge graph: test_str_ops_n11t52
> .kg use test_str_ops_n11t52
Switched to knowledge graph: test_str_ops_n11t52
> +names[(1, "alice"), (2, "bob"), (3, "alice"), (4, "carol")]
Inserted 4 fact(s) into 'names'.
> is_alice(Id) <- names(Id, "alice")
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
└──────┘
2 rows
(session: 1 rule(s))
> ?is_alice(Id)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
└──────┘
2 rows
> distinct_name(N) <- names(_, N)
┌─────────┐
│ col0    │
├─────────┤
│ "alice" │
│ "bob"   │
│ "carol" │
└─────────┘
3 rows
(session: 2 rule(s))
> ?distinct_name(N)
┌─────────┐
│ col0    │
├─────────┤
│ "alice" │
│ "bob"   │
│ "carol" │
└─────────┘
3 rows
> +name_count(Name, count<Id>) <- names(Id, Name)
Rule 'name_count' registered.
> ?name_count(Name, Count)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "alice" │    2 │
│ "bob"   │    1 │
│ "carol" │    1 │
└─────────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_str_ops_n11t52
Knowledge graph 'test_str_ops_n11t52' dropped.
