Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_str_nums_n11t53
Knowledge graph 'test_str_nums_n11t53' created.
Switched to knowledge graph: test_str_nums_n11t53
> .kg use test_str_nums_n11t53
Switched to knowledge graph: test_str_nums_n11t53
> +codes[("123",), ("456",), ("789",)]
Inserted 3 fact(s) into 'codes'.
> +ids[(123,), (456,), (789,)]
Inserted 3 fact(s) into 'ids'.
> ?codes(C)
┌───────┐
│ C     │
├───────┤
│ "123" │
│ "456" │
│ "789" │
└───────┘
3 rows
> ?ids(I)
┌─────┐
│ I   │
├─────┤
│ 123 │
│ 456 │
│ 789 │
└─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_str_nums_n11t53
Knowledge graph 'test_str_nums_n11t53' dropped.
