Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_small_floats_n11t54
Knowledge graph 'test_small_floats_n11t54' created.
Switched to knowledge graph: test_small_floats_n11t54
> .kg use test_small_floats_n11t54
Switched to knowledge graph: test_small_floats_n11t54
> +tiny[(1.0e-100,), (2.0e-100,), (3.0e-100,)]
Inserted 3 fact(s) into 'tiny'.
> +sum_tiny(sum<X>) <- tiny(X)
Rule 'sum_tiny' registered.
> ?sum_tiny(S)
┌───┐
│ S │
├───┤
│ 0 │
└───┘
1 rows
> tiny_cmp(A, B) <- tiny(A), tiny(B), A < B
┌────────┬────────┐
│ X      │ Y      │
├────────┼────────┤
│ 1e-100 │ 2e-100 │
│ 1e-100 │ 3e-100 │
│ 2e-100 │ 3e-100 │
└────────┴────────┘
3 rows
(session: 1 rule(s))
> ?tiny_cmp(A, B)
┌────────┬────────┐
│ A      │ B      │
├────────┼────────┤
│ 1e-100 │ 2e-100 │
│ 1e-100 │ 3e-100 │
│ 2e-100 │ 3e-100 │
└────────┴────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_small_floats_n11t54
Knowledge graph 'test_small_floats_n11t54' dropped.
