Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_null_n11t56
Knowledge graph 'test_null_n11t56' created.
Switched to knowledge graph: test_null_n11t56
> .kg use test_null_n11t56
Switched to knowledge graph: test_null_n11t56
> +data[(1, "value"), (2, ""), (3, "another")]
Inserted 3 fact(s) into 'data'.
> non_empty(Id, Val) <- data(Id, Val), Val != ""
┌───┬───────────┐
│ X │ Y         │
├───┼───────────┤
│ 1 │ "value"   │
│ 3 │ "another" │
└───┴───────────┘
2 rows
(session: 1 rule(s))
> ?non_empty(Id, Val)
┌────┬───────────┐
│ Id │ Val       │
├────┼───────────┤
│  1 │ "value"   │
│  3 │ "another" │
└────┴───────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_null_n11t56
Knowledge graph 'test_null_n11t56' dropped.
