Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_coerce_n11t58
Knowledge graph 'test_coerce_n11t58' created.
Switched to knowledge graph: test_coerce_n11t58
> .kg use test_coerce_n11t58
Switched to knowledge graph: test_coerce_n11t58
> +ints[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'ints'.
> +floats[(1.0,), (2.0,), (4.0,)]
Inserted 3 fact(s) into 'floats'.
> bigger_than_1_5(X) <- ints(X), X > 1.5
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
└───┘
2 rows
(session: 1 rule(s))
> ?bigger_than_1_5(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_coerce_n11t58
Knowledge graph 'test_coerce_n11t58' dropped.
