Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_type_pres_n11t59
Knowledge graph 'test_type_pres_n11t59' created.
Switched to knowledge graph: test_type_pres_n11t59
> .kg use test_type_pres_n11t59
Switched to knowledge graph: test_type_pres_n11t59
> +mixed[(1, "text", 3.14, true)]
Inserted 1 fact(s) into 'mixed'.
> pass_through(A, B, C, D) <- mixed(A, B, C, D)
┌──────┬────────┬──────┬──────┐
│ col0 │ col1   │ col2 │ col3 │
├──────┼────────┼──────┼──────┤
│    1 │ "text" │ 3.14 │ true │
└──────┴────────┴──────┴──────┘
1 rows
(session: 1 rule(s))
> ?pass_through(A, B, C, D)
┌──────┬────────┬──────┬──────┐
│ col0 │ col1   │ col2 │ col3 │
├──────┼────────┼──────┼──────┤
│    1 │ "text" │ 3.14 │ true │
└──────┴────────┴──────┴──────┘
1 rows
> int_only(X) <- mixed(X, _, _, _)
┌──────┐
│ col0 │
├──────┤
│    1 │
└──────┘
1 rows
(session: 2 rule(s))
> str_only(X) <- mixed(_, X, _, _)
┌────────┐
│ col0   │
├────────┤
│ "text" │
└────────┘
1 rows
(session: 3 rule(s))
> float_only(X) <- mixed(_, _, X, _)
┌──────┐
│ col0 │
├──────┤
│ 3.14 │
└──────┘
1 rows
(session: 4 rule(s))
> bool_only(X) <- mixed(_, _, _, X)
┌──────┐
│ col0 │
├──────┤
│ true │
└──────┘
1 rows
(session: 5 rule(s))
> ?int_only(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
└──────┘
1 rows
> ?str_only(X)
┌────────┐
│ col0   │
├────────┤
│ "text" │
└────────┘
1 rows
> ?float_only(X)
┌──────┐
│ col0 │
├──────┤
│ 3.14 │
└──────┘
1 rows
> ?bool_only(X)
┌──────┐
│ col0 │
├──────┤
│ true │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 5 session rule(s), 0 session fact(s))
> .kg drop test_type_pres_n11t59
Knowledge graph 'test_type_pres_n11t59' dropped.
