Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_zero_n11t60
Knowledge graph 'test_zero_n11t60' created.
Switched to knowledge graph: test_zero_n11t60
> .kg use test_zero_n11t60
Switched to knowledge graph: test_zero_n11t60
> +nums[(0,), (1,), (10,)]
Inserted 3 fact(s) into 'nums'.
> computed(N, Plus, Times) <- nums(N), Plus = N + 0, Times = N * 0
┌────┬────┬───┐
│ X  │ Y  │ Z │
├────┼────┼───┤
│  0 │  0 │ 0 │
│  1 │  1 │ 0 │
│ 10 │ 10 │ 0 │
└────┴────┴───┘
3 rows
(session: 1 rule(s))
> ?computed(N, P, T)
┌────┬────┬───┐
│ N  │ P  │ T │
├────┼────┼───┤
│  0 │  0 │ 0 │
│  1 │  1 │ 0 │
│ 10 │ 10 │ 0 │
└────┴────┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_zero_n11t60
Knowledge graph 'test_zero_n11t60' dropped.
