Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mixed_n11t62
Knowledge graph 'test_mixed_n11t62' created.
Switched to knowledge graph: test_mixed_n11t62
> .kg use test_mixed_n11t62
Switched to knowledge graph: test_mixed_n11t62
> +mixed[(1, "text", 3.14, true)]
Inserted 1 fact(s) into 'mixed'.
> ?mixed(I, S, F, B)
┌───┬────────┬──────┬──────┐
│ I │ S      │ F    │ B    │
├───┼────────┼──────┼──────┤
│ 1 │ "text" │ 3.14 │ true │
└───┴────────┴──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_mixed_n11t62
Knowledge graph 'test_mixed_n11t62' dropped.
