Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_mixed_types_n11t63
Knowledge graph 'test_mixed_types_n11t63' created.
Switched to knowledge graph: test_mixed_types_n11t63
> .kg use test_mixed_types_n11t63
Switched to knowledge graph: test_mixed_types_n11t63
> +mixed[(1, "Alice", 100.5, true), (2, "Bob", 200.75, false)].
Inserted 2 fact(s) into 'mixed'.
> names(N) :- mixed(_, N, _, _).
2 rows:
  ("Alice")
  ("Bob")
(session: 1 rule(s))
> amounts(A) :- mixed(_, _, A, _).
2 rows:
  (100.5)
  (200.75)
(session: 2 rule(s))
> flags(F) :- mixed(_, _, _, F).
2 rows:
  ("false")
  ("true")
(session: 3 rule(s))
> ?- names(N).
2 rows:
  ("Alice")
  ("Bob")
> ?- amounts(A).
2 rows:
  (100.5)
  (200.75)
> ?- flags(F).
2 rows:
  ("false")
  ("true")
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_mixed_types_n11t63
Knowledge graph 'test_mixed_types_n11t63' dropped.
