Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_int_float_n11t64
Knowledge graph 'test_int_float_n11t64' created.
Switched to knowledge graph: test_int_float_n11t64
> .kg use test_int_float_n11t64
Switched to knowledge graph: test_int_float_n11t64
> +ints[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'ints'.
> +floats[(1.5,), (2.5,), (3.5,)]
Inserted 3 fact(s) into 'floats'.
> int_plus_float(X, Y) <- ints(X), Y = X + 0.5
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 1.5 │
│ 2 │ 2.5 │
│ 3 │ 3.5 │
└───┴─────┘
3 rows
(session: 1 rule(s))
> ?int_plus_float(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 1.5 │
│ 2 │ 2.5 │
│ 3 │ 3.5 │
└───┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_int_float_n11t64
Knowledge graph 'test_int_float_n11t64' dropped.
