Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_multi_types_n11t68
Knowledge graph 'test_multi_types_n11t68' created.
Switched to knowledge graph: test_multi_types_n11t68
> .kg use test_multi_types_n11t68
Switched to knowledge graph: test_multi_types_n11t68
> type ProductId: int
Type 'ProductId' declared.
> type Price: int
Type 'Price' declared.
> type Quantity: int
Type 'Quantity' declared.
> type ProductName: string
Type 'ProductName' declared.
> +products(id: ProductId, name: ProductName, price: Price)
Schema for 'products' registered with 3 columns (persistent)
> +inventory(product_id: ProductId, qty: Quantity)
Schema for 'inventory' registered with 2 columns (persistent)
> +products[(1, "Widget", 100), (2, "Gadget", 200), (3, "Gizmo", 150)]
Inserted 3 fact(s) into 'products'.
> +inventory[(1, 50), (2, 30), (3, 75)]
Inserted 3 fact(s) into 'inventory'.
> ?products(Id, Name, Price)
┌────┬──────────┬───────┐
│ id │ name     │ price │
├────┼──────────┼───────┤
│  1 │ "Widget" │   100 │
│  2 │ "Gadget" │   200 │
│  3 │ "Gizmo"  │   150 │
└────┴──────────┴───────┘
3 rows
> ?inventory(Pid, Qty)
┌────────────┬─────┐
│ product_id │ qty │
├────────────┼─────┤
│          1 │  50 │
│          2 │  30 │
│          3 │  75 │
└────────────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_types_n11t68
Knowledge graph 'test_multi_types_n11t68' dropped.
