Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_types_n11t68
Knowledge graph 'test_multi_types_n11t68' created.
Switched to knowledge graph: test_multi_types_n11t68
> .kg use test_multi_types_n11t68
Switched to knowledge graph: test_multi_types_n11t68
> type ProductId: int
Type 'ProductId' declared (local only).
> type Price: int
Type 'Price' declared (local only).
> type Quantity: int
Type 'Quantity' declared (local only).
> type ProductName: string
Type 'ProductName' declared (local only).
> +products(id: ProductId, name: ProductName, price: Price)
Script error: Query execution failed: Invalid term: 'id: ProductId'
