Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_n08t01
Knowledge graph 'test_neg_n08t01' created.
Switched to knowledge graph: test_neg_n08t01
> .kg use test_neg_n08t01
Switched to knowledge graph: test_neg_n08t01
> +edge[(1,2), (2,3), (3,4), (4,5)]
Inserted 4 fact(s) into 'edge'.
> +skip[(2,3), (4,5)]
Inserted 2 fact(s) into 'skip'.
> +filtered(X, Y) <- edge(X, Y), !skip(X, Y)
Rule 'filtered' registered.
> ?filtered(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    3 │    4 │
└──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_n08t01
Knowledge graph 'test_neg_n08t01' dropped.
