Executing script: examples/datalog/08_negation/03_negation_empty_result.dl

> .db create test_neg_empty
Database 'test_neg_empty' created.
Switched to database: test_neg_empty
> .db use test_neg_empty
Switched to database: test_neg_empty
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 facts into 'edge'.
> +blocked[(1,2), (2,3), (3,4)].
Inserted 3 facts into 'blocked'.
> +allowed(X, Y) :- edge(X, Y), !blocked(X, Y).
Rule 'allowed' registered.
> ?- allowed(X, Y).
No results.
> .db use default
Switched to database: default
> .db drop test_neg_empty
Database 'test_neg_empty' dropped.
