Executing script: examples/datalog/08_negation/04_negation_no_match.dl

> .db create test_neg_nomatch
Database 'test_neg_nomatch' created.
Switched to database: test_neg_nomatch
> .db use test_neg_nomatch
Switched to database: test_neg_nomatch
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 facts into 'edge'.
> +blocked[(10,20), (30,40)].
Inserted 2 facts into 'blocked'.
> +allowed(X, Y) :- edge(X, Y), !blocked(X, Y).
Rule 'allowed' registered.
> ?- allowed(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> .db use default
Switched to database: default
> .db drop test_neg_nomatch
Database 'test_neg_nomatch' dropped.
