Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_nomatch
Knowledge graph 'test_neg_nomatch' created.
Switched to knowledge graph: test_neg_nomatch
> .kg use test_neg_nomatch
Switched to knowledge graph: test_neg_nomatch
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> +blocked[(10,20), (30,40)].
Inserted 2 fact(s) into 'blocked'.
> +allowed(X, Y) :- edge(X, Y), !blocked(X, Y).
Rule 'allowed' registered.
> ?- allowed(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_nomatch
Knowledge graph 'test_neg_nomatch' dropped.
