Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_self_n08t06
Knowledge graph 'test_neg_self_n08t06' created.
Switched to knowledge graph: test_neg_self_n08t06
> .kg use test_neg_self_n08t06
Switched to knowledge graph: test_neg_self_n08t06
> +edge[(1, 2), (2, 3), (3, 4), (1, 3), (2, 4)].
Inserted 5 fact(s) into 'edge'.
> +source_node(X, Y) :- edge(X, Y).
Rule 'source_node' registered.
> +target_node(Y, X) :- edge(X, Y).
Rule 'target_node' registered.
> +pure_source(X, Y) :- source_node(X, Y), !target_node(X, _).
Rule 'pure_source' registered.
> ?- pure_source(X, Y).
2 rows:
  (1, 2)
  (1, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_self_n08t06
Knowledge graph 'test_neg_self_n08t06' dropped.
