Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_filter_n08t07
Knowledge graph 'test_neg_filter_n08t07' created.
Switched to knowledge graph: test_neg_filter_n08t07
> .kg use test_neg_filter_n08t07
Switched to knowledge graph: test_neg_filter_n08t07
> +data[(1, 10), (2, 20), (3, 30), (4, 40), (5, 50)].
Inserted 5 fact(s) into 'data'.
> +excluded[(2, 0), (4, 0)].
Inserted 2 fact(s) into 'excluded'.
> +filtered(Id, Val) :- data(Id, Val), Id > 1, Val > 15, !excluded(Id, _).
Rule 'filtered' registered.
> ?- filtered(X, Y).
2 rows:
  (3, 30)
  (5, 50)
> +small_allowed(Id, Val) :- data(Id, Val), Val < 35, !excluded(Id, _).
Rule 'small_allowed' registered.
> ?- small_allowed(X, Y).
2 rows:
  (1, 10)
  (3, 30)
> +specific(Id, Val) :- data(Id, Val), Val = 30, !excluded(Id, _).
Rule 'specific' registered.
> ?- specific(X, Y).
1 rows:
  (3, 30)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_filter_n08t07
Knowledge graph 'test_neg_filter_n08t07' dropped.
