Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_partial_n08t09
Knowledge graph 'test_neg_partial_n08t09' created.
Switched to knowledge graph: test_neg_partial_n08t09
> .kg use test_neg_partial_n08t09
Switched to knowledge graph: test_neg_partial_n08t09
> +assignment[(1, 100), (1, 200), (2, 100), (2, 300), (3, 200), (3, 300), (4, 100)]
Inserted 7 fact(s) into 'assignment'.
> +restricted[(100, 0), (300, 0)]
Inserted 2 fact(s) into 'restricted'.
> +has_open_project(Emp, Proj) <- assignment(Emp, Proj), !restricted(Proj, _)
Rule 'has_open_project' registered.
> ?has_open_project(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 200 │
│ 3 │ 200 │
└───┴─────┘
2 rows
> ?has_open_project(E, P)
┌───┬─────┐
│ E │ P   │
├───┼─────┤
│ 1 │ 200 │
│ 3 │ 200 │
└───┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_partial_n08t09
Knowledge graph 'test_neg_partial_n08t09' dropped.
