Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_empty_excl_n08t10
Knowledge graph 'test_neg_empty_excl_n08t10' created.
Switched to knowledge graph: test_neg_empty_excl_n08t10
> .kg use test_neg_empty_excl_n08t10
Switched to knowledge graph: test_neg_empty_excl_n08t10
> +data[(1, 10), (2, 20), (3, 30)].
Inserted 3 fact(s) into 'data'.
> +empty_exclude[(999, 999)].
Inserted 1 fact(s) into 'empty_exclude'.
> -empty_exclude(999, 999).
Deleted 1 facts from 'empty_exclude'.
> +result(X, Y) :- data(X, Y), !empty_exclude(X, _).
Rule 'result' registered.
> ?- result(X, Y).
3 rows:
  (1, 10)
  (2, 20)
  (3, 30)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_empty_excl_n08t10
Knowledge graph 'test_neg_empty_excl_n08t10' dropped.
