Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_chain
Knowledge graph 'test_neg_chain' created.
Switched to knowledge graph: test_neg_chain
> .kg use test_neg_chain
Switched to knowledge graph: test_neg_chain
> +all_users[(1, 0), (2, 0), (3, 0), (4, 0), (5, 0)].
Inserted 5 fact(s) into 'all_users'.
> +banned[(2, 0)].
Inserted 1 fact(s) into 'banned'.
> +premium[(1, 0), (3, 0)].
Inserted 2 fact(s) into 'premium'.
> +basic_user(X, Y) :- all_users(X, Y), !banned(X, _), !premium(X, _).
Rule 'basic_user' registered.
> ?- basic_user(X, Y).
2 rows:
  (4, 0)
  (5, 0)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_chain
Knowledge graph 'test_neg_chain' dropped.
