Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_multi_join_n08t13
Knowledge graph 'test_neg_multi_join_n08t13' created.
Switched to knowledge graph: test_neg_multi_join_n08t13
> .kg use test_neg_multi_join_n08t13
Switched to knowledge graph: test_neg_multi_join_n08t13
> +employee[(1, 10), (2, 10), (3, 20), (4, 20), (5, 30)]
Inserted 5 fact(s) into 'employee'.
> +department[(10, 100), (20, 200), (30, 300)]
Inserted 3 fact(s) into 'department'.
> +on_leave[(2, 0), (4, 0)]
Inserted 2 fact(s) into 'on_leave'.
> +active_emp_manager(EmpId, MgrId) <- employee(EmpId, DeptId), department(DeptId, MgrId), !on_leave(EmpId, _)
Rule 'active_emp_manager' registered.
> ?active_emp_manager(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 100 │
│ 3 │ 200 │
│ 5 │ 300 │
└───┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_multi_join_n08t13
Knowledge graph 'test_neg_multi_join_n08t13' dropped.
