
> .db create test_neg_same_var
Database 'test_neg_same_var' created.
Switched to database: test_neg_same_var
> .db use test_neg_same_var
Switched to database: test_neg_same_var
> +friend[(1, 2), (1, 3), (2, 3), (2, 4), (3, 4), (3, 5)].
Inserted 6 facts into 'friend'.
> +blocked[(1, 3), (2, 4)].
Inserted 2 facts into 'blocked'.
> allowed_friend(X, Y) := friend(X, Y), !blocked(X, Y).
View 'allowed_friend' registered.
> ?- allowed_friend(X, Y).
4 rows:
  (1, 2)
  (2, 3)
  (3, 4)
  (3, 5)
> .db use default
Switched to database: default
> .db drop test_neg_same_var
Database 'test_neg_same_var' dropped.
