Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_same_var
Knowledge graph 'test_neg_same_var' created.
Switched to knowledge graph: test_neg_same_var
> .kg use test_neg_same_var
Switched to knowledge graph: test_neg_same_var
> +friend[(1, 2), (1, 3), (2, 3), (2, 4), (3, 4), (3, 5)].
Inserted 6 fact(s) into 'friend'.
> +blocked[(1, 3), (2, 4)].
Inserted 2 fact(s) into 'blocked'.
> +allowed_friend(X, Y) :- friend(X, Y), !blocked(X, Y).
Rule 'allowed_friend' registered.
> ?- allowed_friend(X, Y).
4 rows:
  (1, 2)
  (2, 3)
  (3, 4)
  (3, 5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_same_var
Knowledge graph 'test_neg_same_var' dropped.
