Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_swap_n08t15
Knowledge graph 'test_neg_swap_n08t15' created.
Switched to knowledge graph: test_neg_swap_n08t15
> .kg use test_neg_swap_n08t15
Switched to knowledge graph: test_neg_swap_n08t15
> +edge[(1, 2), (2, 3), (3, 1), (1, 3)]
Inserted 4 fact(s) into 'edge'.
> +one_way(X, Y) <- edge(X, Y), !edge(Y, X)
Rule 'one_way' registered.
> ?one_way(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
└───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_swap_n08t15
Knowledge graph 'test_neg_swap_n08t15' dropped.
