Executing script: examples/datalog/08_negation/15_negation_swapped_vars.dl

> .db create test_neg_swap
Database 'test_neg_swap' created.
Switched to database: test_neg_swap
> .db use test_neg_swap
Switched to database: test_neg_swap
> +edge[(1, 2), (2, 3), (3, 1), (1, 3)].
Inserted 4 facts into 'edge'.
> +one_way(X, Y) :- edge(X, Y), !edge(Y, X).
Rule 'one_way' registered.
> ?- one_way(X, Y).
2 rows:
  (1, 2)
  (2, 3)
> .db use default
Switched to database: default
> .db drop test_neg_swap
Database 'test_neg_swap' dropped.
