Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_const_n08t16
Knowledge graph 'test_neg_const_n08t16' created.
Switched to knowledge graph: test_neg_const_n08t16
> .kg use test_neg_const_n08t16
Switched to knowledge graph: test_neg_const_n08t16
> +data[(1, 100), (2, 200), (3, 100), (4, 300), (5, 200)]
Inserted 5 fact(s) into 'data'.
> +blacklist[(100, 0), (300, 0)]
Inserted 2 fact(s) into 'blacklist'.
> +not_blacklisted(Id, Val) <- data(Id, Val), !blacklist(Val, 0)
Rule 'not_blacklisted' registered.
> ?not_blacklisted(X, Y)
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 2 │ 200 │
│ 5 │ 200 │
└───┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_const_n08t16
Knowledge graph 'test_neg_const_n08t16' dropped.
