Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_rec_n08t18
Knowledge graph 'test_neg_rec_n08t18' created.
Switched to knowledge graph: test_neg_rec_n08t18
> .kg use test_neg_rec_n08t18
Switched to knowledge graph: test_neg_rec_n08t18
> +edge[(1, 2), (2, 3), (3, 4), (4, 5)]
Inserted 4 fact(s) into 'edge'.
> +forbidden_edge[(2, 3), (4, 5)]
Inserted 2 fact(s) into 'forbidden_edge'.
> +path(X, Y) <- edge(X, Y), !forbidden_edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- path(X, Y), edge(Y, Z), !forbidden_edge(Y, Z)
Rule 'path' registered.
> ?path(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 2 │
└───┴───┘
1 rows
> ?path(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 3 │ 4 │
└───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_rec_n08t18
Knowledge graph 'test_neg_rec_n08t18' dropped.
