Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_rec
Knowledge graph 'test_neg_rec' created.
Switched to knowledge graph: test_neg_rec
> .kg use test_neg_rec
Switched to knowledge graph: test_neg_rec
> +edge[(1, 2), (2, 3), (3, 4), (4, 5)].
Inserted 4 fact(s) into 'edge'.
> +forbidden_edge[(2, 3), (4, 5)].
Inserted 2 fact(s) into 'forbidden_edge'.
> +path(X, Y) :- edge(X, Y), !forbidden_edge(X, Y).
Rule 'path' registered.
> +path(X, Z) :- path(X, Y), edge(Y, Z), !forbidden_edge(Y, Z).
Rule 'path' registered.
> ?- path(1, X).
1 rows:
  (1, 2)
> ?- path(X, Y).
2 rows:
  (1, 2)
  (3, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_rec
Knowledge graph 'test_neg_rec' dropped.
