Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_sym_n08t19
Knowledge graph 'test_neg_sym_n08t19' created.
Switched to knowledge graph: test_neg_sym_n08t19
> .kg use test_neg_sym_n08t19
Switched to knowledge graph: test_neg_sym_n08t19
> +set_a[(1, 0), (2, 0), (3, 0), (4, 0)]
Inserted 4 fact(s) into 'set_a'.
> +set_b[(3, 0), (4, 0), (5, 0), (6, 0)]
Inserted 4 fact(s) into 'set_b'.
> +a_only(X, Y) <- set_a(X, Y), !set_b(X, _)
Rule 'a_only' registered.
> ?a_only(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    0 │
│    2 │    0 │
└──────┴──────┘
2 rows
> +b_only(X, Y) <- set_b(X, Y), !set_a(X, _)
Rule 'b_only' registered.
> ?b_only(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    5 │    0 │
│    6 │    0 │
└──────┴──────┘
2 rows
> +intersection(X, Y) <- set_a(X, Y), set_b(X, _)
Rule 'intersection' registered.
> ?intersection(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    3 │    0 │
│    4 │    0 │
└──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_sym_n08t19
Knowledge graph 'test_neg_sym_n08t19' dropped.
