Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_rec_view_n08t21
Knowledge graph 'test_neg_rec_view_n08t21' created.
Switched to knowledge graph: test_neg_rec_view_n08t21
> .kg use test_neg_rec_view_n08t21
Switched to knowledge graph: test_neg_rec_view_n08t21
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> +node[(1, 0), (2, 0), (3, 0), (4, 0), (5, 0)]
Inserted 5 fact(s) into 'node'.
> +reach(X, Y) <- edge(X, Y)
Rule 'reach' registered.
> +reach(X, Z) <- reach(X, Y), edge(Y, Z)
Rule 'reach' registered.
> ?reach(1, X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
└──────┴──────┘
3 rows
> +unreachable(X, Y) <- node(X, Y), !reach(1, X)
Rule 'unreachable' registered.
> ?unreachable(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    0 │
│    5 │    0 │
└──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_rec_view_n08t21
Knowledge graph 'test_neg_rec_view_n08t21' dropped.
