Executing script: examples/datalog/08_negation/21_negation_on_recursive_view.dl

> .db create test_neg_rec_view
Database 'test_neg_rec_view' created.
Switched to database: test_neg_rec_view
> .db use test_neg_rec_view
Switched to database: test_neg_rec_view
> +edge[(1, 2), (2, 3), (3, 4)].
Inserted 3 facts into 'edge'.
> +node[(1, 0), (2, 0), (3, 0), (4, 0), (5, 0)].
Inserted 5 facts into 'node'.
> +reach(X, Y) :- edge(X, Y).
Rule 'reach' registered.
> +reach(X, Z) :- reach(X, Y), edge(Y, Z).
Rule added to 'reach' (2 rules total).
> ?- reach(1, X).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> +unreachable(X, Y) :- node(X, Y), !reach(1, X).
Rule 'unreachable' registered.
> ?- unreachable(X, Y).
2 rows:
  (1, 0)
  (5, 0)
> .db use default
Switched to database: default
> .db drop test_neg_rec_view
Database 'test_neg_rec_view' dropped.
