Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_rule_neg
Knowledge graph 'test_multi_rule_neg' created.
Switched to knowledge graph: test_multi_rule_neg
> .kg use test_multi_rule_neg
Switched to knowledge graph: test_multi_rule_neg
> +set_a[(1, 0), (2, 0), (3, 0), (4, 0)].
Inserted 4 fact(s) into 'set_a'.
> +set_b[(3, 0), (4, 0), (5, 0), (6, 0)].
Inserted 4 fact(s) into 'set_b'.
> +sym_diff(X, Y) :- set_a(X, Y), !set_b(X, _).
Rule 'sym_diff' registered.
> +sym_diff(X, Y) :- set_b(X, Y), !set_a(X, _).
Rule 'sym_diff' registered.
> ?- sym_diff(X, Y).
4 rows:
  (1, 0)
  (2, 0)
  (5, 0)
  (6, 0)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_rule_neg
Knowledge graph 'test_multi_rule_neg' dropped.
