Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_rule_neg_n08t22
Knowledge graph 'test_multi_rule_neg_n08t22' created.
Switched to knowledge graph: test_multi_rule_neg_n08t22
> .kg use test_multi_rule_neg_n08t22
Switched to knowledge graph: test_multi_rule_neg_n08t22
> +set_a[(1, 0), (2, 0), (3, 0), (4, 0)]
Inserted 4 fact(s) into 'set_a'.
> +set_b[(3, 0), (4, 0), (5, 0), (6, 0)]
Inserted 4 fact(s) into 'set_b'.
> +sym_diff(X, Y) <- set_a(X, Y), !set_b(X, _)
Rule 'sym_diff' registered.
> +sym_diff(X, Y) <- set_b(X, Y), !set_a(X, _)
Rule 'sym_diff' registered.
> ?sym_diff(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 0 │
│ 2 │ 0 │
│ 5 │ 0 │
│ 6 │ 0 │
└───┴───┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_rule_neg_n08t22
Knowledge graph 'test_multi_rule_neg_n08t22' dropped.
