Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_circular_neg
Knowledge graph 'test_circular_neg' created.
Switched to knowledge graph: test_circular_neg
> .kg use test_circular_neg
Switched to knowledge graph: test_circular_neg
> +base[(1), (2), (3)].
Inserted 3 fact(s) into 'base'.
> +valid_neg(X) :- base(X), !base(2).
Rule 'valid_neg' registered.
> ?- valid_neg(X).
No results.
> +layer1(X) :- base(X).
Rule 'layer1' registered.
> +layer2(X) :- layer1(X), !layer1(2).
Rule 'layer2' registered.
> ?- layer2(X).
No results.
> +derived(X) :- base(X), X > 1.
Rule 'derived' registered.
> +not_derived(X) :- base(X), !derived(X).
Rule 'not_derived' registered.
> ?- not_derived(X).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_circular_neg
Knowledge graph 'test_circular_neg' dropped.
