Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_circular_neg_n08t24
Knowledge graph 'test_circular_neg_n08t24' created.
Switched to knowledge graph: test_circular_neg_n08t24
> .kg use test_circular_neg_n08t24
Switched to knowledge graph: test_circular_neg_n08t24
> +base[(1), (2), (3)]
Inserted 3 fact(s) into 'base'.
> +excluded[(2)]
Inserted 1 fact(s) into 'excluded'.
> +valid_neg(X) <- base(X), !excluded(X)
Rule 'valid_neg' registered.
> ?valid_neg(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
└──────┘
2 rows
> +layer1(X) <- base(X)
Rule 'layer1' registered.
> +layer2(X) <- layer1(X), !excluded(X)
Rule 'layer2' registered.
> ?layer2(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
└──────┘
2 rows
> +derived(X) <- base(X), X > 1
Rule 'derived' registered.
> +not_derived(X) <- base(X), !derived(X)
Rule 'not_derived' registered.
> ?not_derived(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_circular_neg_n08t24
Knowledge graph 'test_circular_neg_n08t24' dropped.
