Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_empty
Knowledge graph 'test_neg_empty' created.
Switched to knowledge graph: test_neg_empty
> .kg use test_neg_empty
Switched to knowledge graph: test_neg_empty
> +items[(1), (2), (3), (4), (5)].
Inserted 5 fact(s) into 'items'.
> +not_excluded(X) :- items(X), !excluded(X).
Rule 'not_excluded' registered.
> ?- not_excluded(X).
5 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
> +excluded[(2), (4)].
Inserted 2 fact(s) into 'excluded'.
> ?- not_excluded(X).
3 rows:
  (1)
  (3)
  (5)
> -excluded(X) :- excluded(X).
Conditional delete: 2 fact(s) deleted from 'excluded'.
> ?- not_excluded(X).
5 rows:
  (1)
  (2)
  (3)
  (4)
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_empty
Knowledge graph 'test_neg_empty' dropped.
