Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_all_excluded_n08t26
Knowledge graph 'test_all_excluded_n08t26' created.
Switched to knowledge graph: test_all_excluded_n08t26
> .kg use test_all_excluded_n08t26
Switched to knowledge graph: test_all_excluded_n08t26
> +items[(1), (2), (3)]
Inserted 3 fact(s) into 'items'.
> +excluded[(1), (2), (3)]
Inserted 3 fact(s) into 'excluded'.
> +not_excluded(X) <- items(X), !excluded(X)
Rule 'not_excluded' registered.
> ?not_excluded(X)
No results.
> +items(4)
Inserted 1 fact(s) into 'items'.
> ?not_excluded(X)
┌───┐
│ X │
├───┤
│ 4 │
└───┘
1 rows
> +excluded(4)
Inserted 1 fact(s) into 'excluded'.
> ?not_excluded(X)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_all_excluded_n08t26
Knowledge graph 'test_all_excluded_n08t26' dropped.
