Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_double_neg
Knowledge graph 'test_double_neg' created.
Switched to knowledge graph: test_double_neg
> .kg use test_double_neg
Switched to knowledge graph: test_double_neg
> +items[(1), (2), (3), (4), (5)].
Inserted 5 fact(s) into 'items'.
> +special[(2), (4)].
Inserted 2 fact(s) into 'special'.
> +not_special(X) :- items(X), !special(X).
Rule 'not_special' registered.
> ?- not_special(X).
3 rows:
  (1)
  (3)
  (5)
> +double_neg(X) :- items(X), !not_special(X).
Rule 'double_neg' registered.
> ?- double_neg(X).
2 rows:
  (2)
  (4)
> ?- special(X).
2 rows:
  (2)
  (4)
> +triple_neg(X) :- items(X), !double_neg(X).
Rule 'triple_neg' registered.
> ?- triple_neg(X).
3 rows:
  (1)
  (3)
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_double_neg
Knowledge graph 'test_double_neg' dropped.
