Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_double_neg_n08t27
Knowledge graph 'test_double_neg_n08t27' created.
Switched to knowledge graph: test_double_neg_n08t27
> .kg use test_double_neg_n08t27
Switched to knowledge graph: test_double_neg_n08t27
> +items[(1), (2), (3), (4), (5)]
Inserted 5 fact(s) into 'items'.
> +special[(2), (4)]
Inserted 2 fact(s) into 'special'.
> +not_special(X) <- items(X), !special(X)
Rule 'not_special' registered.
> ?not_special(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
│    5 │
└──────┘
3 rows
> +double_neg(X) <- items(X), !not_special(X)
Rule 'double_neg' registered.
> ?double_neg(X)
┌──────┐
│ col0 │
├──────┤
│    2 │
│    4 │
└──────┘
2 rows
> ?special(X)
┌──────┐
│ col0 │
├──────┤
│    2 │
│    4 │
└──────┘
2 rows
> +triple_neg(X) <- items(X), !double_neg(X)
Rule 'triple_neg' registered.
> ?triple_neg(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
│    5 │
└──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_double_neg_n08t27
Knowledge graph 'test_double_neg_n08t27' dropped.
