Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_universal_n08t31
Knowledge graph 'test_universal_n08t31' created.
Switched to knowledge graph: test_universal_n08t31
> .kg use test_universal_n08t31
Switched to knowledge graph: test_universal_n08t31
> +students[(1, "Alice"), (2, "Bob"), (3, "Carol")]
Inserted 3 fact(s) into 'students'.
> +courses[("Math",), ("Physics",), ("Chemistry",)]
Inserted 3 fact(s) into 'courses'.
> +enrolled[(1, "Math"), (1, "Physics"), (1, "Chemistry"), (2, "Math"), (2, "Physics"), (3, "Math")]
Inserted 6 fact(s) into 'enrolled'.
> has_enrollment(S) <- enrolled(S, _)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
(session: 1 rule(s))
> ?has_enrollment(S)
┌───┐
│ S │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
> not_enrolled(S, C) <- students(S, _), courses(C), !enrolled(S, C)
┌───┬─────────────┐
│ X │ Y           │
├───┼─────────────┤
│ 2 │ "Chemistry" │
│ 3 │ "Chemistry" │
│ 3 │ "Physics"   │
└───┴─────────────┘
3 rows
(session: 2 rule(s))
> ?not_enrolled(S, C)
┌───┬─────────────┐
│ S │ C           │
├───┼─────────────┤
│ 2 │ "Chemistry" │
│ 3 │ "Chemistry" │
│ 3 │ "Physics"   │
└───┴─────────────┘
3 rows
> all_courses(S, Name) <- students(S, Name), !not_enrolled(S, _)
┌───┬─────────┐
│ X │ Y       │
├───┼─────────┤
│ 1 │ "Alice" │
└───┴─────────┘
1 rows
(session: 3 rule(s))
> ?all_courses(S, Name)
┌───┬─────────┐
│ S │ Name    │
├───┼─────────┤
│ 1 │ "Alice" │
└───┴─────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_universal_n08t31
Knowledge graph 'test_universal_n08t31' dropped.
