Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_universal
Knowledge graph 'test_universal' created.
Switched to knowledge graph: test_universal
> .kg use test_universal
Switched to knowledge graph: test_universal
> +students[(1, "Alice"), (2, "Bob"), (3, "Carol")].
Inserted 3 fact(s) into 'students'.
> +courses[("Math",), ("Physics",), ("Chemistry",)].
Inserted 3 fact(s) into 'courses'.
> +enrolled[(1, "Math"), (1, "Physics"), (1, "Chemistry"), (2, "Math"), (2, "Physics"), (3, "Math")].
Inserted 6 fact(s) into 'enrolled'.
> has_enrollment(S) :- enrolled(S, _).
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> ?- has_enrollment(S).
3 rows:
  (1)
  (2)
  (3)
> not_enrolled(S, C) :- students(S, _), courses(C), !enrolled(S, C).
3 rows:
  (2, "Chemistry")
  (3, "Chemistry")
  (3, "Physics")
(session: 2 rule(s))
> ?- not_enrolled(S, C).
3 rows:
  (2, "Chemistry")
  (3, "Chemistry")
  (3, "Physics")
> all_courses(S, Name) :- students(S, Name), !not_enrolled(S, _).
1 rows:
  (1, "Alice")
(session: 3 rule(s))
> ?- all_courses(S, Name).
1 rows:
  (1, "Alice")
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_universal
Knowledge graph 'test_universal' dropped.
