Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_agg_n08t32
Knowledge graph 'test_neg_agg_n08t32' created.
Switched to knowledge graph: test_neg_agg_n08t32
> .kg use test_neg_agg_n08t32
Switched to knowledge graph: test_neg_agg_n08t32
> +scores[(1, 80), (2, 90), (3, 70), (4, 85)]
Inserted 4 fact(s) into 'scores'.
> +excluded[(2,)]
Inserted 1 fact(s) into 'excluded'.
> +avg_allowed(avg<Score>) <- scores(Id, Score), !excluded(Id)
Rule 'avg_allowed' registered.
> ?avg_allowed(A)
┌───────────────────┐
│ A                 │
├───────────────────┤
│ 78.33333333333333 │
└───────────────────┘
1 rows
> +count_allowed(count<Id>) <- scores(Id, _), !excluded(Id)
Rule 'count_allowed' registered.
> ?count_allowed(C)
┌───┐
│ C │
├───┤
│ 3 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_agg_n08t32
Knowledge graph 'test_neg_agg_n08t32' dropped.
