Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_forall
Knowledge graph 'test_forall' created.
Switched to knowledge graph: test_forall
> .kg use test_forall
Switched to knowledge graph: test_forall
> +students[(1, "Alice"), (2, "Bob"), (3, "Carol")].
Inserted 3 fact(s) into 'students'.
> +passed[(1, "Math"), (1, "English"), (2, "Math"), (3, "Math"), (3, "English")].
Inserted 5 fact(s) into 'passed'.
> +required[("Math",), ("English",)].
Inserted 2 fact(s) into 'required'.
> missing_course(StudentId) :- students(StudentId, _), required(Course), !passed(StudentId, Course).
1 rows:
  (2)
(session: 1 rule(s))
> passed_all(StudentId, Name) :- students(StudentId, Name), !missing_course(StudentId).
2 rows:
  (1, "Alice")
  (3, "Carol")
(session: 2 rule(s))
> ?- passed_all(StudentId, Name).
2 rows:
  (1, "Alice")
  (3, "Carol")
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_forall
Knowledge graph 'test_forall' dropped.
