Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_strat_complex_n08t34
Knowledge graph 'test_strat_complex_n08t34' created.
Switched to knowledge graph: test_strat_complex_n08t34
> .kg use test_strat_complex_n08t34
Switched to knowledge graph: test_strat_complex_n08t34
> +base[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'base'.
> +even(X) :- base(X), X = 2.
Rule 'even' registered.
> +even(X) :- base(X), X = 4.
Rule 'even' registered.
> odd(X) :- base(X), !even(X).
3 rows:
  (1)
  (3)
  (5)
(session: 1 rule(s))
> ?- odd(X).
3 rows:
  (1)
  (3)
  (5)
> not_odd(X) :- base(X), !odd(X).
2 rows:
  (2)
  (4)
(session: 2 rule(s))
> ?- not_odd(X).
2 rows:
  (2)
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_strat_complex_n08t34
Knowledge graph 'test_strat_complex_n08t34' dropped.
