Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_multi_n08t35
Knowledge graph 'test_neg_multi_n08t35' created.
Switched to knowledge graph: test_neg_multi_n08t35
> .kg use test_neg_multi_n08t35
Switched to knowledge graph: test_neg_multi_n08t35
> +pairs[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'pairs'.
> +exclude[(1, 2), (3, 4)]
Inserted 2 fact(s) into 'exclude'.
> not_excluded(A, B) <- pairs(A, B), !exclude(A, B)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 2 │ 3 │
└───┴───┘
1 rows
(session: 1 rule(s))
> ?not_excluded(A, B)
┌───┬───┐
│ A │ B │
├───┼───┤
│ 2 │ 3 │
└───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_neg_multi_n08t35
Knowledge graph 'test_neg_multi_n08t35' dropped.
