Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_multi
Knowledge graph 'test_neg_multi' created.
Switched to knowledge graph: test_neg_multi
> .kg use test_neg_multi
Switched to knowledge graph: test_neg_multi
> +pairs[(1, 2), (2, 3), (3, 4)].
Inserted 3 fact(s) into 'pairs'.
> +exclude[(1, 2), (3, 4)].
Inserted 2 fact(s) into 'exclude'.
> not_excluded(A, B) :- pairs(A, B), !exclude(A, B).
1 rows:
  (2, 3)
(session: 1 rule(s))
> ?- not_excluded(A, B).
1 rows:
  (2, 3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_neg_multi
Knowledge graph 'test_neg_multi' dropped.
