Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_order
Knowledge graph 'test_neg_order' created.
Switched to knowledge graph: test_neg_order
> .kg use test_neg_order
Switched to knowledge graph: test_neg_order
> +all[(1,), (2,), (3,), (4,)].
Inserted 4 fact(s) into 'all'.
> +exclude[(2,), (4,)].
Inserted 2 fact(s) into 'exclude'.
> result1(X) :- !exclude(X), all(X).
2 rows:
  (1)
  (3)
(session: 1 rule(s))
> result2(X) :- all(X), !exclude(X).
2 rows:
  (1)
  (3)
(session: 2 rule(s))
> ?- result1(X).
2 rows:
  (1)
  (3)
> ?- result2(X).
2 rows:
  (1)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_neg_order
Knowledge graph 'test_neg_order' dropped.
