Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_order_n08t55
Knowledge graph 'test_neg_order_n08t55' created.
Switched to knowledge graph: test_neg_order_n08t55
> .kg use test_neg_order_n08t55
Switched to knowledge graph: test_neg_order_n08t55
> +all[(1,), (2,), (3,), (4,)]
Inserted 4 fact(s) into 'all'.
> +exclude[(2,), (4,)]
Inserted 2 fact(s) into 'exclude'.
> result1(X) <- !exclude(X), all(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
(session: 1 rule(s))
> result2(X) <- all(X), !exclude(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
(session: 2 rule(s))
> ?result1(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
> ?result2(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_neg_order_n08t55
Knowledge graph 'test_neg_order_n08t55' dropped.
