Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_comp_n08t56
Knowledge graph 'test_neg_comp_n08t56' created.
Switched to knowledge graph: test_neg_comp_n08t56
> .kg use test_neg_comp_n08t56
Switched to knowledge graph: test_neg_comp_n08t56
> +nums[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'nums'.
> +thresholds[(3,)].
Inserted 1 fact(s) into 'thresholds'.
> below_threshold(X) :- nums(X), thresholds(T), X <= T.
3 rows:
  (1)
  (2)
  (3)
(session: 1 rule(s))
> ?- below_threshold(X).
3 rows:
  (1)
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_neg_comp_n08t56
Knowledge graph 'test_neg_comp_n08t56' dropped.
