Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_double_neg
Knowledge graph 'test_double_neg' created.
Switched to knowledge graph: test_double_neg
> .kg use test_double_neg
Switched to knowledge graph: test_double_neg
> +all_items[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'all_items'.
> +excluded[(2,), (4,)].
Inserted 2 fact(s) into 'excluded'.
> +not_excluded(X) :- all_items(X), !excluded(X).
Rule 'not_excluded' registered.
> +double_neg(X) :- all_items(X), !not_excluded(X).
Rule 'double_neg' registered.
> ?- not_excluded(X).
3 rows:
  (1)
  (3)
  (5)
> ?- double_neg(X).
2 rows:
  (2)
  (4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_double_neg
Knowledge graph 'test_double_neg' dropped.
