Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_multi
Knowledge graph 'test_neg_multi' created.
Switched to knowledge graph: test_neg_multi
> .kg use test_neg_multi
Switched to knowledge graph: test_neg_multi
> +items[(1, "A", 100), (2, "B", 200), (3, "A", 150), (4, "C", 50)].
Inserted 4 fact(s) into 'items'.
> +excluded_categories[("B",), ("C",)].
Inserted 2 fact(s) into 'excluded_categories'.
> +valid_items(Id, Cat, Price) :- items(Id, Cat, Price), !excluded_categories(Cat), Price > 75.
Rule 'valid_items' registered.
> ?- valid_items(Id, Cat, Price).
2 rows:
  (1, "A", 100)
  (3, "A", 150)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_multi
Knowledge graph 'test_neg_multi' dropped.
