Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_chain
Knowledge graph 'test_neg_chain' created.
Switched to knowledge graph: test_neg_chain
> .kg use test_neg_chain
Switched to knowledge graph: test_neg_chain
> +base[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'base'.
> +excluded[(2,), (4,)].
Inserted 2 fact(s) into 'excluded'.
> +level1(X) :- base(X), !excluded(X).
Rule 'level1' registered.
> +level2(X) :- level1(X), X > 2.
Rule 'level2' registered.
> ?- level1(X).
3 rows:
  (1)
  (3)
  (5)
> ?- level2(X).
2 rows:
  (3)
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_chain
Knowledge graph 'test_neg_chain' dropped.
