Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_safe_neg
Knowledge graph 'test_safe_neg' created.
Switched to knowledge graph: test_safe_neg
> .kg use test_safe_neg
Switched to knowledge graph: test_safe_neg
> +all_ids[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'all_ids'.
> +processed[(1,), (3,)].
Inserted 2 fact(s) into 'processed'.
> +unprocessed(X) :- all_ids(X), !processed(X).
Rule 'unprocessed' registered.
> ?- unprocessed(X).
3 rows:
  (2)
  (4)
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_safe_neg
Knowledge graph 'test_safe_neg' dropped.
