Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_neg_join_n08t65
Knowledge graph 'test_neg_join_n08t65' created.
Switched to knowledge graph: test_neg_join_n08t65
> .kg use test_neg_join_n08t65
Switched to knowledge graph: test_neg_join_n08t65
> +orders[(1, 100, 50.0), (2, 101, 75.0), (3, 100, 25.0)]
Inserted 3 fact(s) into 'orders'.
> +customers[(100, "Alice"), (101, "Bob"), (102, "Carol")]
Inserted 3 fact(s) into 'customers'.
> +vip[(100,)]
Inserted 1 fact(s) into 'vip'.
> +non_vip_orders(OrderId, CustName, Amount) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> orders(OrderId, CustId, Amount),
Parse error: Expected parentheses: (OrderId, CustId, Amount),
> customers(CustId, CustName),
Parse error: Expected parentheses: (CustId, CustName),
> !vip(CustId)
Cannot insert variable 'CustId' - use constants only
> ?non_vip_orders(O, C, A)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_join_n08t65
Knowledge graph 'test_neg_join_n08t65' dropped.
