Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_universal_n08t67
Knowledge graph 'test_universal_n08t67' created.
Switched to knowledge graph: test_universal_n08t67
> .kg use test_universal_n08t67
Switched to knowledge graph: test_universal_n08t67
> +students[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'students'.
> +passed_exam[(1, "math"), (2, "math"), (3, "math"), (1, "science"), (2, "science")]
Inserted 5 fact(s) into 'passed_exam'.
> +has_exam(S) <- passed_exam(S, _)
Rule 'has_exam' registered.
> ?has_exam(S)
┌───┐
│ S │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_universal_n08t67
Knowledge graph 'test_universal_n08t67' dropped.
