Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_complement_n08t68
Knowledge graph 'test_complement_n08t68' created.
Switched to knowledge graph: test_complement_n08t68
> .kg use test_complement_n08t68
Switched to knowledge graph: test_complement_n08t68
> +universe[(1,), (2,), (3,), (4,), (5,)]
Inserted 5 fact(s) into 'universe'.
> +subset[(1,), (3,), (5,)]
Inserted 3 fact(s) into 'subset'.
> +complement(X) <- universe(X), !subset(X)
Rule 'complement' registered.
> ?complement(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 4 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_complement_n08t68
Knowledge graph 'test_complement_n08t68' dropped.
