Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_asym_diff_n08t69
Knowledge graph 'test_asym_diff_n08t69' created.
Switched to knowledge graph: test_asym_diff_n08t69
> .kg use test_asym_diff_n08t69
Switched to knowledge graph: test_asym_diff_n08t69
> +set_a[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'set_a'.
> +set_b[(2,), (3,), (4,)]
Inserted 3 fact(s) into 'set_b'.
> +a_minus_b(X) <- set_a(X), !set_b(X)
Rule 'a_minus_b' registered.
> +b_minus_a(X) <- set_b(X), !set_a(X)
Rule 'b_minus_a' registered.
> ?a_minus_b(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
└──────┘
1 rows
> ?b_minus_a(X)
┌──────┐
│ col0 │
├──────┤
│    4 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_asym_diff_n08t69
Knowledge graph 'test_asym_diff_n08t69' dropped.
