Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_intersect_n08t71
Knowledge graph 'test_intersect_n08t71' created.
Switched to knowledge graph: test_intersect_n08t71
> .kg use test_intersect_n08t71
Switched to knowledge graph: test_intersect_n08t71
> +set_a[(1,), (2,), (3,), (4,)]
Inserted 4 fact(s) into 'set_a'.
> +set_b[(3,), (4,), (5,), (6,)]
Inserted 4 fact(s) into 'set_b'.
> +intersection(X) <- set_a(X), set_b(X)
Rule 'intersection' registered.
> ?intersection(X)
┌───┐
│ X │
├───┤
│ 3 │
│ 4 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_intersect_n08t71
Knowledge graph 'test_intersect_n08t71' dropped.
