Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_intersect
Knowledge graph 'test_intersect' created.
Switched to knowledge graph: test_intersect
> .kg use test_intersect
Switched to knowledge graph: test_intersect
> +set_a[(1,), (2,), (3,), (4,)].
Inserted 4 fact(s) into 'set_a'.
> +set_b[(3,), (4,), (5,), (6,)].
Inserted 4 fact(s) into 'set_b'.
> +intersection(X) :- set_a(X), set_b(X).
Rule 'intersection' registered.
> ?- intersection(X).
2 rows:
  (3)
  (4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_intersect
Knowledge graph 'test_intersect' dropped.
