Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_xor_n08t72
Knowledge graph 'test_xor_n08t72' created.
Switched to knowledge graph: test_xor_n08t72
> .kg use test_xor_n08t72
Switched to knowledge graph: test_xor_n08t72
> +set_a[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'set_a'.
> +set_b[(2,), (3,), (4,)]
Inserted 3 fact(s) into 'set_b'.
> +xor_result(X) <- set_a(X), !set_b(X)
Rule 'xor_result' registered.
> +xor_result(X) <- set_b(X), !set_a(X)
Rule 'xor_result' registered.
> ?xor_result(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 4 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_xor_n08t72
Knowledge graph 'test_xor_n08t72' dropped.
