Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_all_but_n08t75
Knowledge graph 'test_all_but_n08t75' created.
Switched to knowledge graph: test_all_but_n08t75
> .kg use test_all_but_n08t75
Switched to knowledge graph: test_all_but_n08t75
> +items[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'items'.
> +excluded[(3,)].
Inserted 1 fact(s) into 'excluded'.
> +result(X) :- items(X), !excluded(X).
Rule 'result' registered.
> ?- result(X).
4 rows:
  (1)
  (2)
  (4)
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_all_but_n08t75
Knowledge graph 'test_all_but_n08t75' dropped.
