Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_subset
Knowledge graph 'test_subset' created.
Switched to knowledge graph: test_subset
> .kg use test_subset
Switched to knowledge graph: test_subset
> +set_a[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'set_a'.
> +set_b[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'set_b'.
> +not_in_b(X) :- set_a(X), !set_b(X).
Rule 'not_in_b' registered.
> ?- not_in_b(X).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_subset
Knowledge graph 'test_subset' dropped.
