Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_disjoint_n08t77
Knowledge graph 'test_disjoint_n08t77' created.
Switched to knowledge graph: test_disjoint_n08t77
> .kg use test_disjoint_n08t77
Switched to knowledge graph: test_disjoint_n08t77
> +set_a[(1,), (2,), (3,)].
Inserted 3 fact(s) into 'set_a'.
> +set_b[(4,), (5,), (6,)].
Inserted 3 fact(s) into 'set_b'.
> +common(X) :- set_a(X), set_b(X).
Rule 'common' registered.
> ?- common(X).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_disjoint_n08t77
Knowledge graph 'test_disjoint_n08t77' dropped.
