Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_except
Knowledge graph 'test_except' created.
Switched to knowledge graph: test_except
> .kg use test_except
Switched to knowledge graph: test_except
> +query1[(1, "a"), (2, "b"), (3, "c")].
Inserted 3 fact(s) into 'query1'.
> +query2[(2, "b"), (3, "c")].
Inserted 2 fact(s) into 'query2'.
> +except_result(X, Y) :- query1(X, Y), !query2(X, Y).
Rule 'except_result' registered.
> ?- except_result(X, Y).
1 rows:
  (1, "a")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_except
Knowledge graph 'test_except' dropped.
