Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_union_diff_n08t79
Knowledge graph 'test_union_diff_n08t79' created.
Switched to knowledge graph: test_union_diff_n08t79
> .kg use test_union_diff_n08t79
Switched to knowledge graph: test_union_diff_n08t79
> +set_a[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'set_a'.
> +set_b[(3,), (4,), (5,)]
Inserted 3 fact(s) into 'set_b'.
> +set_c[(2,), (4,)]
Inserted 2 fact(s) into 'set_c'.
> +union_ab(X) <- set_a(X)
Rule 'union_ab' registered.
> +union_ab(X) <- set_b(X)
Rule 'union_ab' registered.
> +result(X) <- union_ab(X), !set_c(X)
Rule 'result' registered.
> ?result(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    3 │
│    5 │
└──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_union_diff_n08t79
Knowledge graph 'test_union_diff_n08t79' dropped.
