Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_comp
Knowledge graph 'test_rel_comp' created.
Switched to knowledge graph: test_rel_comp
> .kg use test_rel_comp
Switched to knowledge graph: test_rel_comp
> +universe[(1,), (2,), (3,), (4,), (5,)].
Inserted 5 fact(s) into 'universe'.
> +subset[(2,), (4,)].
Inserted 2 fact(s) into 'subset'.
> +complement(X) :- universe(X), !subset(X).
Rule 'complement' registered.
> ?- complement(X).
3 rows:
  (1)
  (3)
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_comp
Knowledge graph 'test_rel_comp' dropped.
