Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_neg_join_n08t81
Knowledge graph 'test_neg_join_n08t81' created.
Switched to knowledge graph: test_neg_join_n08t81
> .kg use test_neg_join_n08t81
Switched to knowledge graph: test_neg_join_n08t81
> +users[(1, "alice"), (2, "bob"), (3, "carol")]
Inserted 3 fact(s) into 'users'.
> +admins[(1,), (3,)]
Inserted 2 fact(s) into 'admins'.
> +regular_users(Id, Name) <- users(Id, Name), !admins(Id)
Rule 'regular_users' registered.
> ?regular_users(Id, Name)
┌────┬───────┐
│ Id │ Name  │
├────┼───────┤
│  2 │ "bob" │
└────┴───────┘
1 rows
> +products[(100, "laptop"), (200, "phone"), (300, "tablet")]
Inserted 3 fact(s) into 'products'.
> +discounted[(100,), (300,)]
Inserted 2 fact(s) into 'discounted'.
> +full_price(Id, Name) <- products(Id, Name), !discounted(Id)
Rule 'full_price' registered.
> ?full_price(Id, Name)
┌─────┬─────────┐
│ Id  │ Name    │
├─────┼─────────┤
│ 200 │ "phone" │
└─────┴─────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_neg_join_n08t81
Knowledge graph 'test_neg_join_n08t81' dropped.
