Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cheatsheet_basics_n28t01
Knowledge graph 'test_cheatsheet_basics_n28t01' created.
Switched to knowledge graph: test_cheatsheet_basics_n28t01
> .kg use test_cheatsheet_basics_n28t01
Switched to knowledge graph: test_cheatsheet_basics_n28t01
> +edge(1, 2)
Inserted 1 fact(s) into 'edge'.
> +edge[(2, 3), (3, 4), (4, 5)]
Inserted 3 fact(s) into 'edge'.
> ?edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
│    3 │    4 │
│    4 │    5 │
└──────┴──────┘
4 rows
> -edge(4, 5)
Deleted 1 facts from 'edge'.
> ?edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
│    3 │    4 │
└──────┴──────┘
3 rows
> -edge(X, Y) <- edge(X, Y), X > 2
Conditional delete: 1 fact(s) deleted from 'edge'.
> ?edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
└──────┴──────┘
2 rows
> +counter[(1, 0), (2, 10)]
Inserted 2 fact(s) into 'counter'.
> -counter(1, 0)
Deleted 1 facts from 'counter'.
> +counter(1, 5)
Inserted 1 fact(s) into 'counter'.
> ?counter(Id, Val)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    5 │
│    2 │   10 │
└──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cheatsheet_basics_n28t01
Knowledge graph 'test_cheatsheet_basics_n28t01' dropped.
