Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cheatsheet_rules_n28t02
Knowledge graph 'test_cheatsheet_rules_n28t02' created.
Switched to knowledge graph: test_cheatsheet_rules_n28t02
> .kg use test_cheatsheet_rules_n28t02
Switched to knowledge graph: test_cheatsheet_rules_n28t02
> +edge[(1, 2), (2, 3), (3, 4), (4, 5)]
Inserted 4 fact(s) into 'edge'.
> +person[("alice", 30), ("bob", 17), ("carol", 25)]
Inserted 3 fact(s) into 'person'.
> +path(X, Y) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- path(X, Y), edge(Y, Z)
Rule 'path' registered.
> ?path(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 1 │ 5 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 2 │ 5 │
│ 3 │ 4 │
│ 3 │ 5 │
│ 4 │ 5 │
└───┴───┘
10 rows
> +adult(Name, Age) <- person(Name, Age), Age >= 18
Rule 'adult' registered.
> ?adult(Name, Age)
┌─────────┬─────┐
│ Name    │ Age │
├─────────┼─────┤
│ "alice" │  30 │
│ "carol" │  25 │
└─────────┴─────┘
2 rows
> result(X, Y) <- edge(X, Y), X < Y
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
│ 4 │ 5 │
└───┴───┘
4 rows
(session: 1 rule(s))
> ?result(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
│ 4 │ 5 │
└───┴───┘
4 rows
> reachable_from_one(X) <- path(1, X)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
│ 4 │
│ 5 │
└───┘
4 rows
(session: 2 rule(s))
> ?reachable_from_one(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
│ 4 │
│ 5 │
└───┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_cheatsheet_rules_n28t02
Knowledge graph 'test_cheatsheet_rules_n28t02' dropped.
