Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_cheatsheet_queries_n28t03
Knowledge graph 'test_cheatsheet_queries_n28t03' created.
Switched to knowledge graph: test_cheatsheet_queries_n28t03
> .kg use test_cheatsheet_queries_n28t03
Switched to knowledge graph: test_cheatsheet_queries_n28t03
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> +person[("alice", 30), ("bob", 25), ("carol", 35)]
Inserted 3 fact(s) into 'person'.
> +path(X, Y) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- path(X, Y), edge(Y, Z)
Rule 'path' registered.
> ?edge(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 2 │
└───┴───┘
1 rows
> ?person(Name, Age), Age > 30
┌─────────┬─────┐
│ Name    │ Age │
├─────────┼─────┤
│ "carol" │  35 │
└─────────┴─────┘
1 rows
> ?path(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
└───┴───┘
3 rows
> ?edge(X, _)
┌───┬───┐
│ X │ _ │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cheatsheet_queries_n28t03
Knowledge graph 'test_cheatsheet_queries_n28t03' dropped.
