Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create social
Knowledge graph 'social' created.
Switched to knowledge graph: social
> .kg use social
Switched to knowledge graph: social
> +follows[(1, 2), (2, 3), (3, 4), (1, 4)].
Inserted 4 fact(s) into 'follows'.
> +reach(X, Y) :- follows(X, Y).
Rule 'reach' registered.
> +reach(X, Z) :- reach(X, Y), follows(Y, Z).
Rule 'reach' registered.
> ?- reach(1, X).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop social
Knowledge graph 'social' dropped.
