Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_acl_n28t06
Knowledge graph 'test_acl_n28t06' created.
Switched to knowledge graph: test_acl_n28t06
> .kg use test_acl_n28t06
Switched to knowledge graph: test_acl_n28t06
> +user_role[("alice", "admin"), ("bob", "viewer")]
Inserted 2 fact(s) into 'user_role'.
> +role_permission[("admin", "read"), ("admin", "write"), ("viewer", "read")]
Inserted 3 fact(s) into 'role_permission'.
> +has_permission(User, Perm) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> user_role(User, Role),
Parse error: Expected parentheses: (User, Role),
> role_permission(Role, Perm)
Cannot insert variable 'Role' - use constants only
> ?has_permission("alice", Perm)
No results.
> ?has_permission("bob", Perm)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_acl_n28t06
Knowledge graph 'test_acl_n28t06' dropped.
