Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create syntax_literals
Knowledge graph 'syntax_literals' created.
Switched to knowledge graph: syntax_literals
> .kg use syntax_literals
Switched to knowledge graph: syntax_literals
> +int_values[(42), (-17), (0)].
Inserted 3 fact(s) into 'int_values'.
> ?- int_values(X).
3 rows:
  (-17)
  (0)
  (42)
> +float_values[(3.14), (-0.5)].
Inserted 2 fact(s) into 'float_values'.
> ?- float_values(X).
2 rows:
  (-0.5)
  (3.14)
> +string_values[("hello"), ("hello world")].
Inserted 2 fact(s) into 'string_values'.
> ?- string_values(X).
2 rows:
  ("hello")
  ("hello world")
> +vectors[([1.0, 2.0, 3.0]), ([0.1, 0.2, 0.3, 0.4])].
No facts inserted (2 duplicate skipped).
> ?- vectors(X).
No results.
> +location[("NYC", 40.7, -74.0), ("LA", 34.0, -118.2)].
Inserted 2 fact(s) into 'location'.
> ?- location(Name, Lat, Lon).
2 rows:
  ("LA", 34.0, -118.2)
  ("NYC", 40.7, -74.0)
> .kg use default
Switched to knowledge graph: default
> .kg drop syntax_literals
Knowledge graph 'syntax_literals' dropped.
