Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_syntax_schemas_n28t08
Knowledge graph 'test_syntax_schemas_n28t08' created.
Switched to knowledge graph: test_syntax_schemas_n28t08
> .kg use test_syntax_schemas_n28t08
Switched to knowledge graph: test_syntax_schemas_n28t08
> +employee(id: int, name: string, dept: string)
Schema for 'employee' registered with 3 columns (persistent)
> +employee[(1, "alice", "engineering"), (2, "bob", "sales")]
Inserted 2 fact(s) into 'employee'.
> ?employee(Id, Name, Dept)
┌──────┬─────────┬───────────────┐
│ col0 │ col1    │ col2          │
├──────┼─────────┼───────────────┤
│    1 │ "alice" │ "engineering" │
│    2 │ "bob"   │ "sales"       │
└──────┴─────────┴───────────────┘
2 rows
> +example( a: int, b: float, c: string )
Schema for 'example' registered with 3 columns (persistent)
> +example(1, 3.14, "test")
Inserted 1 fact(s) into 'example'.
> ?example(A, B, C)
┌──────┬──────┬────────┐
│ col0 │ col1 │ col2   │
├──────┼──────┼────────┤
│    1 │ 3.14 │ "test" │
└──────┴──────┴────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_syntax_schemas_n28t08
Knowledge graph 'test_syntax_schemas_n28t08' dropped.
