Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create syntax_schemas_n28t08
Knowledge graph 'syntax_schemas_n28t08' created.
Switched to knowledge graph: syntax_schemas_n28t08
> .kg use syntax_schemas_n28t08
Switched to knowledge graph: syntax_schemas_n28t08
> +employee(id: int, name: string, dept: string).
Schema 'employee' declared (persistent).
> +employee[(1, "alice", "engineering"), (2, "bob", "sales")].
Inserted 2 fact(s) into 'employee'.
> ?- employee(Id, Name, Dept).
2 rows:
  (1, "alice", "engineering")
  (2, "bob", "sales")
> +example( a: int, b: float, c: string ).
Schema 'example' declared (persistent).
> +example(1, 3.14, "test").
Inserted 1 fact(s) into 'example'.
> ?- example(A, B, C).
1 rows:
  (1, 3.14, "test")
> .kg use default
Switched to knowledge graph: default
> .kg drop syntax_schemas_n28t08
Knowledge graph 'syntax_schemas_n28t08' dropped.
