Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_syntax_negation_n28t09
Knowledge graph 'test_syntax_negation_n28t09' created.
Switched to knowledge graph: test_syntax_negation_n28t09
> .kg use test_syntax_negation_n28t09
Switched to knowledge graph: test_syntax_negation_n28t09
> +person[(1, "alice"), (2, "bob"), (3, "carol")].
Inserted 3 fact(s) into 'person'.
> +purchase[(1, "laptop"), (1, "phone")].
Inserted 2 fact(s) into 'purchase'.
> +node[(1), (2), (3), (4), (5)].
Inserted 5 fact(s) into 'node'.
> +edge[(1, 2), (2, 3), (3, 4)].
Inserted 3 fact(s) into 'edge'.
> +a[(1), (2), (3)].
Inserted 3 fact(s) into 'a'.
> +b[(2), (3), (4)].
Inserted 3 fact(s) into 'b'.
> +non_buyer(Id, Name) :- person(Id, Name), !purchase(Id, _).
Rule 'non_buyer' registered.
> ?- non_buyer(Id, Name).
2 rows:
  (2, "bob")
  (3, "carol")
> +sink(X) :- node(X), !edge(X, _).
Rule 'sink' registered.
> ?- sink(X).
2 rows:
  (4)
  (5)
> +source(X) :- node(X), !edge(_, X).
Rule 'source' registered.
> ?- source(X).
2 rows:
  (1)
  (5)
> +only_in_a(X) :- a(X), !b(X).
Rule 'only_in_a' registered.
> ?- only_in_a(X).
1 rows:
  (1)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_syntax_negation_n28t09
Knowledge graph 'test_syntax_negation_n28t09' dropped.
