Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create syntax_recursion_n28t10
Knowledge graph 'syntax_recursion_n28t10' created.
Switched to knowledge graph: syntax_recursion_n28t10
> .kg use syntax_recursion_n28t10
Switched to knowledge graph: syntax_recursion_n28t10
> +edge[(1, 2), (2, 3), (3, 4), (4, 5)].
Inserted 4 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> ?- reachable(1, X).
4 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
> +start(1).
Inserted 1 fact(s) into 'start'.
> +odd(X) :- edge(Start, X), start(Start).
Rule 'odd' registered.
> +odd(X) :- even(Y), edge(Y, X).
Rule 'odd' registered.
> +even(X) :- odd(Y), edge(Y, X).
Rule 'even' registered.
> ?- odd(X).
No results.
> ?- even(X).
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop syntax_recursion_n28t10
Knowledge graph 'syntax_recursion_n28t10' dropped.
