Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_syntax_social_n28t11
Knowledge graph 'test_syntax_social_n28t11' created.
Switched to knowledge graph: test_syntax_social_n28t11
> .kg use test_syntax_social_n28t11
Switched to knowledge graph: test_syntax_social_n28t11
> +person(id: int, name: string, age: int).
Schema 'person' declared (persistent).
> +follows(follower: int, followed: int).
Schema 'follows' declared (persistent).
> +person[(1, "alice", 30), (2, "bob", 25), (3, "carol", 35)].
Inserted 3 fact(s) into 'person'.
> +follows[(1, 2), (2, 3), (1, 3), (2, 1)].
Inserted 4 fact(s) into 'follows'.
> +mutual_follow(A, B) :- follows(A, B), follows(B, A), A < B.
Rule 'mutual_follow' registered.
> ?- mutual_follow(A, B).
1 rows:
  (1, 2)
> +influencer(Id, count<Follower>) :- follows(Follower, Id).
Rule 'influencer' registered.
> ?- influencer(Id, Count).
3 rows:
  (1, 1)
  (2, 1)
  (3, 2)
> ?- influencer(Id, Count), Count > 1.
1 rows:
  (3, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_syntax_social_n28t11
Knowledge graph 'test_syntax_social_n28t11' dropped.
