Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_syntax_graph_n28t12
Knowledge graph 'test_syntax_graph_n28t12' created.
Switched to knowledge graph: test_syntax_graph_n28t12
> .kg use test_syntax_graph_n28t12
Switched to knowledge graph: test_syntax_graph_n28t12
> +edge[(1, 2), (2, 3), (3, 4), (4, 2)]
Inserted 4 fact(s) into 'edge'.
> +node[(1), (2), (3), (4), (5)]
Inserted 5 fact(s) into 'node'.
> +path(X, Y) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- path(X, Y), edge(Y, Z)
Rule 'path' registered.
> ?path(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 2 │ 2 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 2 │
│ 3 │ 3 │
│ 3 │ 4 │
│ 4 │ 2 │
│ 4 │ 3 │
│ 4 │ 4 │
└───┴───┘
12 rows
> +in_cycle(X) <- path(X, X)
Rule 'in_cycle' registered.
> ?in_cycle(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
│ 4 │
└───┘
3 rows
> +bidir(X, Y) <- edge(X, Y)
Rule 'bidir' registered.
> +bidir(X, Y) <- edge(Y, X)
Rule 'bidir' registered.
> +connected(X, Y) <- bidir(X, Y)
Rule 'connected' registered.
> +connected(X, Z) <- connected(X, Y), bidir(Y, Z)
Rule 'connected' registered.
> ?connected(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
└───┴───┘
4 rows
> +sink(X) <- node(X), !edge(X, _)
Rule 'sink' registered.
> ?sink(X)
┌───┐
│ X │
├───┤
│ 5 │
└───┘
1 rows
> +source(X) <- node(X), !edge(_, X)
Rule 'source' registered.
> ?source(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 5 │
└───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_syntax_graph_n28t12
Knowledge graph 'test_syntax_graph_n28t12' dropped.
