Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create syntax_graph_n28t12
Knowledge graph 'syntax_graph_n28t12' created.
Switched to knowledge graph: syntax_graph_n28t12
> .kg use syntax_graph_n28t12
Switched to knowledge graph: syntax_graph_n28t12
> +edge[(1, 2), (2, 3), (3, 4), (4, 2)].
Inserted 4 fact(s) into 'edge'.
> +node[(1), (2), (3), (4), (5)].
Inserted 5 fact(s) into 'node'.
> +path(X, Y) :- edge(X, Y).
Rule 'path' registered.
> +path(X, Z) :- path(X, Y), edge(Y, Z).
Rule 'path' registered.
> ?- path(X, Y).
12 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 2)
  (2, 3)
  (2, 4)
  (3, 2)
  (3, 3)
  (3, 4)
  (4, 2)
  (4, 3)
  (4, 4)
> +in_cycle(X) :- path(X, X).
Rule 'in_cycle' registered.
> ?- in_cycle(X).
3 rows:
  (2)
  (3)
  (4)
> +bidir(X, Y) :- edge(X, Y).
Rule 'bidir' registered.
> +bidir(X, Y) :- edge(Y, X).
Rule 'bidir' registered.
> +connected(X, Y) :- bidir(X, Y).
Rule 'connected' registered.
> +connected(X, Z) :- connected(X, Y), bidir(Y, Z).
Rule 'connected' registered.
> ?- connected(1, X).
4 rows:
  (1, 1)
  (1, 2)
  (1, 3)
  (1, 4)
> +sink(X) :- node(X), !edge(X, _).
Rule 'sink' registered.
> ?- sink(X).
1 rows:
  (5)
> +source(X) :- node(X), !edge(_, X).
Rule 'source' registered.
> ?- source(X).
2 rows:
  (1)
  (5)
> .kg use default
Switched to knowledge graph: default
> .kg drop syntax_graph_n28t12
Knowledge graph 'syntax_graph_n28t12' dropped.
