Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create syntax_bom_n28t13
Knowledge graph 'syntax_bom_n28t13' created.
Switched to knowledge graph: syntax_bom_n28t13
> .kg use syntax_bom_n28t13
Switched to knowledge graph: syntax_bom_n28t13
> +contains[(100, 10, 2), (100, 20, 1), (20, 30, 4), (20, 40, 2)].
Inserted 4 fact(s) into 'contains'.
> +requires(Asm, Part) :- contains(Asm, Part, _).
Rule 'requires' registered.
> +requires(Asm, Part) :- contains(Asm, Sub, _), requires(Sub, Part).
Rule 'requires' registered.
> ?- requires(100, Part).
4 rows:
  (100, 10, 2)
  (100, 20, 1)
  (100, 30)
  (100, 40)
> +total_qty(Asm, Part, sum<Qty>) :- contains(Asm, Part, Qty).
Rule 'total_qty' registered.
> ?- total_qty(Asm, Part, Total).
4 rows:
  (20, 30, 4)
  (20, 40, 2)
  (100, 10, 2)
  (100, 20, 1)
> .kg use default
Switched to knowledge graph: default
> .kg drop syntax_bom_n28t13
Knowledge graph 'syntax_bom_n28t13' dropped.
