Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_syntax_vectors_n28t14
Knowledge graph 'test_syntax_vectors_n28t14' created.
Switched to knowledge graph: test_syntax_vectors_n28t14
> .kg use test_syntax_vectors_n28t14
Switched to knowledge graph: test_syntax_vectors_n28t14
> +embedding[(1, [1.0, 0.0, 0.0]), (2, [0.0, 1.0, 0.0]), (3, [1.0, 1.0, 0.0])]
Inserted 3 fact(s) into 'embedding'.
> +point[(1, [0.0, 0.0]), (2, [3.0, 4.0]), (3, [1.0, 1.0])]
Inserted 3 fact(s) into 'point'.
> ?embedding(Id1, V1), embedding(Id2, V2), Id1 < Id2, Sim = cosine(V1, V2)
┌─────┬─────────────────┬─────┬─────────────────┬─────────────────────┐
│ Id1 │ V1              │ Id2 │ V2              │ Sim                 │
├─────┼─────────────────┼─────┼─────────────────┼─────────────────────┤
│   1 │ [1.0, 0.0, 0.0] │   2 │ [0.0, 1.0, 0.0] │                 1.0 │
│   1 │ [1.0, 0.0, 0.0] │   3 │ [1.0, 1.0, 0.0] │ 0.29289321881345254 │
│   2 │ [0.0, 1.0, 0.0] │   3 │ [1.0, 1.0, 0.0] │ 0.29289321881345254 │
└─────┴─────────────────┴─────┴─────────────────┴─────────────────────┘
3 rows
> ?point(Id1, V1), point(Id2, V2), Id1 < Id2, Dist = euclidean(V1, V2)
┌─────┬────────────┬─────┬────────────┬────────────────────┐
│ Id1 │ V1         │ Id2 │ V2         │ Dist               │
├─────┼────────────┼─────┼────────────┼────────────────────┤
│   1 │ [0.0, 0.0] │   2 │ [3.0, 4.0] │                5.0 │
│   1 │ [0.0, 0.0] │   3 │ [1.0, 1.0] │ 1.4142135623730951 │
│   2 │ [3.0, 4.0] │   3 │ [1.0, 1.0] │  3.605551275463989 │
└─────┴────────────┴─────┴────────────┴────────────────────┘
3 rows
> ?embedding(Id1, V1), embedding(Id2, V2), Id1 < Id2, D = dot(V1, V2)
┌─────┬─────────────────┬─────┬─────────────────┬─────┐
│ Id1 │ V1              │ Id2 │ V2              │ D   │
├─────┼─────────────────┼─────┼─────────────────┼─────┤
│   1 │ [1.0, 0.0, 0.0] │   2 │ [0.0, 1.0, 0.0] │ 0.0 │
│   1 │ [1.0, 0.0, 0.0] │   3 │ [1.0, 1.0, 0.0] │ 1.0 │
│   2 │ [0.0, 1.0, 0.0] │   3 │ [1.0, 1.0, 0.0] │ 1.0 │
└─────┴─────────────────┴─────┴─────────────────┴─────┘
3 rows
> ?point(Id1, V1), point(Id2, V2), Id1 < Id2, Dist = manhattan(V1, V2)
┌─────┬────────────┬─────┬────────────┬──────┐
│ Id1 │ V1         │ Id2 │ V2         │ Dist │
├─────┼────────────┼─────┼────────────┼──────┤
│   1 │ [0.0, 0.0] │   2 │ [3.0, 4.0] │  7.0 │
│   1 │ [0.0, 0.0] │   3 │ [1.0, 1.0] │  2.0 │
│   2 │ [3.0, 4.0] │   3 │ [1.0, 1.0] │  5.0 │
└─────┴────────────┴─────┴────────────┴──────┘
3 rows
> ?embedding(Id1, V1), embedding(Id2, V2), Id1 < Id2, Sim = cosine(V1, V2), Sim > 0.5
┌─────┬─────────────────┬─────┬─────────────────┬─────┐
│ Id1 │ V1              │ Id2 │ V2              │ Sim │
├─────┼─────────────────┼─────┼─────────────────┼─────┤
│   1 │ [1.0, 0.0, 0.0] │   2 │ [0.0, 1.0, 0.0] │ 1.0 │
└─────┴─────────────────┴─────┴─────────────────┴─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_syntax_vectors_n28t14
Knowledge graph 'test_syntax_vectors_n28t14' dropped.
