Executing script: examples/datalog/28_docs_coverage/16_repl_guide_rules.dl

> .db create repl_rules
Database 'repl_rules' created.
Switched to database: repl_rules
> .db use repl_rules
Switched to database: repl_rules
> +person[("alice", 30), ("bob", 17), ("carol", 25)].
Inserted 3 facts into 'person'.
> +edge[(1, 2), (2, 3), (3, 4)].
Inserted 3 facts into 'edge'.
> +employee[(1, "engineering"), (2, "sales"), (3, "engineering")].
Inserted 3 facts into 'employee'.
> +adult(Name, Age) :- person(Name, Age), Age >= 18.
Rule added to 'adult' (1 rules total).
> ?- adult(Name, Age).
2 rows:
  ("alice", 30)
  ("carol", 25)
> +path(X, Y) :- edge(X, Y).
Rule added to 'path' (2 rules total).
> +path(X, Z) :- path(X, Y), edge(Y, Z).
Rule added to 'path' (2 rules total).
> ?- path(1, X).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> +dept_count(Dept, count<Id>) :- employee(Id, Dept).
Script error: Line 27: Parse error: Invalid term: 'count<Id>'
