Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_repl_rules_n28t16
Knowledge graph 'test_repl_rules_n28t16' created.
Switched to knowledge graph: test_repl_rules_n28t16
> .kg use test_repl_rules_n28t16
Switched to knowledge graph: test_repl_rules_n28t16
> +person[("alice", 30), ("bob", 17), ("carol", 25)]
Inserted 3 fact(s) into 'person'.
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> +employee[(1, "engineering"), (2, "sales"), (3, "engineering")]
Inserted 3 fact(s) into 'employee'.
> +adult(Name, Age) <- person(Name, Age), Age >= 18
Rule 'adult' registered.
> ?adult(Name, Age)
┌─────────┬─────┐
│ Name    │ Age │
├─────────┼─────┤
│ "alice" │  30 │
│ "carol" │  25 │
└─────────┴─────┘
2 rows
> +path(X, Y) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- path(X, Y), edge(Y, Z)
Rule 'path' registered.
> ?path(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
└───┴───┘
3 rows
> +dept_count(Dept, count<Id>) <- employee(Id, Dept)
Rule 'dept_count' registered.
> ?dept_count(Dept, Count)
┌───────────────┬───────┐
│ Dept          │ Count │
├───────────────┼───────┤
│ "engineering" │     2 │
│ "sales"       │     1 │
└───────────────┴───────┘
2 rows
> temp_result(X, Y) <- edge(X, Y), X < Y
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
(session: 1 rule(s))
> ?temp_result(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_repl_rules_n28t16
Knowledge graph 'test_repl_rules_n28t16' dropped.
