Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_repl_schemas_n28t17
Knowledge graph 'test_repl_schemas_n28t17' created.
Switched to knowledge graph: test_repl_schemas_n28t17
> .kg use test_repl_schemas_n28t17
Switched to knowledge graph: test_repl_schemas_n28t17
> +employee(id: int, name: string, dept: string)
Schema for 'employee' registered with 3 columns (persistent)
> +employee[(1, "alice", "engineering"), (2, "bob", "sales")]
Inserted 2 fact(s) into 'employee'.
> ?employee(Id, Name, Dept)
┌────┬─────────┬───────────────┐
│ id │ name    │ dept          │
├────┼─────────┼───────────────┤
│  1 │ "alice" │ "engineering" │
│  2 │ "bob"   │ "sales"       │
└────┴─────────┴───────────────┘
2 rows
> +user(id: int, email: string)
Schema for 'user' registered with 2 columns (persistent)
> +user[(1, "alice@example.com"), (2, "bob@example.com")]
Inserted 2 fact(s) into 'user'.
> ?user(Id, Email)
┌────┬─────────────────────┐
│ id │ email               │
├────┼─────────────────────┤
│  1 │ "alice@example.com" │
│  2 │ "bob@example.com"   │
└────┴─────────────────────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_repl_schemas_n28t17
Knowledge graph 'test_repl_schemas_n28t17' dropped.
