Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_repl_wildcards_n28t19
Knowledge graph 'test_repl_wildcards_n28t19' created.
Switched to knowledge graph: test_repl_wildcards_n28t19
> .kg use test_repl_wildcards_n28t19
Switched to knowledge graph: test_repl_wildcards_n28t19
> +edge[(1, 2), (1, 3), (2, 4), (3, 4)]
Inserted 4 fact(s) into 'edge'.
> ?edge(X, _)
┌───┬───┐
│ X │ _ │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 4 │
│ 3 │ 4 │
└───┴───┘
4 rows
> temp(count<X>) <- edge(X, _)
┌───┐
│ X │
├───┤
│ 4 │
└───┘
1 rows
(session: 1 rule(s))
> ?temp(C)
┌───┐
│ C │
├───┤
│ 4 │
└───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_repl_wildcards_n28t19
Knowledge graph 'test_repl_wildcards_n28t19' dropped.
