Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create repl_wildcards_n28t19
Knowledge graph 'repl_wildcards_n28t19' created.
Switched to knowledge graph: repl_wildcards_n28t19
> .kg use repl_wildcards_n28t19
Switched to knowledge graph: repl_wildcards_n28t19
> +edge[(1, 2), (1, 3), (2, 4), (3, 4)].
Inserted 4 fact(s) into 'edge'.
> ?- edge(X, _).
4 rows:
  (1, 2)
  (1, 3)
  (2, 4)
  (3, 4)
> temp(count<X>) :- edge(X, _).
1 rows:
  (4)
(session: 1 rule(s))
> ?- temp(C).
1 rows:
  (4)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop repl_wildcards_n28t19
Knowledge graph 'repl_wildcards_n28t19' dropped.
