Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sci_notation_n28t20
Knowledge graph 'test_sci_notation_n28t20' created.
Switched to knowledge graph: test_sci_notation_n28t20
> .kg use test_sci_notation_n28t20
Switched to knowledge graph: test_sci_notation_n28t20
> +floats[(1, 1.0e10), (2, 1e-5), (3, 2.5e3), (4, -1.5e-2)]
Inserted 4 fact(s) into 'floats'.
> ?floats(Id, V)
┌────┬───────────────┐
│ Id │ V             │
├────┼───────────────┤
│  1 │ 10000000000.0 │
│  2 │       0.00001 │
│  3 │        2500.0 │
│  4 │        -0.015 │
└────┴───────────────┘
4 rows
> +computed(X, V * 2) <- floats(X, V)
Rule 'computed' registered.
> ?computed(X, Y)
┌───┬───────────────┐
│ X │ Y             │
├───┼───────────────┤
│ 1 │ 20000000000.0 │
│ 2 │       0.00002 │
│ 3 │        5000.0 │
│ 4 │         -0.03 │
└───┴───────────────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sci_notation_n28t20
Knowledge graph 'test_sci_notation_n28t20' dropped.
