Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_backslash_n28t21
Knowledge graph 'test_backslash_n28t21' created.
Switched to knowledge graph: test_backslash_n28t21
> .kg use test_backslash_n28t21
Switched to knowledge graph: test_backslash_n28t21
> +paths[(1, "C:\\Users\\test"), (2, "path\\to\\file"), (3, "\\\\network\\share")]
Inserted 3 fact(s) into 'paths'.
> ?paths(Id, P)
┌──────┬──────────────────────┐
│ col0 │ col1                 │
├──────┼──────────────────────┤
│    1 │ "C:\\Users\\test"    │
│    2 │ "path\\to\\file"     │
│    3 │ "\\\\network\\share" │
└──────┴──────────────────────┘
3 rows
> +single[(1, "before\\after")]
Inserted 1 fact(s) into 'single'.
> ?single(Id, S)
┌──────┬─────────────────┐
│ col0 │ col1            │
├──────┼─────────────────┤
│    1 │ "before\\after" │
└──────┴─────────────────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_backslash_n28t21
Knowledge graph 'test_backslash_n28t21' dropped.
