Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_precedence_n28t22
Knowledge graph 'test_precedence_n28t22' created.
Switched to knowledge graph: test_precedence_n28t22
> .kg use test_precedence_n28t22
Switched to knowledge graph: test_precedence_n28t22
> +nums[(1), (2), (3)]
Inserted 3 fact(s) into 'nums'.
> test_add(X, X+1) <- nums(X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
│    3 │    4 │
└──────┴──────┘
3 rows
(session: 1 rule(s))
> ?test_add(X, R)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
│    3 │    4 │
└──────┴──────┘
3 rows
> test_mul(X, X*2) <- nums(X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    4 │
│    3 │    6 │
└──────┴──────┘
3 rows
(session: 2 rule(s))
> ?test_mul(X, R)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    4 │
│    3 │    6 │
└──────┴──────┘
3 rows
> +pairs[(10, 2), (20, 4), (15, 3)]
Inserted 3 fact(s) into 'pairs'.
> test_div(X, Y, X/Y) <- pairs(X, Y)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│   10 │    2 │  5.0 │
│   15 │    3 │  5.0 │
│   20 │    4 │  5.0 │
└──────┴──────┴──────┘
3 rows
(session: 3 rule(s))
> ?test_div(X, Y, R)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│   10 │    2 │  5.0 │
│   15 │    3 │  5.0 │
│   20 │    4 │  5.0 │
└──────┴──────┴──────┘
3 rows
> test_sub(X, X-1) <- nums(X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    0 │
│    2 │    1 │
│    3 │    2 │
└──────┴──────┘
3 rows
(session: 4 rule(s))
> ?test_sub(X, R)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    0 │
│    2 │    1 │
│    3 │    2 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_precedence_n28t22
Knowledge graph 'test_precedence_n28t22' dropped.
