Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_reserved_n28t23
Knowledge graph 'test_reserved_n28t23' created.
Switched to knowledge graph: test_reserved_n28t23
> .kg use test_reserved_n28t23
Switched to knowledge graph: test_reserved_n28t23
> +count_rel(1, 2)
Inserted 1 fact(s) into 'count_rel'.
> ?count_rel(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
└──────┴──────┘
1 rows
> +sum_data(1, 100)
Inserted 1 fact(s) into 'sum_data'.
> ?sum_data(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │  100 │
└──────┴──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_reserved_n28t23
Knowledge graph 'test_reserved_n28t23' dropped.
