Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_case_n28t24
Knowledge graph 'test_case_n28t24' created.
Switched to knowledge graph: test_case_n28t24
> .kg use test_case_n28t24
Switched to knowledge graph: test_case_n28t24
> +edge(1, 2).
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3).
Inserted 1 fact(s) into 'edge'.
> ?- edge(X, Y).
2 rows:
  (1, 2)
  (2, 3)
> +derived(A, B) :- edge(A, B).
Rule 'derived' registered.
> ?- derived(X, Y).
2 rows:
  (1, 2)
  (2, 3)
> +triple(A, B, C) :- edge(A, B), edge(B, C).
Rule 'triple' registered.
> ?- triple(X, Y, Z).
1 rows:
  (1, 2, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_case_n28t24
Knowledge graph 'test_case_n28t24' dropped.
