Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_shortest_n18t01
Knowledge graph 'test_shortest_n18t01' created.
Switched to knowledge graph: test_shortest_n18t01
> .kg use test_shortest_n18t01
Switched to knowledge graph: test_shortest_n18t01
> +edge[(1, 2), (1, 3), (2, 3), (2, 4), (3, 4)]
Inserted 5 fact(s) into 'edge'.
> +source[(1, 0)]
Inserted 1 fact(s) into 'source'.
> +dist(X, D) <- source(X, D)
Rule 'dist' registered.
> +dist(Y, D+1) <- dist(X, D), edge(X, Y)
Rule 'dist' registered.
> +shortest(Y, min<D>) <- dist(Y, D)
Rule 'shortest' registered.
> ?shortest(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 0 │
│ 2 │ 1 │
│ 3 │ 1 │
│ 4 │ 2 │
└───┴───┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_shortest_n18t01
Knowledge graph 'test_shortest_n18t01' dropped.
