
> .db create test_shortest
Database 'test_shortest' created.
Switched to database: test_shortest
> .db use test_shortest
Switched to database: test_shortest
> +edge[(1, 2), (1, 3), (2, 3), (2, 4), (3, 4)].
Inserted 5 facts into 'edge'.
> +source[(1, 0)].
Inserted 1 fact into 'source'.
> dist(X, D) := source(X, D).
View 'dist' registered.
> dist(Y, D+1) := dist(X, D), edge(X, Y).
Rule added to view 'dist' (2 rules total).
> shortest(Y, min<D>) := dist(Y, D).
View 'shortest' registered.
> ?- shortest(X, Y).
4 rows:
  (1, 0)
  (2, 1)
  (3, 1)
  (4, 2)
> .db use default
Switched to database: default
> .db drop test_shortest
Database 'test_shortest' dropped.
