Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_scc_n18t03
Knowledge graph 'test_scc_n18t03' created.
Switched to knowledge graph: test_scc_n18t03
> .kg use test_scc_n18t03
Switched to knowledge graph: test_scc_n18t03
> +edge[(1, 2), (2, 3), (3, 4), (4, 2), (5, 6), (6, 5)].
Inserted 6 fact(s) into 'edge'.
> +reachable(X, Y) :- edge(X, Y).
Rule 'reachable' registered.
> +reachable(X, Z) :- reachable(X, Y), edge(Y, Z).
Rule 'reachable' registered.
> +same_scc(X, Y) :- reachable(X, Y), reachable(Y, X).
Rule 'same_scc' registered.
> ?- same_scc(X, Y).
13 rows:
  (2, 2)
  (2, 3)
  (2, 4)
  (3, 2)
  (3, 3)
  (3, 4)
  (4, 2)
  (4, 3)
  (4, 4)
  (5, 5)
  (5, 6)
  (6, 5)
  (6, 6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_scc_n18t03
Knowledge graph 'test_scc_n18t03' dropped.
