Executing script: examples/datalog/18_advanced_patterns/04_bipartite.dl

> .db create test_bipartite
Database 'test_bipartite' created.
Switched to database: test_bipartite
> .db use test_bipartite
Switched to database: test_bipartite
> +edge[(1, 2), (2, 3), (3, 4), (4, 1)].
Inserted 4 facts into 'edge'.
> +start[(1, 0)].
Inserted 1 fact into 'start'.
> view color(X: int, C: int) :- start(X, C).
View 'color' registered.
> view color(Y: int, 1: int) :- color(X, 0), edge(X, Y).
Rule added to view 'color' (2 rules total).
> view color(Y: int, 1: int) :- color(X, 0), edge(Y, X).
Rule added to view 'color' (3 rules total).
> view color(Y: int, 0: int) :- color(X, 1), edge(X, Y).
Rule added to view 'color' (4 rules total).
> view color(Y: int, 0: int) :- color(X, 1), edge(Y, X).
Rule added to view 'color' (5 rules total).
> ?- color(X, C).
4 rows:
  (1, 0)
  (2, 1)
  (3, 0)
  (4, 1)
> .db use default
Switched to database: default
> .db drop test_bipartite
Database 'test_bipartite' dropped.
