Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_clique_n18t06
Knowledge graph 'test_clique_n18t06' created.
Switched to knowledge graph: test_clique_n18t06
> .kg use test_clique_n18t06
Switched to knowledge graph: test_clique_n18t06
> +edge[(1, 2), (1, 3), (1, 4), (1, 5), (2, 3), (2, 4), (2, 5), (3, 4), (3, 5), (4, 5)].
Inserted 10 fact(s) into 'edge'.
> +conn(X, Y) :- edge(X, Y).
Rule 'conn' registered.
> +conn(X, Y) :- edge(Y, X).
Rule 'conn' registered.
> +in_k4(A, B) :- conn(A, B), conn(A, C), conn(A, D), conn(B, C), conn(B, D), conn(C, D), A < B, B < C, C < D.
Rule 'in_k4' registered.
> ?- in_k4(X, Y).
3 rows:
  (1, 2)
  (1, 3)
  (2, 3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_clique_n18t06
Knowledge graph 'test_clique_n18t06' dropped.
