Executing script: examples/datalog/18_advanced_patterns/08_reaching_defs.dl

> .db create test_reaching
Database 'test_reaching' created.
Switched to database: test_reaching
> .db use test_reaching
Switched to database: test_reaching
> +cfg[(1, 2), (2, 3), (3, 4)].
Inserted 3 facts into 'cfg'.
> +def[(1, 1), (2, 2), (3, 1)].
Inserted 3 facts into 'def'.
> +reaches(D, D) :- def(D, _).
Rule 'reaches' registered.
> +reaches(D, Q) :- reaches(D, P), cfg(P, Q).
Rule added to 'reaches' (2 rules total).
> ?- reaches(X, Y).
9 rows:
  (1, 1)
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 2)
  (2, 3)
  (2, 4)
  (3, 3)
  (3, 4)
> +kills(S, D) :- def(S, V), def(D, V), S != D.
Rule 'kills' registered.
> ?- kills(X, Y).
2 rows:
  (1, 3)
  (3, 1)
> .db use default
Switched to database: default
> .db drop test_reaching
Database 'test_reaching' dropped.
