Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_reaching_n18t08
Knowledge graph 'test_reaching_n18t08' created.
Switched to knowledge graph: test_reaching_n18t08
> .kg use test_reaching_n18t08
Switched to knowledge graph: test_reaching_n18t08
> +cfg[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'cfg'.
> +def[(1, 1), (2, 2), (3, 1)]
Inserted 3 fact(s) into 'def'.
> +reaches(D, D) <- def(D, _)
Rule 'reaches' registered.
> +reaches(D, Q) <- reaches(D, P), cfg(P, Q)
Rule 'reaches' registered.
> ?reaches(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 2 │ 2 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 3 │
│ 3 │ 4 │
└───┴───┘
9 rows
> +kills(S, D) <- def(S, V), def(D, V), S != D
Rule 'kills' registered.
> ?kills(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 3 │
│ 3 │ 1 │
└───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_reaching_n18t08
Knowledge graph 'test_reaching_n18t08' dropped.
