Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ancestors
Knowledge graph 'test_ancestors' created.
Switched to knowledge graph: test_ancestors
> .kg use test_ancestors
Switched to knowledge graph: test_ancestors
> +parent[(2, 1), (3, 1), (4, 2)].
Inserted 3 fact(s) into 'parent'.
> +ancestor(X, Y) :- parent(X, Y).
Rule 'ancestor' registered.
> +ancestor(X, Z) :- parent(X, Y), ancestor(Y, Z).
Rule 'ancestor' registered.
> ?- ancestor(X, Y).
4 rows:
  (2, 1)
  (3, 1)
  (4, 1)
  (4, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_ancestors
Knowledge graph 'test_ancestors' dropped.
