
> .db create test_ancestors
Database 'test_ancestors' created.
Switched to database: test_ancestors
> .db use test_ancestors
Switched to database: test_ancestors
> +parent[(2, 1), (3, 1), (4, 2)].
Inserted 3 facts into 'parent'.
> ancestor(X, Y) := parent(X, Y).
View 'ancestor' registered.
> ancestor(X, Z) := parent(X, Y), ancestor(Y, Z).
Rule added to view 'ancestor' (2 rules total).
> ?- ancestor(X, Y).
4 rows:
  (2, 1)
  (3, 1)
  (4, 1)
  (4, 2)
> .db use default
Switched to database: default
> .db drop test_ancestors
Database 'test_ancestors' dropped.
