Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cond_agg_n18t100
Knowledge graph 'test_cond_agg_n18t100' created.
Switched to knowledge graph: test_cond_agg_n18t100
> .kg use test_cond_agg_n18t100
Switched to knowledge graph: test_cond_agg_n18t100
> +orders[(1, "A", 100), (2, "B", 200), (3, "A", 150), (4, "B", 50)].
Inserted 4 fact(s) into 'orders'.
> large_order_total(sum<Amount>) :- orders(_, _, Amount), Amount > 100.
1 rows:
  (350)
(session: 1 rule(s))
> count_large_per_cat(Cat, count<Id>) :- orders(Id, Cat, Amount), Amount > 75.
2 rows:
  ("A", 2)
  ("B", 1)
(session: 2 rule(s))
> ?- large_order_total(T).
1 rows:
  (350)
> ?- count_large_per_cat(Cat, N).
2 rows:
  ("A", 2)
  ("B", 1)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_cond_agg_n18t100
Knowledge graph 'test_cond_agg_n18t100' dropped.
