Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ratio_n18t101
Knowledge graph 'test_ratio_n18t101' created.
Switched to knowledge graph: test_ratio_n18t101
> .kg use test_ratio_n18t101
Switched to knowledge graph: test_ratio_n18t101
> +parts[(1, "A", 30), (2, "A", 20), (3, "B", 50), (4, "B", 25), (5, "B", 25)].
Inserted 5 fact(s) into 'parts'.
> sum_per_cat(Cat, sum<Val>) :- parts(_, Cat, Val).
2 rows:
  ("A", 50)
  ("B", 100)
(session: 1 rule(s))
> ?- sum_per_cat(Cat, Total).
2 rows:
  ("A", 50)
  ("B", 100)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_ratio_n18t101
Knowledge graph 'test_ratio_n18t101' dropped.
