Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_degree_n18t107
Knowledge graph 'test_degree_n18t107' created.
Switched to knowledge graph: test_degree_n18t107
> .kg use test_degree_n18t107
Switched to knowledge graph: test_degree_n18t107
> +edge[("a", "b"), ("a", "c"), ("b", "c"), ("c", "d")]
Inserted 4 fact(s) into 'edge'.
> out_degree(Node, count<Target>) <- edge(Node, Target)
┌─────┬───┐
│ X   │ Y │
├─────┼───┤
│ "a" │ 2 │
│ "b" │ 1 │
│ "c" │ 1 │
└─────┴───┘
3 rows
(session: 1 rule(s))
> in_degree(Node, count<Source>) <- edge(Source, Node)
┌─────┬───┐
│ X   │ Y │
├─────┼───┤
│ "b" │ 1 │
│ "c" │ 2 │
│ "d" │ 1 │
└─────┴───┘
3 rows
(session: 2 rule(s))
> ?out_degree(Node, D)
┌──────┬───┐
│ Node │ D │
├──────┼───┤
│ "a"  │ 2 │
│ "b"  │ 1 │
│ "c"  │ 1 │
└──────┴───┘
3 rows
> ?in_degree(Node, D)
┌──────┬───┐
│ Node │ D │
├──────┼───┤
│ "b"  │ 1 │
│ "c"  │ 2 │
│ "d"  │ 1 │
└──────┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_degree_n18t107
Knowledge graph 'test_degree_n18t107' dropped.
