Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sink_src
Knowledge graph 'test_sink_src' created.
Switched to knowledge graph: test_sink_src
> .kg use test_sink_src
Switched to knowledge graph: test_sink_src
> +edge[("a", "b"), ("b", "c"), ("c", "d")].
Inserted 3 fact(s) into 'edge'.
> +nodes[("a",), ("b",), ("c",), ("d",)].
Inserted 4 fact(s) into 'nodes'.
> has_outgoing(N) :- edge(N, _).
3 rows:
  ("a")
  ("b")
  ("c")
(session: 1 rule(s))
> has_incoming(N) :- edge(_, N).
3 rows:
  ("b")
  ("c")
  ("d")
(session: 2 rule(s))
> source(N) :- nodes(N), !has_incoming(N).
1 rows:
  ("a")
(session: 3 rule(s))
> sink(N) :- nodes(N), !has_outgoing(N).
1 rows:
  ("d")
(session: 4 rule(s))
> ?- source(N).
1 rows:
  ("a")
> ?- sink(N).
1 rows:
  ("d")
> .kg use default
Switched to knowledge graph: default
(Cleared 4 session rule(s), 0 session fact(s))
> .kg drop test_sink_src
Knowledge graph 'test_sink_src' dropped.
