Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_pivot
Knowledge graph 'test_pivot' created.
Switched to knowledge graph: test_pivot
> .kg use test_pivot
Switched to knowledge graph: test_pivot
> +monthly_sales[("Q1", 100, 110, 105), ("Q2", 120, 130, 125), ("Q3", 140, 150, 145)].
Inserted 3 fact(s) into 'monthly_sales'.
> +sale_record(Quarter, 1, M1) :- monthly_sales(Quarter, M1, _, _).
Rule 'sale_record' registered.
> +sale_record(Quarter, 2, M2) :- monthly_sales(Quarter, _, M2, _).
Rule 'sale_record' registered.
> +sale_record(Quarter, 3, M3) :- monthly_sales(Quarter, _, _, M3).
Rule 'sale_record' registered.
> ?- sale_record(Q, M, Amount).
9 rows:
  ("Q1", 1, 100)
  ("Q1", 2, 110)
  ("Q1", 3, 105)
  ("Q2", 1, 120)
  ("Q2", 2, 130)
  ("Q2", 3, 125)
  ("Q3", 1, 140)
  ("Q3", 2, 150)
  ("Q3", 3, 145)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_pivot
Knowledge graph 'test_pivot' dropped.
