Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_denorm
Knowledge graph 'test_denorm' created.
Switched to knowledge graph: test_denorm
> .kg use test_denorm
Switched to knowledge graph: test_denorm
> +users[(1, "Alice"), (2, "Bob")].
Inserted 2 fact(s) into 'users'.
> +orders[(101, 1, 50.0), (102, 2, 75.0), (103, 1, 25.0)].
Inserted 3 fact(s) into 'orders'.
> +products[(201, "Widget"), (202, "Gadget")].
Inserted 2 fact(s) into 'products'.
> +order_details(OrderId, UserName, Amount) :- orders(OrderId, UserId, Amount), users(UserId, UserName).
Rule 'order_details' registered.
> ?- order_details(O, U, A).
3 rows:
  (101, "Alice", 50.0)
  (102, "Bob", 75.0)
  (103, "Alice", 25.0)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_denorm
Knowledge graph 'test_denorm' dropped.
