Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dedup
Knowledge graph 'test_dedup' created.
Switched to knowledge graph: test_dedup
> .kg use test_dedup
Switched to knowledge graph: test_dedup
> +records[(1, "Alice", "NYC"), (2, "Bob", "NYC"), (3, "Carol", "LA"), (4, "Dave", "NYC")].
Inserted 4 fact(s) into 'records'.
> +unique_cities(City) :- records(_, _, City).
Rule 'unique_cities' registered.
> ?- unique_cities(C).
2 rows:
  ("LA")
  ("NYC")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dedup
Knowledge graph 'test_dedup' dropped.
