Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dedup_n18t116
Knowledge graph 'test_dedup_n18t116' created.
Switched to knowledge graph: test_dedup_n18t116
> .kg use test_dedup_n18t116
Switched to knowledge graph: test_dedup_n18t116
> +records[(1, "Alice", "NYC"), (2, "Bob", "NYC"), (3, "Carol", "LA"), (4, "Dave", "NYC")]
Inserted 4 fact(s) into 'records'.
> +unique_cities(City) <- records(_, _, City)
Rule 'unique_cities' registered.
> ?unique_cities(C)
┌───────┐
│ C     │
├───────┤
│ "LA"  │
│ "NYC" │
└───────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dedup_n18t116
Knowledge graph 'test_dedup_n18t116' dropped.
