Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_star_n18t118
Knowledge graph 'test_star_n18t118' created.
Switched to knowledge graph: test_star_n18t118
> .kg use test_star_n18t118
Switched to knowledge graph: test_star_n18t118
> +dim_product[(1, "Widget"), (2, "Gadget")].
Inserted 2 fact(s) into 'dim_product'.
> +dim_date[(1, "2024-01"), (2, "2024-02")].
Inserted 2 fact(s) into 'dim_date'.
> +dim_region[(1, "East"), (2, "West")].
Inserted 2 fact(s) into 'dim_region'.
> +fact_sales[(1, 1, 1, 1, 100), (2, 1, 2, 2, 150), (3, 2, 1, 1, 200)].
Inserted 3 fact(s) into 'fact_sales'.
> +report(ProdName, DateVal, RegionName, Amount) :- fact_sales(_, ProdId, DateId, RegionId, Amount), dim_product(ProdId, ProdName), dim_date(DateId, DateVal), dim_region(RegionId, RegionName).
Rule 'report' registered.
> ?- report(P, D, R, A).
3 rows:
  ("Gadget", "2024-01", "East", 200)
  ("Widget", "2024-01", "East", 100)
  ("Widget", "2024-02", "West", 150)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_star_n18t118
Knowledge graph 'test_star_n18t118' dropped.
