Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_ref_n18t120
Knowledge graph 'test_self_ref_n18t120' created.
Switched to knowledge graph: test_self_ref_n18t120
> .kg use test_self_ref_n18t120
Switched to knowledge graph: test_self_ref_n18t120
> +employees[(1, "Alice", 0), (2, "Bob", 1), (3, "Carol", 1), (4, "Dave", 2)].
Inserted 4 fact(s) into 'employees'.
> +with_manager(EmpName, MgrName) :- employees(EmpId, EmpName, MgrId), employees(MgrId, MgrName, _), MgrId > 0.
Rule 'with_manager' registered.
> ?- with_manager(E, M).
3 rows:
  ("Bob", "Alice")
  ("Carol", "Alice")
  ("Dave", "Bob")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_self_ref_n18t120
Knowledge graph 'test_self_ref_n18t120' dropped.
