Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_self_ref_n18t120
Knowledge graph 'test_self_ref_n18t120' created.
Switched to knowledge graph: test_self_ref_n18t120
> .kg use test_self_ref_n18t120
Switched to knowledge graph: test_self_ref_n18t120
> +employees[(1, "Alice", 0), (2, "Bob", 1), (3, "Carol", 1), (4, "Dave", 2)]
Inserted 4 fact(s) into 'employees'.
> +with_manager(EmpName, MgrName) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> employees(EmpId, EmpName, MgrId),
Parse error: Expected parentheses: (EmpId, EmpName, MgrId),
> employees(MgrId, MgrName, _),
Parse error: Expected parentheses: (MgrId, MgrName, _),
> MgrId > 0
Parse error: Unrecognized statement: MgrId > 0
> ?with_manager(E, M)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_self_ref_n18t120
Knowledge graph 'test_self_ref_n18t120' dropped.
