Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rank_n18t122
Knowledge graph 'test_rank_n18t122' created.
Switched to knowledge graph: test_rank_n18t122
> .kg use test_rank_n18t122
Switched to knowledge graph: test_rank_n18t122
> +scores[(1, 95), (2, 87), (3, 92), (4, 87)]
Inserted 4 fact(s) into 'scores'.
> +rank(Id, Score, count<OtherId>) <- scores(Id, Score), scores(OtherId, OtherScore), OtherScore > Score
Rule 'rank' registered.
> ?rank(Id, Score, R)
┌────┬───────┬───┐
│ Id │ Score │ R │
├────┼───────┼───┤
│  2 │    87 │ 2 │
│  3 │    92 │ 1 │
│  4 │    87 │ 2 │
└────┴───────┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rank_n18t122
Knowledge graph 'test_rank_n18t122' dropped.
