Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dense_rank
Knowledge graph 'test_dense_rank' created.
Switched to knowledge graph: test_dense_rank
> .kg use test_dense_rank
Switched to knowledge graph: test_dense_rank
> +scores[(1, 100), (2, 90), (3, 100), (4, 80)].
Inserted 4 fact(s) into 'scores'.
> +distinct_scores(S) :- scores(_, S).
Rule 'distinct_scores' registered.
> ?- distinct_scores(S).
3 rows:
  (80)
  (90)
  (100)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dense_rank
Knowledge graph 'test_dense_rank' dropped.
