Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cumulative_n18t124
Knowledge graph 'test_cumulative_n18t124' created.
Switched to knowledge graph: test_cumulative_n18t124
> .kg use test_cumulative_n18t124
Switched to knowledge graph: test_cumulative_n18t124
> +data[(1, 10), (2, 20), (3, 30)]
Inserted 3 fact(s) into 'data'.
> +cumulative(Id, sum<Val>) <- data(Id, _), data(OtherId, Val), OtherId <= Id
Rule 'cumulative' registered.
> ?cumulative(Id, Sum)
┌────┬─────┐
│ Id │ Sum │
├────┼─────┤
│  1 │  10 │
│  2 │  30 │
│  3 │  60 │
└────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cumulative_n18t124
Knowledge graph 'test_cumulative_n18t124' dropped.
