Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rownum_n18t125
Knowledge graph 'test_rownum_n18t125' created.
Switched to knowledge graph: test_rownum_n18t125
> .kg use test_rownum_n18t125
Switched to knowledge graph: test_rownum_n18t125
> +data[(5, "E"), (3, "C"), (1, "A"), (4, "D"), (2, "B")]
Inserted 5 fact(s) into 'data'.
> +row_pos(Id, Name, count<OtherId>) <- data(Id, Name), data(OtherId, _), OtherId < Id
Rule 'row_pos' registered.
> ?row_pos(Id, Name, Pos)
┌────┬──────┬─────┐
│ Id │ Name │ Pos │
├────┼──────┼─────┤
│  2 │ "B"  │   1 │
│  3 │ "C"  │   2 │
│  4 │ "D"  │   3 │
│  5 │ "E"  │   4 │
└────┴──────┴─────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rownum_n18t125
Knowledge graph 'test_rownum_n18t125' dropped.
