Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ntile_n18t126
Knowledge graph 'test_ntile_n18t126' created.
Switched to knowledge graph: test_ntile_n18t126
> .kg use test_ntile_n18t126
Switched to knowledge graph: test_ntile_n18t126
> +scores[(1, 95), (2, 85), (3, 75), (4, 65)]
Inserted 4 fact(s) into 'scores'.
> +quartile(Id, Score, count<OtherId>) <- scores(Id, Score), scores(OtherId, OtherScore), OtherScore >= Score
Rule 'quartile' registered.
> ?quartile(Id, Score, Q)
┌────┬───────┬───┐
│ Id │ Score │ Q │
├────┼───────┼───┤
│  1 │    95 │ 1 │
│  2 │    85 │ 2 │
│  3 │    75 │ 3 │
│  4 │    65 │ 4 │
└────┴───────┴───┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_ntile_n18t126
Knowledge graph 'test_ntile_n18t126' dropped.
