Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lag_n18t127
Knowledge graph 'test_lag_n18t127' created.
Switched to knowledge graph: test_lag_n18t127
> .kg use test_lag_n18t127
Switched to knowledge graph: test_lag_n18t127
> +data[(1, 100), (2, 150), (3, 120), (4, 180)]
Inserted 4 fact(s) into 'data'.
> +consecutive(Id, Val, PrevVal) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> data(Id, Val),
Parse error: Expected parentheses: (Id, Val),
> data(PrevId, PrevVal),
Parse error: Expected parentheses: (PrevId, PrevVal),
> PrevId = Id - 1
Parse error: Unrecognized statement: PrevId = Id - 1
> ?consecutive(Id, Val, Prev)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_lag_n18t127
Knowledge graph 'test_lag_n18t127' dropped.
