Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lead_n18t128
Knowledge graph 'test_lead_n18t128' created.
Switched to knowledge graph: test_lead_n18t128
> .kg use test_lead_n18t128
Switched to knowledge graph: test_lead_n18t128
> +data[(1, 100), (2, 150), (3, 120), (4, 180)].
Inserted 4 fact(s) into 'data'.
> +with_next(Id, Val, NextVal) :- data(Id, Val), data(NextId, NextVal), NextId = Id + 1.
Rule 'with_next' registered.
> ?- with_next(Id, Val, Next).
16 rows:
  (1, 100, 100)
  (1, 100, 120)
  (1, 100, 150)
  (1, 100, 180)
  (2, 150, 100)
  (2, 150, 120)
  (2, 150, 150)
  (2, 150, 180)
  (3, 120, 100)
  (3, 120, 120)
  (3, 120, 150)
  (3, 120, 180)
  (4, 180, 100)
  (4, 180, 120)
  (4, 180, 150)
  (4, 180, 180)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_lead_n18t128
Knowledge graph 'test_lead_n18t128' dropped.
