Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_window_n18t132
Knowledge graph 'test_window_n18t132' created.
Switched to knowledge graph: test_window_n18t132
> .kg use test_window_n18t132
Switched to knowledge graph: test_window_n18t132
> +sales[(1, 100), (2, 150), (3, 200), (4, 125), (5, 175)].
Inserted 5 fact(s) into 'sales'.
> rank(Id, count<Other>) :- sales(Id, Val), sales(Other, OtherVal), OtherVal > Val.
4 rows:
  (1, 4)
  (2, 2)
  (4, 3)
  (5, 1)
(session: 1 rule(s))
> ?- rank(Id, R).
4 rows:
  (1, 4)
  (2, 2)
  (4, 3)
  (5, 1)
> running(Id, count<Other>) :- sales(Id, Val), sales(Other, OtherVal), OtherVal <= Val.
5 rows:
  (1, 1)
  (2, 3)
  (3, 5)
  (4, 2)
  (5, 4)
(session: 2 rule(s))
> ?- running(Id, R).
5 rows:
  (1, 1)
  (2, 3)
  (3, 5)
  (4, 2)
  (5, 4)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_window_n18t132
Knowledge graph 'test_window_n18t132' dropped.
