Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_window_n18t132
Knowledge graph 'test_window_n18t132' created.
Switched to knowledge graph: test_window_n18t132
> .kg use test_window_n18t132
Switched to knowledge graph: test_window_n18t132
> +sales[(1, 100), (2, 150), (3, 200), (4, 125), (5, 175)]
Inserted 5 fact(s) into 'sales'.
> rank(Id, count<Other>) <- sales(Id, Val), sales(Other, OtherVal), OtherVal > Val
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 4 │
│ 2 │ 2 │
│ 4 │ 3 │
│ 5 │ 1 │
└───┴───┘
4 rows
(session: 1 rule(s))
> ?rank(Id, R)
┌────┬───┐
│ Id │ R │
├────┼───┤
│  1 │ 4 │
│  2 │ 2 │
│  4 │ 3 │
│  5 │ 1 │
└────┴───┘
4 rows
> running(Id, count<Other>) <- sales(Id, Val), sales(Other, OtherVal), OtherVal <= Val
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 2 │ 3 │
│ 3 │ 5 │
│ 4 │ 2 │
│ 5 │ 4 │
└───┴───┘
5 rows
(session: 2 rule(s))
> ?running(Id, R)
┌────┬───┐
│ Id │ R │
├────┼───┤
│  1 │ 1 │
│  2 │ 3 │
│  3 │ 5 │
│  4 │ 2 │
│  5 │ 4 │
└────┴───┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_window_n18t132
Knowledge graph 'test_window_n18t132' dropped.
