Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_components_n18t13
Knowledge graph 'test_components_n18t13' created.
Switched to knowledge graph: test_components_n18t13
> .kg use test_components_n18t13
Switched to knowledge graph: test_components_n18t13
> +edge[(1, 2), (2, 1), (2, 3), (3, 2), (4, 5), (5, 4), (6, 6)]
Inserted 7 fact(s) into 'edge'.
> +reach(X, Y) <- edge(X, Y)
Rule 'reach' registered.
> +reach(X, Z) <- reach(X, Y), edge(Y, Z)
Rule 'reach' registered.
> ?reach(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 1 │
│ 2 │ 2 │
│ 2 │ 3 │
│ 3 │ 1 │
│ 3 │ 2 │
│ 3 │ 3 │
│ 4 │ 4 │
│ 4 │ 5 │
│ 5 │ 4 │
│ 5 │ 5 │
│ 6 │ 6 │
└───┴───┘
14 rows
> same_comp(X, Y) <- reach(X, Y), reach(Y, X)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 1 │
│ 2 │ 2 │
│ 2 │ 3 │
│ 3 │ 1 │
│ 3 │ 2 │
│ 3 │ 3 │
│ 4 │ 4 │
│ 4 │ 5 │
│ 5 │ 4 │
│ 5 │ 5 │
│ 6 │ 6 │
└───┴───┘
14 rows
(session: 1 rule(s))
> ?same_comp(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 1 │
│ 1 │ 2 │
│ 1 │ 3 │
│ 2 │ 1 │
│ 2 │ 2 │
│ 2 │ 3 │
│ 3 │ 1 │
│ 3 │ 2 │
│ 3 │ 3 │
│ 4 │ 4 │
│ 4 │ 5 │
│ 5 │ 4 │
│ 5 │ 5 │
│ 6 │ 6 │
└───┴───┘
14 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_components_n18t13
Knowledge graph 'test_components_n18t13' dropped.
