Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_path_count_n18t14
Knowledge graph 'test_path_count_n18t14' created.
Switched to knowledge graph: test_path_count_n18t14
> .kg use test_path_count_n18t14
Switched to knowledge graph: test_path_count_n18t14
> +edge[(1, 2), (1, 3), (2, 4), (3, 4)]
Inserted 4 fact(s) into 'edge'.
> path_count(X, Y, 1) <- edge(X, Y)
┌───┬───┬───┐
│ X │ Y │ Z │
├───┼───┼───┤
│ 1 │ 2 │ 1 │
│ 1 │ 3 │ 1 │
│ 2 │ 4 │ 1 │
│ 3 │ 4 │ 1 │
└───┴───┴───┘
4 rows
(session: 1 rule(s))
> path2(X, Z, count<Y>) <- edge(X, Y), edge(Y, Z)
┌───┬───┬───┐
│ X │ Y │ Z │
├───┼───┼───┤
│ 1 │ 4 │ 2 │
└───┴───┴───┘
1 rows
(session: 2 rule(s))
> ?path2(X, Z, C)
┌───┬───┬───┐
│ X │ Z │ C │
├───┼───┼───┤
│ 1 │ 4 │ 2 │
└───┴───┴───┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_path_count_n18t14
Knowledge graph 'test_path_count_n18t14' dropped.
