Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_denorm_n18t16
Knowledge graph 'test_denorm_n18t16' created.
Switched to knowledge graph: test_denorm_n18t16
> .kg use test_denorm_n18t16
Switched to knowledge graph: test_denorm_n18t16
> +orders[(1, "widget", "Alice", 100), (2, "gadget", "Bob", 200), (3, "widget", "Alice", 150), (4, "gizmo", "Carol", 75), (5, "widget", "Bob", 100)].
Inserted 5 fact(s) into 'orders'.
> customer_total(Customer, sum<Amt>) :- orders(_, _, Customer, Amt).
3 rows:
  ("Alice", 250)
  ("Bob", 300)
  ("Carol", 75)
(session: 1 rule(s))
> ?- customer_total(Customer, Total).
3 rows:
  ("Alice", 250)
  ("Bob", 300)
  ("Carol", 75)
> product_total(Product, sum<Amt>) :- orders(_, Product, _, Amt).
3 rows:
  ("gadget", 200)
  ("gizmo", 75)
  ("widget", 350)
(session: 2 rule(s))
> ?- product_total(Product, Total).
3 rows:
  ("gadget", 200)
  ("gizmo", 75)
  ("widget", 350)
> crosstab(Customer, Product, sum<Amt>) :- orders(_, Product, Customer, Amt).
4 rows:
  ("Alice", "widget", 250)
  ("Bob", "gadget", 200)
  ("Bob", "widget", 100)
  ("Carol", "gizmo", 75)
(session: 3 rule(s))
> ?- crosstab(Customer, Product, Total).
4 rows:
  ("Alice", "widget", 250)
  ("Bob", "gadget", 200)
  ("Bob", "widget", 100)
  ("Carol", "gizmo", 75)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_denorm_n18t16
Knowledge graph 'test_denorm_n18t16' dropped.
