Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bom_n18t17
Knowledge graph 'test_bom_n18t17' created.
Switched to knowledge graph: test_bom_n18t17
> .kg use test_bom_n18t17
Switched to knowledge graph: test_bom_n18t17
> +component[(1, 2, 2), (1, 3, 1), (2, 4, 3), (3, 4, 1), (3, 5, 2)]
Inserted 5 fact(s) into 'component'.
> +part_name[(1, "Assembly"), (2, "SubA"), (3, "SubB"), (4, "Bolt"), (5, "Nut")]
Inserted 5 fact(s) into 'part_name'.
> +all_parts(Part, Comp, Qty) <- component(Part, Comp, Qty)
Rule 'all_parts' registered.
> +all_parts(Part, Comp, Qty) <- component(Part, Mid, _), all_parts(Mid, Comp, Qty)
Rule 'all_parts' registered.
> ?all_parts(Part, Comp, Qty)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    2 │    2 │
│    1 │    3 │    1 │
│    1 │    4 │    1 │
│    1 │    4 │    3 │
│    1 │    5 │    2 │
│    2 │    4 │    3 │
│    3 │    4 │    1 │
│    3 │    5 │    2 │
└──────┴──────┴──────┘
8 rows
> unique_comps(Part, count<Comp>) <- all_parts(Part, Comp, _)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    5 │
│    2 │    1 │
│    3 │    2 │
└──────┴──────┘
3 rows
(session: 1 rule(s))
> ?unique_comps(Part, Count)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    5 │
│    2 │    1 │
│    3 │    2 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_bom_n18t17
Knowledge graph 'test_bom_n18t17' dropped.
