Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_ancestors_n18t18
Knowledge graph 'test_ancestors_n18t18' created.
Switched to knowledge graph: test_ancestors_n18t18
> .kg use test_ancestors_n18t18
Switched to knowledge graph: test_ancestors_n18t18
> +parent[("Alice", "Bob"), ("Alice", "Carol"), ("Bob", "Dave"), ("Bob", "Eve"), ("Carol", "Frank")]
Inserted 5 fact(s) into 'parent'.
> +ancestor(Child, Anc) <- parent(Anc, Child)
Rule 'ancestor' registered.
> +ancestor(Child, Anc) <- parent(Mid, Child), ancestor(Mid, Anc)
Rule 'ancestor' registered.
> ?ancestor(Child, Anc)
┌─────────┬─────────┐
│ Child   │ Anc     │
├─────────┼─────────┤
│ "Bob"   │ "Alice" │
│ "Carol" │ "Alice" │
│ "Dave"  │ "Alice" │
│ "Dave"  │ "Bob"   │
│ "Eve"   │ "Alice" │
│ "Eve"   │ "Bob"   │
│ "Frank" │ "Alice" │
│ "Frank" │ "Carol" │
└─────────┴─────────┘
8 rows
> alice_descendants(D) <- ancestor(D, "Alice")
┌─────────┐
│ X       │
├─────────┤
│ "Bob"   │
│ "Carol" │
│ "Dave"  │
│ "Eve"   │
│ "Frank" │
└─────────┘
5 rows
(session: 1 rule(s))
> ?alice_descendants(D)
┌─────────┐
│ D       │
├─────────┤
│ "Bob"   │
│ "Carol" │
│ "Dave"  │
│ "Eve"   │
│ "Frank" │
└─────────┘
5 rows
> desc_count(Person, count<D>) <- ancestor(D, Person)
┌─────────┬───┐
│ X       │ Y │
├─────────┼───┤
│ "Alice" │ 5 │
│ "Bob"   │ 2 │
│ "Carol" │ 1 │
└─────────┴───┘
3 rows
(session: 2 rule(s))
> ?desc_count(Person, Count)
┌─────────┬───────┐
│ Person  │ Count │
├─────────┼───────┤
│ "Alice" │     5 │
│ "Bob"   │     2 │
│ "Carol" │     1 │
└─────────┴───────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_ancestors_n18t18
Knowledge graph 'test_ancestors_n18t18' dropped.
