Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_grouping_n18t19
Knowledge graph 'test_grouping_n18t19' created.
Switched to knowledge graph: test_grouping_n18t19
> .kg use test_grouping_n18t19
Switched to knowledge graph: test_grouping_n18t19
> +sales[("East", "Widget", 100), ("East", "Gadget", 200), ("West", "Widget", 150), ("West", "Gadget", 250)]
Inserted 4 fact(s) into 'sales'.
> +region_total(Region, sum<Amt>) <- sales(Region, _, Amt)
Rule 'region_total' registered.
> +product_total(Product, sum<Amt>) <- sales(_, Product, Amt)
Rule 'product_total' registered.
> +both_total(Region, Product, sum<Amt>) <- sales(Region, Product, Amt)
Rule 'both_total' registered.
> ?region_total(R, T)
┌────────┬─────┐
│ R      │ T   │
├────────┼─────┤
│ "East" │ 300 │
│ "West" │ 400 │
└────────┴─────┘
2 rows
> ?product_total(P, T)
┌──────────┬─────┐
│ P        │ T   │
├──────────┼─────┤
│ "Gadget" │ 450 │
│ "Widget" │ 250 │
└──────────┴─────┘
2 rows
> ?both_total(R, P, T)
┌────────┬──────────┬─────┐
│ R      │ P        │ T   │
├────────┼──────────┼─────┤
│ "East" │ "Gadget" │ 200 │
│ "East" │ "Widget" │ 100 │
│ "West" │ "Gadget" │ 250 │
│ "West" │ "Widget" │ 150 │
└────────┴──────────┴─────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_grouping_n18t19
Knowledge graph 'test_grouping_n18t19' dropped.
