Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_pivot_n18t20
Knowledge graph 'test_pivot_n18t20' created.
Switched to knowledge graph: test_pivot_n18t20
> .kg use test_pivot_n18t20
Switched to knowledge graph: test_pivot_n18t20
> +sales[("Q1", "North", 100), ("Q1", "South", 150), ("Q2", "North", 120), ("Q2", "South", 180)]
Inserted 4 fact(s) into 'sales'.
> q1_sales(Region, sum<Amt>) <- sales("Q1", Region, Amt)
┌─────────┬─────┐
│ X       │ Y   │
├─────────┼─────┤
│ "North" │ 100 │
│ "South" │ 150 │
└─────────┴─────┘
2 rows
(session: 1 rule(s))
> q2_sales(Region, sum<Amt>) <- sales("Q2", Region, Amt)
┌─────────┬─────┐
│ X       │ Y   │
├─────────┼─────┤
│ "North" │ 120 │
│ "South" │ 180 │
└─────────┴─────┘
2 rows
(session: 2 rule(s))
> ?q1_sales(Region, Amt)
┌─────────┬─────┐
│ Region  │ Amt │
├─────────┼─────┤
│ "North" │ 100 │
│ "South" │ 150 │
└─────────┴─────┘
2 rows
> ?q2_sales(Region, Amt)
┌─────────┬─────┐
│ Region  │ Amt │
├─────────┼─────┤
│ "North" │ 120 │
│ "South" │ 180 │
└─────────┴─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_pivot_n18t20
Knowledge graph 'test_pivot_n18t20' dropped.
