Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lead_lag_n18t26
Knowledge graph 'test_lead_lag_n18t26' created.
Switched to knowledge graph: test_lead_lag_n18t26
> .kg use test_lead_lag_n18t26
Switched to knowledge graph: test_lead_lag_n18t26
> +events[(1, 100), (2, 150), (3, 120), (4, 180), (5, 90)].
Inserted 5 fact(s) into 'events'.
> lead_val(Id, Val, NextVal) :- events(Id, Val), events(NextId, NextVal), NextId = Id + 1.
25 rows:
  (1, 100, 90)
  (1, 100, 100)
  (1, 100, 120)
  (1, 100, 150)
  (1, 100, 180)
  (2, 150, 90)
  (2, 150, 100)
  (2, 150, 120)
  (2, 150, 150)
  (2, 150, 180)
  (3, 120, 90)
  (3, 120, 100)
  (3, 120, 120)
  (3, 120, 150)
  (3, 120, 180)
  (4, 180, 90)
  (4, 180, 100)
  (4, 180, 120)
  (4, 180, 150)
  (4, 180, 180)
  (5, 90, 90)
  (5, 90, 100)
  (5, 90, 120)
  (5, 90, 150)
  (5, 90, 180)
(session: 1 rule(s))
> ?- lead_val(Id, Val, NextVal).
25 rows:
  (1, 100, 90)
  (1, 100, 100)
  (1, 100, 120)
  (1, 100, 150)
  (1, 100, 180)
  (2, 150, 90)
  (2, 150, 100)
  (2, 150, 120)
  (2, 150, 150)
  (2, 150, 180)
  (3, 120, 90)
  (3, 120, 100)
  (3, 120, 120)
  (3, 120, 150)
  (3, 120, 180)
  (4, 180, 90)
  (4, 180, 100)
  (4, 180, 120)
  (4, 180, 150)
  (4, 180, 180)
  (5, 90, 90)
  (5, 90, 100)
  (5, 90, 120)
  (5, 90, 150)
  (5, 90, 180)
> lag_val(Id, Val, PrevVal) :- events(Id, Val), events(PrevId, PrevVal), PrevId = Id - 1.
25 rows:
  (1, 100, 90)
  (1, 100, 100)
  (1, 100, 120)
  (1, 100, 150)
  (1, 100, 180)
  (2, 150, 90)
  (2, 150, 100)
  (2, 150, 120)
  (2, 150, 150)
  (2, 150, 180)
  (3, 120, 90)
  (3, 120, 100)
  (3, 120, 120)
  (3, 120, 150)
  (3, 120, 180)
  (4, 180, 90)
  (4, 180, 100)
  (4, 180, 120)
  (4, 180, 150)
  (4, 180, 180)
  (5, 90, 90)
  (5, 90, 100)
  (5, 90, 120)
  (5, 90, 150)
  (5, 90, 180)
(session: 2 rule(s))
> ?- lag_val(Id, Val, PrevVal).
25 rows:
  (1, 100, 90)
  (1, 100, 100)
  (1, 100, 120)
  (1, 100, 150)
  (1, 100, 180)
  (2, 150, 90)
  (2, 150, 100)
  (2, 150, 120)
  (2, 150, 150)
  (2, 150, 180)
  (3, 120, 90)
  (3, 120, 100)
  (3, 120, 120)
  (3, 120, 150)
  (3, 120, 180)
  (4, 180, 90)
  (4, 180, 100)
  (4, 180, 120)
  (4, 180, 150)
  (4, 180, 180)
  (5, 90, 90)
  (5, 90, 100)
  (5, 90, 120)
  (5, 90, 150)
  (5, 90, 180)
> change(Id, Val, Diff) :- lag_val(Id, Val, PrevVal), Diff = Val - PrevVal.
25 rows:
  (1, 100, -80)
  (1, 100, -50)
  (1, 100, -20)
  (1, 100, 0)
  (1, 100, 10)
  (2, 150, -30)
  (2, 150, 0)
  (2, 150, 30)
  (2, 150, 50)
  (2, 150, 60)
  (3, 120, -60)
  (3, 120, -30)
  (3, 120, 0)
  (3, 120, 20)
  (3, 120, 30)
  (4, 180, 0)
  (4, 180, 30)
  (4, 180, 60)
  (4, 180, 80)
  (4, 180, 90)
  (5, 90, -90)
  (5, 90, -60)
  (5, 90, -30)
  (5, 90, -10)
  (5, 90, 0)
(session: 3 rule(s))
> ?- change(Id, Val, Diff).
25 rows:
  (1, 100, -80)
  (1, 100, -50)
  (1, 100, -20)
  (1, 100, 0)
  (1, 100, 10)
  (2, 150, -30)
  (2, 150, 0)
  (2, 150, 30)
  (2, 150, 50)
  (2, 150, 60)
  (3, 120, -60)
  (3, 120, -30)
  (3, 120, 0)
  (3, 120, 20)
  (3, 120, 30)
  (4, 180, 0)
  (4, 180, 30)
  (4, 180, 60)
  (4, 180, 80)
  (4, 180, 90)
  (5, 90, -90)
  (5, 90, -60)
  (5, 90, -30)
  (5, 90, -10)
  (5, 90, 0)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_lead_lag_n18t26
Knowledge graph 'test_lead_lag_n18t26' dropped.
