Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_gaps_n18t27
Knowledge graph 'test_gaps_n18t27' created.
Switched to knowledge graph: test_gaps_n18t27
> .kg use test_gaps_n18t27
Switched to knowledge graph: test_gaps_n18t27
> +seq[(1,), (2,), (4,), (5,), (8,), (9,), (10,)]
Inserted 7 fact(s) into 'seq'.
> has_gap(X) <- seq(X), Next = X + 1, !seq(Next), Next <= 10
┌───┐
│ X │
├───┤
│ 2 │
│ 5 │
└───┘
2 rows
(session: 1 rule(s))
> ?has_gap(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 5 │
└───┘
2 rows
> consecutive(X, Y) <- seq(X), seq(Y), Y = X + 1
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  1 │  1 │
│  1 │  2 │
│  1 │  4 │
│  1 │  5 │
│  1 │  8 │
│  1 │  9 │
│  1 │ 10 │
│  2 │  1 │
│  2 │  2 │
│  2 │  4 │
│  2 │  5 │
│  2 │  8 │
│  2 │  9 │
│  2 │ 10 │
│  4 │  1 │
│  4 │  2 │
│  4 │  4 │
│  4 │  5 │
│  4 │  8 │
│  4 │  9 │
│  4 │ 10 │
│  5 │  1 │
│  5 │  2 │
│  5 │  4 │
│  5 │  5 │
│  5 │  8 │
│  5 │  9 │
│  5 │ 10 │
│  8 │  1 │
│  8 │  2 │
│  8 │  4 │
│  8 │  5 │
│  8 │  8 │
│  8 │  9 │
│  8 │ 10 │
│  9 │  1 │
│  9 │  2 │
│  9 │  4 │
│  9 │  5 │
│  9 │  8 │
│  9 │  9 │
│  9 │ 10 │
│ 10 │  1 │
│ 10 │  2 │
│ 10 │  4 │
│ 10 │  5 │
│ 10 │  8 │
│ 10 │  9 │
│ 10 │ 10 │
└────┴────┘
49 rows
(session: 2 rule(s))
> ?consecutive(X, Y)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│  1 │  1 │
│  1 │  2 │
│  1 │  4 │
│  1 │  5 │
│  1 │  8 │
│  1 │  9 │
│  1 │ 10 │
│  2 │  1 │
│  2 │  2 │
│  2 │  4 │
│  2 │  5 │
│  2 │  8 │
│  2 │  9 │
│  2 │ 10 │
│  4 │  1 │
│  4 │  2 │
│  4 │  4 │
│  4 │  5 │
│  4 │  8 │
│  4 │  9 │
│  4 │ 10 │
│  5 │  1 │
│  5 │  2 │
│  5 │  4 │
│  5 │  5 │
│  5 │  8 │
│  5 │  9 │
│  5 │ 10 │
│  8 │  1 │
│  8 │  2 │
│  8 │  4 │
│  8 │  5 │
│  8 │  8 │
│  8 │  9 │
│  8 │ 10 │
│  9 │  1 │
│  9 │  2 │
│  9 │  4 │
│  9 │  5 │
│  9 │  8 │
│  9 │  9 │
│  9 │ 10 │
│ 10 │  1 │
│ 10 │  2 │
│ 10 │  4 │
│ 10 │  5 │
│ 10 │  8 │
│ 10 │  9 │
│ 10 │ 10 │
└────┴────┘
49 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_gaps_n18t27
Knowledge graph 'test_gaps_n18t27' dropped.
