Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cond_agg2_n18t29
Knowledge graph 'test_cond_agg2_n18t29' created.
Switched to knowledge graph: test_cond_agg2_n18t29
> .kg use test_cond_agg2_n18t29
Switched to knowledge graph: test_cond_agg2_n18t29
> +sales[(1, "North", 100, "active"), (2, "South", 150, "active"), (3, "North", 200, "inactive"), (4, "South", 175, "active"), (5, "East", 50, "inactive")]
Inserted 5 fact(s) into 'sales'.
> +active_sum(Region, sum<Amt>) <- sales(_, Region, Amt, "active")
Rule 'active_sum' registered.
> ?active_sum(Region, Sum)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "North" │  100 │
│ "South" │  325 │
└─────────┴──────┘
2 rows
> +inactive_count(Region, count<Id>) <- sales(Id, Region, _, "inactive")
Rule 'inactive_count' registered.
> ?inactive_count(Region, Count)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "East"  │    1 │
│ "North" │    1 │
└─────────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cond_agg2_n18t29
Knowledge graph 'test_cond_agg2_n18t29' dropped.
