Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_self_cmp_n18t30
Knowledge graph 'test_self_cmp_n18t30' created.
Switched to knowledge graph: test_self_cmp_n18t30
> .kg use test_self_cmp_n18t30
Switched to knowledge graph: test_self_cmp_n18t30
> +scores[(1, "Alice", 85), (2, "Bob", 92), (3, "Carol", 78), (4, "Dave", 92)]
Inserted 4 fact(s) into 'scores'.
> higher_than(Name1, Name2, Score1, Score2) <- scores(_, Name1, Score1), scores(_, Name2, Score2), Score1 > Score2
No results.
(session: 1 rule(s))
> ?higher_than(N1, N2, S1, S2)
No results.
> ties(Name1, Name2, Score) <- scores(Id1, Name1, Score), scores(Id2, Name2, Score), Id1 < Id2
┌───────┬────────┬────┐
│ X     │ Y      │ Z  │
├───────┼────────┼────┤
│ "Bob" │ "Dave" │ 92 │
└───────┴────────┴────┘
1 rows
(session: 2 rule(s))
> ?ties(N1, N2, S)
┌───────┬────────┬────┐
│ N1    │ N2     │ S  │
├───────┼────────┼────┤
│ "Bob" │ "Dave" │ 92 │
└───────┴────────┴────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_self_cmp_n18t30
Knowledge graph 'test_self_cmp_n18t30' dropped.
