Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cond_agg_n18t31
Knowledge graph 'test_cond_agg_n18t31' created.
Switched to knowledge graph: test_cond_agg_n18t31
> .kg use test_cond_agg_n18t31
Switched to knowledge graph: test_cond_agg_n18t31
> +sales[("North", 100), ("South", 200), ("North", 150), ("South", 50)]
Inserted 4 fact(s) into 'sales'.
> +north_sum(sum<Amt>) <- sales("North", Amt)
Rule 'north_sum' registered.
> ?north_sum(S)
┌──────┐
│ col0 │
├──────┤
│  250 │
└──────┘
1 rows
> +region_count(Region, count<Amt>) <- sales(Region, Amt)
Rule 'region_count' registered.
> ?region_count(Region, C)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "North" │    2 │
│ "South" │    2 │
└─────────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cond_agg_n18t31
Knowledge graph 'test_cond_agg_n18t31' dropped.
