Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_cmp
Knowledge graph 'test_self_cmp' created.
Switched to knowledge graph: test_self_cmp
> .kg use test_self_cmp
Switched to knowledge graph: test_self_cmp
> +scores[(1, 85), (2, 90), (3, 75), (4, 90)].
Inserted 4 fact(s) into 'scores'.
> higher(Id1, Id2, S1, S2) :- scores(Id1, S1), scores(Id2, S2), Id1 < Id2, S1 < S2.
3 rows:
  (1, 2, 85, 90)
  (1, 4, 85, 90)
  (3, 4, 75, 90)
(session: 1 rule(s))
> ?- higher(Id1, Id2, S1, S2).
3 rows:
  (1, 2, 85, 90)
  (1, 4, 85, 90)
  (3, 4, 75, 90)
> same_score(Id1, Id2, S) :- scores(Id1, S), scores(Id2, S), Id1 < Id2.
1 rows:
  (2, 4, 90)
(session: 2 rule(s))
> ?- same_score(Id1, Id2, S).
1 rows:
  (2, 4, 90)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_self_cmp
Knowledge graph 'test_self_cmp' dropped.
