Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_running_n18t33
Knowledge graph 'test_running_n18t33' created.
Switched to knowledge graph: test_running_n18t33
> .kg use test_running_n18t33
Switched to knowledge graph: test_running_n18t33
> +ordered_vals[(1, 10), (2, 20), (3, 30), (4, 40)]
Inserted 4 fact(s) into 'ordered_vals'.
> +running_sum(Id, sum<Val>) <- ordered_vals(I, Val), I <= Id, ordered_vals(Id, _)
Rule 'running_sum' registered.
> ?running_sum(Id, Sum)
┌────┬─────┐
│ Id │ Sum │
├────┼─────┤
│  1 │  10 │
│  2 │  30 │
│  3 │  60 │
│  4 │ 100 │
└────┴─────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_running_n18t33
Knowledge graph 'test_running_n18t33' dropped.
