Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bom_n18t36
Knowledge graph 'test_bom_n18t36' created.
Switched to knowledge graph: test_bom_n18t36
> .kg use test_bom_n18t36
Switched to knowledge graph: test_bom_n18t36
> +component[("car", "engine", 1), ("car", "wheel", 4), ("engine", "piston", 4), ("engine", "sparkplug", 4)]
Inserted 4 fact(s) into 'component'.
> +all_parts(Product, Part, Qty) <- component(Product, Part, Qty)
Rule 'all_parts' registered.
> +all_parts(Product, SubPart, TotalQty) <- component(Product, Part, Q1), all_parts(Part, SubPart, Q2), TotalQty = Q1 * Q2
Rule 'all_parts' registered.
> ?all_parts("car", Part, Qty)
┌───────┬─────────────┬─────┐
│ car   │ Part        │ Qty │
├───────┼─────────────┼─────┤
│ "car" │ "engine"    │   1 │
│ "car" │ "piston"    │   4 │
│ "car" │ "sparkplug" │   4 │
│ "car" │ "wheel"     │   4 │
└───────┴─────────────┴─────┘
4 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_bom_n18t36
Knowledge graph 'test_bom_n18t36' dropped.
