Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_distinct_n18t38
Knowledge graph 'test_distinct_n18t38' created.
Switched to knowledge graph: test_distinct_n18t38
> .kg use test_distinct_n18t38
Switched to knowledge graph: test_distinct_n18t38
> +purchases[(1, "Alice", "Widget"), (2, "Bob", "Gadget"), (3, "Alice", "Widget"), (4, "Carol", "Widget")]
Inserted 4 fact(s) into 'purchases'.
> +distinct_products(count_distinct<Product>) <- purchases(_, _, Product)
Rule 'distinct_products' registered.
> ?distinct_products(N)
┌──────┐
│ col0 │
├──────┤
│    2 │
└──────┘
1 rows
> +distinct_customers(count_distinct<Customer>) <- purchases(_, Customer, _)
Rule 'distinct_customers' registered.
> ?distinct_customers(N)
┌──────┐
│ col0 │
├──────┤
│    3 │
└──────┘
1 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_distinct_n18t38
Knowledge graph 'test_distinct_n18t38' dropped.
