Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lead_lag_n18t39
Knowledge graph 'test_lead_lag_n18t39' created.
Switched to knowledge graph: test_lead_lag_n18t39
> .kg use test_lead_lag_n18t39
Switched to knowledge graph: test_lead_lag_n18t39
> +time_series[(1, 100), (2, 110), (3, 105), (4, 120)]
Inserted 4 fact(s) into 'time_series'.
> lag(T, Val, PrevVal) <- time_series(T, Val), T1 = T - 1, time_series(T1, PrevVal)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │  100 │  100 │
│    1 │  100 │  105 │
│    1 │  100 │  110 │
│    1 │  100 │  120 │
│    2 │  110 │  100 │
│    2 │  110 │  105 │
│    2 │  110 │  110 │
│    2 │  110 │  120 │
│    3 │  105 │  100 │
│    3 │  105 │  105 │
│    3 │  105 │  110 │
│    3 │  105 │  120 │
│    4 │  120 │  100 │
│    4 │  120 │  105 │
│    4 │  120 │  110 │
│    4 │  120 │  120 │
└──────┴──────┴──────┘
16 rows
(session: 1 rule(s))
> ?lag(T, Val, PrevVal)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │  100 │  100 │
│    1 │  100 │  105 │
│    1 │  100 │  110 │
│    1 │  100 │  120 │
│    2 │  110 │  100 │
│    2 │  110 │  105 │
│    2 │  110 │  110 │
│    2 │  110 │  120 │
│    3 │  105 │  100 │
│    3 │  105 │  105 │
│    3 │  105 │  110 │
│    3 │  105 │  120 │
│    4 │  120 │  100 │
│    4 │  120 │  105 │
│    4 │  120 │  110 │
│    4 │  120 │  120 │
└──────┴──────┴──────┘
16 rows
> lead(T, Val, NextVal) <- time_series(T, Val), T1 = T + 1, time_series(T1, NextVal)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │  100 │  100 │
│    1 │  100 │  105 │
│    1 │  100 │  110 │
│    1 │  100 │  120 │
│    2 │  110 │  100 │
│    2 │  110 │  105 │
│    2 │  110 │  110 │
│    2 │  110 │  120 │
│    3 │  105 │  100 │
│    3 │  105 │  105 │
│    3 │  105 │  110 │
│    3 │  105 │  120 │
│    4 │  120 │  100 │
│    4 │  120 │  105 │
│    4 │  120 │  110 │
│    4 │  120 │  120 │
└──────┴──────┴──────┘
16 rows
(session: 2 rule(s))
> ?lead(T, Val, NextVal)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │  100 │  100 │
│    1 │  100 │  105 │
│    1 │  100 │  110 │
│    1 │  100 │  120 │
│    2 │  110 │  100 │
│    2 │  110 │  105 │
│    2 │  110 │  110 │
│    2 │  110 │  120 │
│    3 │  105 │  100 │
│    3 │  105 │  105 │
│    3 │  105 │  110 │
│    3 │  105 │  120 │
│    4 │  120 │  100 │
│    4 │  120 │  105 │
│    4 │  120 │  110 │
│    4 │  120 │  120 │
└──────┴──────┴──────┘
16 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_lead_lag_n18t39
Knowledge graph 'test_lead_lag_n18t39' dropped.
