Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_islands_n18t40
Knowledge graph 'test_islands_n18t40' created.
Switched to knowledge graph: test_islands_n18t40
> .kg use test_islands_n18t40
Switched to knowledge graph: test_islands_n18t40
> +events[(1, "A"), (2, "A"), (3, "B"), (4, "B"), (5, "B"), (6, "A")]
Inserted 6 fact(s) into 'events'.
> island_start(T, Val) <- events(T, Val), T1 = T - 1, events(T1, PrevVal), Val != PrevVal
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ "A" │
│ 2 │ "A" │
│ 3 │ "B" │
│ 4 │ "B" │
│ 5 │ "B" │
│ 6 │ "A" │
└───┴─────┘
6 rows
(session: 1 rule(s))
> island_start(T, Val) <- events(T, Val), T = 1
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ "A" │
│ 2 │ "A" │
│ 3 │ "B" │
│ 4 │ "B" │
│ 5 │ "B" │
│ 6 │ "A" │
└───┴─────┘
6 rows
(session: 2 rule(s))
> ?island_start(T, Val)
┌───┬─────┐
│ T │ Val │
├───┼─────┤
│ 1 │ "A" │
│ 2 │ "A" │
│ 3 │ "B" │
│ 4 │ "B" │
│ 5 │ "B" │
│ 6 │ "A" │
└───┴─────┘
6 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_islands_n18t40
Knowledge graph 'test_islands_n18t40' dropped.
