Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cube_n18t43
Knowledge graph 'test_cube_n18t43' created.
Switched to knowledge graph: test_cube_n18t43
> .kg use test_cube_n18t43
Switched to knowledge graph: test_cube_n18t43
> +sales[("East", "Q1", 100), ("East", "Q2", 150), ("West", "Q1", 200), ("West", "Q2", 250)].
Inserted 4 fact(s) into 'sales'.
> +by_region(Region, sum<Amount>) :- sales(Region, _, Amount).
Rule 'by_region' registered.
> +by_quarter(Quarter, sum<Amount>) :- sales(_, Quarter, Amount).
Rule 'by_quarter' registered.
> +grand_total(sum<Amount>) :- sales(_, _, Amount).
Rule 'grand_total' registered.
> ?- by_region(Region, Sum).
2 rows:
  ("East", 250)
  ("West", 450)
> ?- by_quarter(Quarter, Sum).
2 rows:
  ("Q1", 300)
  ("Q2", 400)
> ?- grand_total(Total).
1 rows:
  (700)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_cube_n18t43
Knowledge graph 'test_cube_n18t43' dropped.
