Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ratio
Knowledge graph 'test_ratio' created.
Switched to knowledge graph: test_ratio
> .kg use test_ratio
Switched to knowledge graph: test_ratio
> +metrics[("visits", 1000), ("clicks", 100), ("purchases", 10)].
Inserted 3 fact(s) into 'metrics'.
> visits(V) :- metrics("visits", V).
1 rows:
  (1000)
(session: 1 rule(s))
> clicks(C) :- metrics("clicks", C).
1 rows:
  (100)
(session: 2 rule(s))
> purchases(P) :- metrics("purchases", P).
1 rows:
  (10)
(session: 3 rule(s))
> ?- visits(V).
1 rows:
  (1000)
> ?- clicks(C).
1 rows:
  (100)
> ?- purchases(P).
1 rows:
  (10)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_ratio
Knowledge graph 'test_ratio' dropped.
