Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_moving_avg_n18t46
Knowledge graph 'test_moving_avg_n18t46' created.
Switched to knowledge graph: test_moving_avg_n18t46
> .kg use test_moving_avg_n18t46
Switched to knowledge graph: test_moving_avg_n18t46
> +time_series[(1, 10), (2, 20), (3, 15), (4, 25), (5, 30)].
Inserted 5 fact(s) into 'time_series'.
> +avg_2(T, avg<V>) :- time_series(T2, V), T2 >= T - 1, T2 <= T, time_series(T, _).
Rule 'avg_2' registered.
> ?- avg_2(T, Avg).
5 rows:
  (1, 10.0)
  (2, 15.0)
  (3, 17.5)
  (4, 20.0)
  (5, 27.5)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_moving_avg_n18t46
Knowledge graph 'test_moving_avg_n18t46' dropped.
