Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_first_last_n18t48
Knowledge graph 'test_first_last_n18t48' created.
Switched to knowledge graph: test_first_last_n18t48
> .kg use test_first_last_n18t48
Switched to knowledge graph: test_first_last_n18t48
> +events[(1, "start", 100), (2, "middle", 200), (3, "end", 300)]
Inserted 3 fact(s) into 'events'.
> +first_time(min<T>) <- events(T, _, _)
Rule 'first_time' registered.
> first_event(Event, Val) <- events(T, Event, Val), first_time(T)
┌─────────┬─────┐
│ X       │ Y   │
├─────────┼─────┤
│ "start" │ 100 │
└─────────┴─────┘
1 rows
(session: 1 rule(s))
> ?first_event(Event, Val)
┌─────────┬─────┐
│ Event   │ Val │
├─────────┼─────┤
│ "start" │ 100 │
└─────────┴─────┘
1 rows
> +last_time(max<T>) <- events(T, _, _)
Rule 'last_time' registered.
> last_event(Event, Val) <- events(T, Event, Val), last_time(T)
┌───────┬─────┐
│ X     │ Y   │
├───────┼─────┤
│ "end" │ 300 │
└───────┴─────┘
1 rows
(session: 2 rule(s))
> ?last_event(Event, Val)
┌───────┬─────┐
│ Event │ Val │
├───────┼─────┤
│ "end" │ 300 │
└───────┴─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_first_last_n18t48
Knowledge graph 'test_first_last_n18t48' dropped.
