Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_components_n18t50
Knowledge graph 'test_components_n18t50' created.
Switched to knowledge graph: test_components_n18t50
> .kg use test_components_n18t50
Switched to knowledge graph: test_components_n18t50
> +edge[(1, 2), (2, 3), (4, 5), (6, 7), (7, 8)]
Inserted 5 fact(s) into 'edge'.
> +connected(A, B) <- edge(A, B)
Rule 'connected' registered.
> +connected(A, B) <- edge(B, A)
Rule 'connected' registered.
> +same_component(A, B) <- connected(A, B)
Rule 'same_component' registered.
> +same_component(A, B) <- same_component(A, C), connected(C, B)
Rule 'same_component' registered.
> ?same_component(1, X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    1 │
│    1 │    2 │
│    1 │    3 │
└──────┴──────┘
3 rows
> ?same_component(4, X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    4 │    4 │
│    4 │    5 │
└──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_components_n18t50
Knowledge graph 'test_components_n18t50' dropped.
