Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_weighted_n18t51
Knowledge graph 'test_weighted_n18t51' created.
Switched to knowledge graph: test_weighted_n18t51
> .kg use test_weighted_n18t51
Switched to knowledge graph: test_weighted_n18t51
> +edge[(1, 2, 10), (2, 3, 20), (1, 3, 50), (3, 4, 15)]
Inserted 4 fact(s) into 'edge'.
> +path_cost(A, B, C) <- edge(A, B, C)
Rule 'path_cost' registered.
> +path_cost(A, C, TotalCost) <- path_cost(A, B, C1), edge(B, C, C2), TotalCost = C1 + C2, TotalCost < 100
Rule 'path_cost' registered.
> ?path_cost(1, Dest, Cost)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    1 │    2 │   10 │
│    1 │    3 │   30 │
│    1 │    3 │   50 │
│    1 │    4 │   45 │
│    1 │    4 │   65 │
└──────┴──────┴──────┘
5 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_weighted_n18t51
Knowledge graph 'test_weighted_n18t51' dropped.
