Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_ntile_n18t52
Knowledge graph 'test_ntile_n18t52' created.
Switched to knowledge graph: test_ntile_n18t52
> .kg use test_ntile_n18t52
Switched to knowledge graph: test_ntile_n18t52
> +scores[(1, 100), (2, 85), (3, 92), (4, 78), (5, 88)]
Inserted 5 fact(s) into 'scores'.
> high(Id, Score) <- scores(Id, Score), Score >= 90
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 1 │ 100 │
│ 3 │  92 │
└───┴─────┘
2 rows
(session: 1 rule(s))
> medium(Id, Score) <- scores(Id, Score), Score >= 80, Score < 90
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 2 │ 85 │
│ 5 │ 88 │
└───┴────┘
2 rows
(session: 2 rule(s))
> low(Id, Score) <- scores(Id, Score), Score < 80
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 4 │ 78 │
└───┴────┘
1 rows
(session: 3 rule(s))
> ?high(Id, Score)
┌────┬───────┐
│ Id │ Score │
├────┼───────┤
│  1 │   100 │
│  3 │    92 │
└────┴───────┘
2 rows
> ?medium(Id, Score)
┌────┬───────┐
│ Id │ Score │
├────┼───────┤
│  2 │    85 │
│  5 │    88 │
└────┴───────┘
2 rows
> ?low(Id, Score)
┌────┬───────┐
│ Id │ Score │
├────┼───────┤
│  4 │    78 │
└────┴───────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_ntile_n18t52
Knowledge graph 'test_ntile_n18t52' dropped.
