Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_dense_rank_n18t54
Knowledge graph 'test_dense_rank_n18t54' created.
Switched to knowledge graph: test_dense_rank_n18t54
> .kg use test_dense_rank_n18t54
Switched to knowledge graph: test_dense_rank_n18t54
> +scores[("A", 100), ("B", 90), ("C", 100), ("D", 85)].
Inserted 4 fact(s) into 'scores'.
> +distinct_scores(min<Score>) :- scores(_, Score).
Rule 'distinct_scores' registered.
> +dense_rank(Name, Score, <COUNT_DISTINCT:Higher>) :- scores(Name, Score), scores(_, Higher), Higher > Score.
Rule 'dense_rank' registered.
> ?- dense_rank(Name, Score, Rank).
2 rows:
  ("B", 90, 1)
  ("D", 85, 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_dense_rank_n18t54
Knowledge graph 'test_dense_rank_n18t54' dropped.
