Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_window_cnt_n18t60
Knowledge graph 'test_window_cnt_n18t60' created.
Switched to knowledge graph: test_window_cnt_n18t60
> .kg use test_window_cnt_n18t60
Switched to knowledge graph: test_window_cnt_n18t60
> +sales[("Q1", "A", 100), ("Q1", "B", 150), ("Q1", "C", 120), ("Q2", "A", 200), ("Q2", "B", 180)]
Inserted 5 fact(s) into 'sales'.
> position(Q, Name, Val, count<N2>) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> sales(Q, Name, Val),
Parse error: Expected parentheses: (Q, Name, Val),
> sales(Q, N2, V2),
Parse error: Expected parentheses: (Q, N2, V2),
> V2 < Val
Parse error: Unrecognized statement: V2 < Val
> ?position(Q, Name, Val, Pos)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_window_cnt_n18t60
Knowledge graph 'test_window_cnt_n18t60' dropped.
