Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_window_cnt_n18t60
Knowledge graph 'test_window_cnt_n18t60' created.
Switched to knowledge graph: test_window_cnt_n18t60
> .kg use test_window_cnt_n18t60
Switched to knowledge graph: test_window_cnt_n18t60
> +sales[("Q1", "A", 100), ("Q1", "B", 150), ("Q1", "C", 120), ("Q2", "A", 200), ("Q2", "B", 180)].
Inserted 5 fact(s) into 'sales'.
> position(Q, Name, Val, count<N2>) :- sales(Q, Name, Val), sales(Q, N2, V2), V2 < Val.
3 rows:
  ("Q1", "B", 150, 2)
  ("Q1", "C", 120, 1)
  ("Q2", "A", 200, 1)
(session: 1 rule(s))
> ?- position(Q, Name, Val, Pos).
3 rows:
  ("Q1", "B", 150, 2)
  ("Q1", "C", 120, 1)
  ("Q2", "A", 200, 1)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_window_cnt_n18t60
Knowledge graph 'test_window_cnt_n18t60' dropped.
