Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_first_last_n18t62
Knowledge graph 'test_first_last_n18t62' created.
Switched to knowledge graph: test_first_last_n18t62
> .kg use test_first_last_n18t62
Switched to knowledge graph: test_first_last_n18t62
> +events[(1, "A", "start"), (2, "A", "middle"), (3, "A", "end"), (1, "B", "only")].
Inserted 4 fact(s) into 'events'.
> first_per_group(Group, min<Id>) :- events(Id, Group, _).
2 rows:
  ("A", 1)
  ("B", 1)
(session: 1 rule(s))
> last_per_group(Group, max<Id>) :- events(Id, Group, _).
2 rows:
  ("A", 3)
  ("B", 1)
(session: 2 rule(s))
> ?- first_per_group(Group, FirstId).
2 rows:
  ("A", 1)
  ("B", 1)
> ?- last_per_group(Group, LastId).
2 rows:
  ("A", 3)
  ("B", 1)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_first_last_n18t62
Knowledge graph 'test_first_last_n18t62' dropped.
