Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_gaps_n18t65
Knowledge graph 'test_gaps_n18t65' created.
Switched to knowledge graph: test_gaps_n18t65
> .kg use test_gaps_n18t65
Switched to knowledge graph: test_gaps_n18t65
> +ids[(1,), (2,), (4,), (5,), (8,)]
Inserted 5 fact(s) into 'ids'.
> has_gap_after(X) <- ids(X), ids(Y), Y > X,
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
│    4 │
│    5 │
└──────┘
4 rows
(session: 1 rule(s))
> Y = X + 1
Script error: Parse error: Unrecognized statement: Y = X + 1
