Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_gaps_n18t65
Knowledge graph 'test_gaps_n18t65' created.
Switched to knowledge graph: test_gaps_n18t65
> .kg use test_gaps_n18t65
Switched to knowledge graph: test_gaps_n18t65
> +ids[(1,), (2,), (4,), (5,), (8,)].
Inserted 5 fact(s) into 'ids'.
> has_gap_after(X) :- ids(X), ids(Y), Y > X, Y = X + 1.
4 rows:
  (1)
  (2)
  (4)
  (5)
(session: 1 rule(s))
> gap_after(X) :- ids(X), !has_gap_after(X), ids(Y), Y > X.
No results.
(session: 2 rule(s))
> ?- gap_after(X).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_gaps_n18t65
Knowledge graph 'test_gaps_n18t65' dropped.
