Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_pct_n18t70
Knowledge graph 'test_pct_n18t70' created.
Switched to knowledge graph: test_pct_n18t70
> .kg use test_pct_n18t70
Switched to knowledge graph: test_pct_n18t70
> +scores[(1, 50), (2, 60), (3, 70), (4, 80), (5, 90), (6, 100)].
Inserted 6 fact(s) into 'scores'.
> rank_position(Id, Score, count<S2>) :- scores(Id, Score), scores(_, S2), S2 < Score.
5 rows:
  (2, 60, 1)
  (3, 70, 2)
  (4, 80, 3)
  (5, 90, 4)
  (6, 100, 5)
(session: 1 rule(s))
> ?- rank_position(Id, Score, Rank).
5 rows:
  (2, 60, 1)
  (3, 70, 2)
  (4, 80, 3)
  (5, 90, 4)
  (6, 100, 5)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_pct_n18t70
Knowledge graph 'test_pct_n18t70' dropped.
