Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_moving_n18t72
Knowledge graph 'test_moving_n18t72' created.
Switched to knowledge graph: test_moving_n18t72
> .kg use test_moving_n18t72
Switched to knowledge graph: test_moving_n18t72
> +timeseries[(1, 10), (2, 20), (3, 15), (4, 25), (5, 30)].
Inserted 5 fact(s) into 'timeseries'.
> moving_sum(T, V, sum<V2>) :- timeseries(T, V), timeseries(T2, V2), T2 >= T - 1, T2 <= T.
5 rows:
  (1, 10, 10)
  (2, 20, 30)
  (3, 15, 35)
  (4, 25, 40)
  (5, 30, 55)
(session: 1 rule(s))
> ?- moving_sum(T, V, S).
5 rows:
  (1, 10, 10)
  (2, 20, 30)
  (3, 15, 35)
  (4, 25, 40)
  (5, 30, 55)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_moving_n18t72
Knowledge graph 'test_moving_n18t72' dropped.
