Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_lookup_n18t75
Knowledge graph 'test_lookup_n18t75' created.
Switched to knowledge graph: test_lookup_n18t75
> .kg use test_lookup_n18t75
Switched to knowledge graph: test_lookup_n18t75
> +orders[(1, 101, 2), (2, 102, 1), (3, 101, 3)].
Inserted 3 fact(s) into 'orders'.
> +products[(101, "Widget", 10.00), (102, "Gadget", 25.00)].
Inserted 2 fact(s) into 'products'.
> order_details(OId, ProdName, Qty, Total) :- orders(OId, ProdId, Qty), products(ProdId, ProdName, Price), Total = Price * Qty.
3 rows:
  (1, "Widget", 2, 20.0)
  (2, "Gadget", 1, 25.0)
  (3, "Widget", 3, 30.0)
(session: 1 rule(s))
> ?- order_details(OId, ProdName, Qty, Total).
3 rows:
  (1, "Widget", 2, 20.0)
  (2, "Gadget", 1, 25.0)
  (3, "Widget", 3, 30.0)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_lookup_n18t75
Knowledge graph 'test_lookup_n18t75' dropped.
