Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_lookup_n18t75
Knowledge graph 'test_lookup_n18t75' created.
Switched to knowledge graph: test_lookup_n18t75
> .kg use test_lookup_n18t75
Switched to knowledge graph: test_lookup_n18t75
> +orders[(1, 101, 2), (2, 102, 1), (3, 101, 3)]
Inserted 3 fact(s) into 'orders'.
> +products[(101, "Widget", 10.00), (102, "Gadget", 25.00)]
Inserted 2 fact(s) into 'products'.
> order_details(OId, ProdName, Qty, Total) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> orders(OId, ProdId, Qty),
Parse error: Expected parentheses: (OId, ProdId, Qty),
> products(ProdId, ProdName, Price),
Parse error: Expected parentheses: (ProdId, ProdName, Price),
> Total = Price * Qty
Parse error: Unrecognized statement: Total = Price * Qty
> ?order_details(OId, ProdName, Qty, Total)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_lookup_n18t75
Knowledge graph 'test_lookup_n18t75' dropped.
