Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_self_join
Knowledge graph 'test_self_join' created.
Switched to knowledge graph: test_self_join
> .kg use test_self_join
Switched to knowledge graph: test_self_join
> +friends[("Alice", "Bob"), ("Bob", "Carol"), ("Carol", "Dave"), ("Alice", "Carol")].
Inserted 4 fact(s) into 'friends'.
> friends_of_friends(A, C) :- friends(A, B), friends(B, C), A != C.
3 rows:
  ("Alice", "Carol")
  ("Alice", "Dave")
  ("Bob", "Dave")
(session: 1 rule(s))
> ?- friends_of_friends(A, C).
3 rows:
  ("Alice", "Carol")
  ("Alice", "Dave")
  ("Bob", "Dave")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_self_join
Knowledge graph 'test_self_join' dropped.
