Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_triangle_n18t81
Knowledge graph 'test_triangle_n18t81' created.
Switched to knowledge graph: test_triangle_n18t81
> .kg use test_triangle_n18t81
Switched to knowledge graph: test_triangle_n18t81
> +edge[("a", "b"), ("b", "c"), ("c", "a"), ("a", "d"), ("d", "e")].
Inserted 5 fact(s) into 'edge'.
> triangle(A, B, C) :- edge(A, B), edge(B, C), edge(C, A), A < B, B < C.
No results.
(session: 1 rule(s))
> ?- triangle(A, B, C).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_triangle_n18t81
Knowledge graph 'test_triangle_n18t81' dropped.
