Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bipartite
Knowledge graph 'test_bipartite' created.
Switched to knowledge graph: test_bipartite
> .kg use test_bipartite
Switched to knowledge graph: test_bipartite
> +nodes[(1, "typeA"), (2, "typeB"), (3, "typeA"), (4, "typeB")].
Inserted 4 fact(s) into 'nodes'.
> +edges[(1, 2), (2, 3), (3, 4)].
Inserted 3 fact(s) into 'edges'.
> same_type_edge(A, B) :- edges(A, B), nodes(A, TypeA), nodes(B, TypeB), TypeA = TypeB.
No results.
(session: 1 rule(s))
> ?- same_type_edge(A, B).
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_bipartite
Knowledge graph 'test_bipartite' dropped.
