Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bipartite_n18t86
Knowledge graph 'test_bipartite_n18t86' created.
Switched to knowledge graph: test_bipartite_n18t86
> .kg use test_bipartite_n18t86
Switched to knowledge graph: test_bipartite_n18t86
> +nodes[(1, "typeA"), (2, "typeB"), (3, "typeA"), (4, "typeB")]
Inserted 4 fact(s) into 'nodes'.
> +edges[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edges'.
> same_type_edge(A, B) <-
Parse error: Empty rule body with head variables is not allowed. Use 'foo(constant).' for facts, or add body predicates.
> edges(A, B),
Parse error: Expected parentheses: (A, B),
> nodes(A, TypeA),
Parse error: Expected parentheses: (A, TypeA),
> nodes(B, TypeB),
Parse error: Expected parentheses: (B, TypeB),
> TypeA = TypeB
Parse error: Unrecognized statement: TypeA = TypeB
> ?same_type_edge(A, B)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_bipartite_n18t86
Knowledge graph 'test_bipartite_n18t86' dropped.
