Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_cross
Knowledge graph 'test_cross' created.
Switched to knowledge graph: test_cross
> .kg use test_cross
Switched to knowledge graph: test_cross
> +colors[("red",), ("blue",)].
Inserted 2 fact(s) into 'colors'.
> +sizes[("S",), ("M",), ("L",)].
Inserted 3 fact(s) into 'sizes'.
> combinations(Color, Size) :- colors(Color), sizes(Size).
6 rows:
  ("blue", "L")
  ("blue", "M")
  ("blue", "S")
  ("red", "L")
  ("red", "M")
  ("red", "S")
(session: 1 rule(s))
> ?- combinations(Color, Size).
6 rows:
  ("blue", "L")
  ("blue", "M")
  ("blue", "S")
  ("red", "L")
  ("red", "M")
  ("red", "S")
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_cross
Knowledge graph 'test_cross' dropped.
