Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_pivot_simple_n18t96
Knowledge graph 'test_pivot_simple_n18t96' created.
Switched to knowledge graph: test_pivot_simple_n18t96
> .kg use test_pivot_simple_n18t96
Switched to knowledge graph: test_pivot_simple_n18t96
> +metrics[(1, "sales", 100), (1, "cost", 60), (2, "sales", 200), (2, "cost", 120)]
Inserted 4 fact(s) into 'metrics'.
> sales_by_id(Id, Val) <- metrics(Id, "sales", Val)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │  100 │
│    2 │  200 │
└──────┴──────┘
2 rows
(session: 1 rule(s))
> cost_by_id(Id, Val) <- metrics(Id, "cost", Val)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │   60 │
│    2 │  120 │
└──────┴──────┘
2 rows
(session: 2 rule(s))
> ?sales_by_id(Id, Val)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │  100 │
│    2 │  200 │
└──────┴──────┘
2 rows
> ?cost_by_id(Id, Val)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │   60 │
│    2 │  120 │
└──────┴──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_pivot_simple_n18t96
Knowledge graph 'test_pivot_simple_n18t96' dropped.
