Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_unpivot_n18t97
Knowledge graph 'test_unpivot_n18t97' created.
Switched to knowledge graph: test_unpivot_n18t97
> .kg use test_unpivot_n18t97
Switched to knowledge graph: test_unpivot_n18t97
> +wide_data[(1, 10, 20, 30)].
Inserted 1 fact(s) into 'wide_data'.
> long_data(Id, "col1", V) :- wide_data(Id, V, _, _).
1 rows:
  (1, "col1", 10)
(session: 1 rule(s))
> long_data(Id, "col2", V) :- wide_data(Id, _, V, _).
2 rows:
  (1, "col1", 10)
  (1, "col2", 20)
(session: 2 rule(s))
> long_data(Id, "col3", V) :- wide_data(Id, _, _, V).
3 rows:
  (1, "col1", 10)
  (1, "col2", 20)
  (1, "col3", 30)
(session: 3 rule(s))
> ?- long_data(Id, Col, Val).
3 rows:
  (1, "col1", 10)
  (1, "col2", 20)
  (1, "col3", 30)
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_unpivot_n18t97
Knowledge graph 'test_unpivot_n18t97' dropped.
