Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_unpivot_n18t97
Knowledge graph 'test_unpivot_n18t97' created.
Switched to knowledge graph: test_unpivot_n18t97
> .kg use test_unpivot_n18t97
Switched to knowledge graph: test_unpivot_n18t97
> +wide_data[(1, 10, 20, 30)]
Inserted 1 fact(s) into 'wide_data'.
> long_data(Id, "col1", V) <- wide_data(Id, V, _, _)
┌───┬────────┬────┐
│ X │ Y      │ Z  │
├───┼────────┼────┤
│ 1 │ "col1" │ 10 │
└───┴────────┴────┘
1 rows
(session: 1 rule(s))
> long_data(Id, "col2", V) <- wide_data(Id, _, V, _)
┌───┬────────┬────┐
│ X │ Y      │ Z  │
├───┼────────┼────┤
│ 1 │ "col1" │ 10 │
│ 1 │ "col2" │ 20 │
└───┴────────┴────┘
2 rows
(session: 2 rule(s))
> long_data(Id, "col3", V) <- wide_data(Id, _, _, V)
┌───┬────────┬────┐
│ X │ Y      │ Z  │
├───┼────────┼────┤
│ 1 │ "col1" │ 10 │
│ 1 │ "col2" │ 20 │
│ 1 │ "col3" │ 30 │
└───┴────────┴────┘
3 rows
(session: 3 rule(s))
> ?long_data(Id, Col, Val)
┌────┬────────┬─────┐
│ Id │ Col    │ Val │
├────┼────────┼─────┤
│  1 │ "col1" │  10 │
│  1 │ "col2" │  20 │
│  1 │ "col3" │  30 │
└────┴────────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_unpivot_n18t97
Knowledge graph 'test_unpivot_n18t97' dropped.
