Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_type_alias
Knowledge graph 'test_type_alias' created.
Switched to knowledge graph: test_type_alias
> .kg use test_type_alias
Switched to knowledge graph: test_type_alias
> type Email: string.
Type 'Email' declared (local only).
> type UserId: int.
Type 'UserId' declared (local only).
> type Score: int.
Type 'Score' declared (local only).
> +users(id: UserId, email: Email, score: Score).
Schema 'users' declared (persistent).
> +users[(1, "alice@example.com", 100), (2, "bob@example.com", 85)].
Inserted 2 fact(s) into 'users'.
> ?- users(X, Y, Z).
2 rows:
  (1, "alice@example.com", 100)
  (2, "bob@example.com", 85)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_type_alias
Knowledge graph 'test_type_alias' dropped.
