Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_record_type
Knowledge graph 'test_record_type' created.
Switched to knowledge graph: test_record_type
> .kg use test_record_type
Switched to knowledge graph: test_record_type
> type User: { id: int, name: string }.
Type 'User' declared (local only).
> +user(id: int, name: string).
Schema 'user' declared (persistent).
> +user[(1, "Alice"), (2, "Bob"), (3, "Charlie")].
Inserted 3 fact(s) into 'user'.
> ?- user(X, Y).
3 rows:
  (1, "Alice")
  (2, "Bob")
  (3, "Charlie")
> .kg use default
Switched to knowledge graph: default
> .kg drop test_record_type
Knowledge graph 'test_record_type' dropped.
