Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_multi_types
Knowledge graph 'test_multi_types' created.
Switched to knowledge graph: test_multi_types
> .kg use test_multi_types
Switched to knowledge graph: test_multi_types
> type ProductId: int.
Type 'ProductId' declared (local only).
> type Price: int.
Type 'Price' declared (local only).
> type Quantity: int.
Type 'Quantity' declared (local only).
> type ProductName: string.
Type 'ProductName' declared (local only).
> +products(id: ProductId, name: ProductName, price: Price).
Schema 'products' declared (persistent).
> +inventory(product_id: ProductId, qty: Quantity).
Schema 'inventory' declared (persistent).
> +products[(1, "Widget", 100), (2, "Gadget", 200), (3, "Gizmo", 150)].
Inserted 3 fact(s) into 'products'.
> +inventory[(1, 50), (2, 30), (3, 75)].
Inserted 3 fact(s) into 'inventory'.
> ?- products(Id, Name, Price).
3 rows:
  (1, "Widget", 100)
  (2, "Gadget", 200)
  (3, "Gizmo", 150)
> ?- inventory(Pid, Qty).
3 rows:
  (1, 50)
  (2, 30)
  (3, 75)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_multi_types
Knowledge graph 'test_multi_types' dropped.
