Executing script: examples/datalog/23_type_declarations/03_multiple_types.dl

> .db create test_multi_types
Database 'test_multi_types' created.
Switched to database: test_multi_types
> .db use test_multi_types
Switched to database: test_multi_types
> type ProductId: int.
Type 'ProductId' declared.
> type Price: int.
Type 'Price' declared.
> type Quantity: int.
Type 'Quantity' declared.
> type ProductName: string.
Type 'ProductName' declared.
> rel products(id: ProductId, name: ProductName, price: Price).
Script error: Line 15: Parse error: Invalid relation name: 'rel products'
