Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_abs_int64_n32t01
Knowledge graph 'test_abs_int64_n32t01' created.
Switched to knowledge graph: test_abs_int64_n32t01
> .kg use test_abs_int64_n32t01
Switched to knowledge graph: test_abs_int64_n32t01
> +numbers[(1, 42)]
Inserted 1 fact(s) into 'numbers'.
> +numbers[(2, -42)]
Inserted 1 fact(s) into 'numbers'.
> +numbers[(3, 0)]
Inserted 1 fact(s) into 'numbers'.
> +numbers[(4, -1000)]
Inserted 1 fact(s) into 'numbers'.
> +numbers[(5, 1000)]
Inserted 1 fact(s) into 'numbers'.
> abs_result(Id, X, Absolute) <- numbers(Id, X), Absolute = abs_int64(X)
┌───┬───────┬──────┐
│ X │ Y     │ Z    │
├───┼───────┼──────┤
│ 1 │    42 │   42 │
│ 2 │   -42 │   42 │
│ 3 │     0 │    0 │
│ 4 │ -1000 │ 1000 │
│ 5 │  1000 │ 1000 │
└───┴───────┴──────┘
5 rows
(session: 1 rule(s))
> ?abs_result(Id, X, Absolute)
┌────┬───────┬──────────┐
│ Id │ X     │ Absolute │
├────┼───────┼──────────┤
│  1 │    42 │       42 │
│  2 │   -42 │       42 │
│  3 │     0 │        0 │
│  4 │ -1000 │     1000 │
│  5 │  1000 │     1000 │
└────┴───────┴──────────┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_abs_int64_n32t01
Knowledge graph 'test_abs_int64_n32t01' dropped.
