Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_math_combined
Knowledge graph 'test_math_combined' created.
Switched to knowledge graph: test_math_combined
> .kg use test_math_combined
Switched to knowledge graph: test_math_combined
> +coords[(1, 10, 20)].
Inserted 1 fact(s) into 'coords'.
> +coords[(2, -5, 15)].
Inserted 1 fact(s) into 'coords'.
> +coords[(3, 30, -10)].
Inserted 1 fact(s) into 'coords'.
> +coords[(4, -25, -30)].
Inserted 1 fact(s) into 'coords'.
> abs_x(Id, X, AbsX) :- coords(Id, X, _), AbsX = abs_int64(X).
4 rows:
  (1, 10, 10)
  (2, -5, 5)
  (3, 30, 30)
  (4, -25, 25)
(session: 1 rule(s))
> ?- abs_x(Id, X, AbsX).
4 rows:
  (1, 10, 10)
  (2, -5, 5)
  (3, 30, 30)
  (4, -25, 25)
> large_x(Id, X, Y) :- coords(Id, X, Y), X > 20.
1 rows:
  (3, 30, -10)
(session: 2 rule(s))
> ?- large_x(Id, X, Y).
1 rows:
  (3, 30, -10)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_math_combined
Knowledge graph 'test_math_combined' dropped.
