Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_math_combined_n32t03
Knowledge graph 'test_math_combined_n32t03' created.
Switched to knowledge graph: test_math_combined_n32t03
> .kg use test_math_combined_n32t03
Switched to knowledge graph: test_math_combined_n32t03
> +coords[(1, 10, 20)]
Inserted 1 fact(s) into 'coords'.
> +coords[(2, -5, 15)]
Inserted 1 fact(s) into 'coords'.
> +coords[(3, 30, -10)]
Inserted 1 fact(s) into 'coords'.
> +coords[(4, -25, -30)]
Inserted 1 fact(s) into 'coords'.
> abs_x(Id, X, AbsX) <- coords(Id, X, _), AbsX = abs_int64(X)
┌───┬─────┬────┐
│ X │ Y   │ Z  │
├───┼─────┼────┤
│ 1 │  10 │ 10 │
│ 2 │  -5 │  5 │
│ 3 │  30 │ 30 │
│ 4 │ -25 │ 25 │
└───┴─────┴────┘
4 rows
(session: 1 rule(s))
> ?abs_x(Id, X, AbsX)
┌────┬─────┬──────┐
│ Id │ X   │ AbsX │
├────┼─────┼──────┤
│  1 │  10 │   10 │
│  2 │  -5 │    5 │
│  3 │  30 │   30 │
│  4 │ -25 │   25 │
└────┴─────┴──────┘
4 rows
> large_x(Id, X, Y) <- coords(Id, X, Y), X > 20
┌───┬────┬─────┐
│ X │ Y  │ Z   │
├───┼────┼─────┤
│ 3 │ 30 │ -10 │
└───┴────┴─────┘
1 rows
(session: 2 rule(s))
> ?large_x(Id, X, Y)
┌────┬────┬─────┐
│ Id │ X  │ Y   │
├────┼────┼─────┤
│  3 │ 30 │ -10 │
└────┴────┴─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_math_combined_n32t03
Knowledge graph 'test_math_combined_n32t03' dropped.
