Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_abs_n32t05
Knowledge graph 'test_abs_n32t05' created.
Switched to knowledge graph: test_abs_n32t05
> .kg use test_abs_n32t05
Switched to knowledge graph: test_abs_n32t05
> +nums[(-5,), (-3,), (0,), (3,), (5,)]
Inserted 5 fact(s) into 'nums'.
> abs_val(X, Y) <- nums(X), Y = ABS(X)
┌────┬───┐
│ X  │ Y │
├────┼───┤
│ -5 │ 5 │
│ -3 │ 3 │
│  0 │ 0 │
│  3 │ 3 │
│  5 │ 5 │
└────┴───┘
5 rows
(session: 1 rule(s))
> ?abs_val(X, Y)
┌────┬───┐
│ X  │ Y │
├────┼───┤
│ -5 │ 5 │
│ -3 │ 3 │
│  0 │ 0 │
│  3 │ 3 │
│  5 │ 5 │
└────┴───┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_abs_n32t05
Knowledge graph 'test_abs_n32t05' dropped.
