Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_floor_ceil_n32t07
Knowledge graph 'test_floor_ceil_n32t07' created.
Switched to knowledge graph: test_floor_ceil_n32t07
> .kg use test_floor_ceil_n32t07
Switched to knowledge graph: test_floor_ceil_n32t07
> +nums[(1.2,), (1.8,), (2.5,), (-1.3,), (-1.7,)]
Inserted 5 fact(s) into 'nums'.
> floor_val(X, Y) <- nums(X), Y = FLOOR(X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│ -1.7 │   -2 │
│ -1.3 │   -2 │
│  1.2 │    1 │
│  1.8 │    1 │
│  2.5 │    2 │
└──────┴──────┘
5 rows
(session: 1 rule(s))
> ceil_val(X, Y) <- nums(X), Y = CEIL(X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│ -1.7 │   -1 │
│ -1.3 │   -1 │
│  1.2 │    2 │
│  1.8 │    2 │
│  2.5 │    3 │
└──────┴──────┘
5 rows
(session: 2 rule(s))
> ?floor_val(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│ -1.7 │   -2 │
│ -1.3 │   -2 │
│  1.2 │    1 │
│  1.8 │    1 │
│  2.5 │    2 │
└──────┴──────┘
5 rows
> ?ceil_val(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│ -1.7 │   -1 │
│ -1.3 │   -1 │
│  1.2 │    2 │
│  1.8 │    2 │
│  2.5 │    3 │
└──────┴──────┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_floor_ceil_n32t07
Knowledge graph 'test_floor_ceil_n32t07' dropped.
