Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_pow_n32t08
Knowledge graph 'test_pow_n32t08' created.
Switched to knowledge graph: test_pow_n32t08
> .kg use test_pow_n32t08
Switched to knowledge graph: test_pow_n32t08
> +base_exp[(2, 0), (2, 1), (2, 3), (3, 2), (10, 2)]
Inserted 5 fact(s) into 'base_exp'.
> power_val(B, E, R) <- base_exp(B, E), R = POW(B, E)
┌────┬───┬───────┐
│ X  │ Y │ Z     │
├────┼───┼───────┤
│  2 │ 0 │   1.0 │
│  2 │ 1 │   2.0 │
│  2 │ 3 │   8.0 │
│  3 │ 2 │   9.0 │
│ 10 │ 2 │ 100.0 │
└────┴───┴───────┘
5 rows
(session: 1 rule(s))
> ?power_val(B, E, R)
┌────┬───┬───────┐
│ B  │ E │ R     │
├────┼───┼───────┤
│  2 │ 0 │   1.0 │
│  2 │ 1 │   2.0 │
│  2 │ 3 │   8.0 │
│  3 │ 2 │   9.0 │
│ 10 │ 2 │ 100.0 │
└────┴───┴───────┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_pow_n32t08
Knowledge graph 'test_pow_n32t08' dropped.
