Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_log_n32t09
Knowledge graph 'test_log_n32t09' created.
Switched to knowledge graph: test_log_n32t09
> .kg use test_log_n32t09
Switched to knowledge graph: test_log_n32t09
> +nums[(1,), (10,), (100,)]
Inserted 3 fact(s) into 'nums'.
> log_val(X, Y) <- nums(X), Y = LOG(X)
┌─────┬───────────────────┐
│ X   │ Y                 │
├─────┼───────────────────┤
│   1 │               0.0 │
│  10 │ 2.302585092994046 │
│ 100 │ 4.605170185988092 │
└─────┴───────────────────┘
3 rows
(session: 1 rule(s))
> ?log_val(X, Y)
┌─────┬───────────────────┐
│ X   │ Y                 │
├─────┼───────────────────┤
│   1 │               0.0 │
│  10 │ 2.302585092994046 │
│ 100 │ 4.605170185988092 │
└─────┴───────────────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_log_n32t09
Knowledge graph 'test_log_n32t09' dropped.
