Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_trig_n32t10
Knowledge graph 'test_trig_n32t10' created.
Switched to knowledge graph: test_trig_n32t10
> .kg use test_trig_n32t10
Switched to knowledge graph: test_trig_n32t10
> +angles[(0,), (1,), (3.14159,)]
Inserted 3 fact(s) into 'angles'.
> sin_val(X, Y) <- angles(X), Y = SIN(X)
┌─────────┬─────────────────────┐
│ col0    │ col1                │
├─────────┼─────────────────────┤
│       0 │                 0.0 │
│       1 │  0.8414709848078965 │
│ 3.14159 │ 2.65358979335273e-6 │
└─────────┴─────────────────────┘
3 rows
(session: 1 rule(s))
> cos_val(X, Y) <- angles(X), Y = COS(X)
┌─────────┬─────────────────────┐
│ col0    │ col1                │
├─────────┼─────────────────────┤
│       0 │                 1.0 │
│       1 │  0.5403023058681398 │
│ 3.14159 │ -0.9999999999964791 │
└─────────┴─────────────────────┘
3 rows
(session: 2 rule(s))
> ?sin_val(X, Y)
┌─────────┬─────────────────────┐
│ col0    │ col1                │
├─────────┼─────────────────────┤
│       0 │                 0.0 │
│       1 │  0.8414709848078965 │
│ 3.14159 │ 2.65358979335273e-6 │
└─────────┴─────────────────────┘
3 rows
> ?cos_val(X, Y)
┌─────────┬─────────────────────┐
│ col0    │ col1                │
├─────────┼─────────────────────┤
│       0 │                 1.0 │
│       1 │  0.5403023058681398 │
│ 3.14159 │ -0.9999999999964791 │
└─────────┴─────────────────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_trig_n32t10
Knowledge graph 'test_trig_n32t10' dropped.
