Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_minmax_fn_n32t15
Knowledge graph 'test_minmax_fn_n32t15' created.
Switched to knowledge graph: test_minmax_fn_n32t15
> .kg use test_minmax_fn_n32t15
Switched to knowledge graph: test_minmax_fn_n32t15
> +pairs[(10, 20), (30, 15), (5, 5), (100, 50)].
Inserted 4 fact(s) into 'pairs'.
> min_of_pair(A, B, M) :- pairs(A, B), M = MIN(A, B).
4 rows:
  (5, 5, 5)
  (10, 20, 10)
  (30, 15, 15)
  (100, 50, 50)
(session: 1 rule(s))
> max_of_pair(A, B, M) :- pairs(A, B), M = MAX(A, B).
4 rows:
  (5, 5, 5)
  (10, 20, 20)
  (30, 15, 30)
  (100, 50, 100)
(session: 2 rule(s))
> ?- min_of_pair(A, B, M).
4 rows:
  (5, 5, 5)
  (10, 20, 10)
  (30, 15, 15)
  (100, 50, 50)
> ?- max_of_pair(A, B, M).
4 rows:
  (5, 5, 5)
  (10, 20, 20)
  (30, 15, 30)
  (100, 50, 100)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_minmax_fn_n32t15
Knowledge graph 'test_minmax_fn_n32t15' dropped.
