Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sign_n32t16
Knowledge graph 'test_sign_n32t16' created.
Switched to knowledge graph: test_sign_n32t16
> .kg use test_sign_n32t16
Switched to knowledge graph: test_sign_n32t16
> +nums[(-10,), (-1,), (0,), (1,), (10,)]
Inserted 5 fact(s) into 'nums'.
> sign_result(X, S) <- nums(X), S = SIGN(X)
┌─────┬────┐
│ X   │ Y  │
├─────┼────┤
│ -10 │ -1 │
│  -1 │ -1 │
│   0 │  0 │
│   1 │  1 │
│  10 │  1 │
└─────┴────┘
5 rows
(session: 1 rule(s))
> ?sign_result(X, S)
┌─────┬────┐
│ X   │ S  │
├─────┼────┤
│ -10 │ -1 │
│  -1 │ -1 │
│   0 │  0 │
│   1 │  1 │
│  10 │  1 │
└─────┴────┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_sign_n32t16
Knowledge graph 'test_sign_n32t16' dropped.
