Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_trig_full_n32t20
Knowledge graph 'test_trig_full_n32t20' created.
Switched to knowledge graph: test_trig_full_n32t20
> .kg use test_trig_full_n32t20
Switched to knowledge graph: test_trig_full_n32t20
> +angles[(0.0,), (1.0,), (1.5707963,)].
Inserted 3 fact(s) into 'angles'.
> sin_val(A, S) :- angles(A), S = SIN(A).
3 rows:
  (0.0, 0.0)
  (1.0, 0.8414709848078965)
  (1.5707963, 0.9999999999999996)
(session: 1 rule(s))
> cos_val(A, C) :- angles(A), C = COS(A).
3 rows:
  (0.0, 1.0)
  (1.0, 0.5403023058681398)
  (1.5707963, 2.6794896585028633e-8)
(session: 2 rule(s))
> ?- sin_val(A, S).
3 rows:
  (0.0, 0.0)
  (1.0, 0.8414709848078965)
  (1.5707963, 0.9999999999999996)
> ?- cos_val(A, C).
3 rows:
  (0.0, 1.0)
  (1.0, 0.5403023058681398)
  (1.5707963, 2.6794896585028633e-8)
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_trig_full_n32t20
Knowledge graph 'test_trig_full_n32t20' dropped.
