Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_exp_n32t21
Knowledge graph 'test_exp_n32t21' created.
Switched to knowledge graph: test_exp_n32t21
> .kg use test_exp_n32t21
Switched to knowledge graph: test_exp_n32t21
> +vals[(0,), (1,), (2,)]
Inserted 3 fact(s) into 'vals'.
> exp_val(X, Y) <- vals(X), Y = EXP(X)
┌───┬───────────────────┐
│ X │ Y                 │
├───┼───────────────────┤
│ 0 │               1.0 │
│ 1 │ 2.718281828459045 │
│ 2 │  7.38905609893065 │
└───┴───────────────────┘
3 rows
(session: 1 rule(s))
> ?exp_val(X, Y)
┌───┬───────────────────┐
│ X │ Y                 │
├───┼───────────────────┤
│ 0 │               1.0 │
│ 1 │ 2.718281828459045 │
│ 2 │  7.38905609893065 │
└───┴───────────────────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_exp_n32t21
Knowledge graph 'test_exp_n32t21' dropped.
