Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sqrt_n32t24
Knowledge graph 'test_sqrt_n32t24' created.
Switched to knowledge graph: test_sqrt_n32t24
> .kg use test_sqrt_n32t24
Switched to knowledge graph: test_sqrt_n32t24
> +nums[(0,), (1,), (4,), (9,), (16,)]
Inserted 5 fact(s) into 'nums'.
> sqrt_val(X, Y) <- nums(X), Y = SQRT(X)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    0 │  0.0 │
│    1 │  1.0 │
│    4 │  2.0 │
│    9 │  3.0 │
│   16 │  4.0 │
└──────┴──────┘
5 rows
(session: 1 rule(s))
> ?sqrt_val(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    0 │  0.0 │
│    1 │  1.0 │
│    4 │  2.0 │
│    9 │  3.0 │
│   16 │  4.0 │
└──────┴──────┘
5 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_sqrt_n32t24
Knowledge graph 'test_sqrt_n32t24' dropped.
