Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rounding_n32t25
Knowledge graph 'test_rounding_n32t25' created.
Switched to knowledge graph: test_rounding_n32t25
> .kg use test_rounding_n32t25
Switched to knowledge graph: test_rounding_n32t25
> +vals[(7,), (10,), (15,), (23,)]
Inserted 4 fact(s) into 'vals'.
> floor_div5(X, Y) <- vals(X), Y = X / 5
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│  7 │ 1.4 │
│ 10 │ 2.0 │
│ 15 │ 3.0 │
│ 23 │ 4.6 │
└────┴─────┘
4 rows
(session: 1 rule(s))
> ?floor_div5(X, Y)
┌────┬─────┐
│ X  │ Y   │
├────┼─────┤
│  7 │ 1.4 │
│ 10 │ 2.0 │
│ 15 │ 3.0 │
│ 23 │ 4.6 │
└────┴─────┘
4 rows
> mod5(X, Y) <- vals(X), Y = X % 5
┌────┬───┐
│ X  │ Y │
├────┼───┤
│  7 │ 2 │
│ 10 │ 0 │
│ 15 │ 0 │
│ 23 │ 3 │
└────┴───┘
4 rows
(session: 2 rule(s))
> ?mod5(X, Y)
┌────┬───┐
│ X  │ Y │
├────┼───┤
│  7 │ 2 │
│ 10 │ 0 │
│ 15 │ 0 │
│ 23 │ 3 │
└────┴───┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_rounding_n32t25
Knowledge graph 'test_rounding_n32t25' dropped.
