Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess
Knowledge graph 'test_sess' created.
Switched to knowledge graph: test_sess
> .kg use test_sess
Switched to knowledge graph: test_sess
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> path(X, Y) :- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
(session: 1 rule(s))
> path(X, Z) :- path(X, Y), edge(Y, Z).
6 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 3)
  (2, 4)
  (3, 4)
(session: 2 rule(s))
> .session
Session rules (2):
  1. path(X, Y) :- edge(X, Y).
  2. path(X, Z) :- path(X, Y), edge(Y, Z).
> ?- path(1, X).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> .session clear
Cleared 0 session fact(s), 2 session rule(s).
> .session
No session data defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess
Knowledge graph 'test_sess' dropped.
