Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_n04t01
Knowledge graph 'test_sess_n04t01' created.
Switched to knowledge graph: test_sess_n04t01
> .kg use test_sess_n04t01
Switched to knowledge graph: test_sess_n04t01
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> path(X, Y) <- edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
(session: 1 rule(s))
> path(X, Z) <- path(X, Y), edge(Y, Z)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
│ 2 │ 3 │
│ 2 │ 4 │
│ 3 │ 4 │
└───┴───┘
6 rows
(session: 2 rule(s))
> .session
Session rules (2):
  1. path(X, Y) <- edge(X, Y)
  2. path(X, Z) <- path(X, Y), edge(Y, Z)
> ?path(1, X)
┌───┬───┐
│ 1 │ X │
├───┼───┤
│ 1 │ 2 │
│ 1 │ 3 │
│ 1 │ 4 │
└───┴───┘
3 rows
> .session clear
Cleared 0 session fact(s), 2 session rule(s).
> .session
No session data defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_n04t01
Knowledge graph 'test_sess_n04t01' dropped.
