Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_sess_facts_n04t02
Knowledge graph 'test_sess_facts_n04t02' created.
Switched to knowledge graph: test_sess_facts_n04t02
> .kg use test_sess_facts_n04t02
Switched to knowledge graph: test_sess_facts_n04t02
> +edge(1, 2)
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3)
Inserted 1 fact(s) into 'edge'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
└───┴───┘
2 rows
> edge(100, 200)
Session fact added for 'edge'. (Use +edge(...) to persist)
> ?edge(X, Y)
┌─────┬─────┐
│ X   │ Y   │
├─────┼─────┤
│   1 │   2 │
│   2 │   3 │
│ 100 │ 200 │
└─────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 0 session rule(s), 1 session fact(s))
> .kg use test_sess_facts_n04t02
Switched to knowledge graph: test_sess_facts_n04t02
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
└───┴───┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_facts_n04t02
Knowledge graph 'test_sess_facts_n04t02' dropped.
