Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_rules_facts_n04t03
Knowledge graph 'test_sess_rules_facts_n04t03' created.
Switched to knowledge graph: test_sess_rules_facts_n04t03
> .kg use test_sess_rules_facts_n04t03
Switched to knowledge graph: test_sess_rules_facts_n04t03
> human("socrates").
Session fact added for 'human'. (Use +human(...) to persist)
> mortal(X) :- human(X).
1 rows:
  ("socrates")
(session: 1 rule(s))
> ?- mortal(X).
1 rows:
  ("socrates")
> .session
Session facts (1):
  1. human("socrates").
Session rules (1):
  1. mortal(X) :- human(X).
> human("plato").
Session fact added for 'human'. (Use +human(...) to persist)
> human("aristotle").
Session fact added for 'human'. (Use +human(...) to persist)
> ?- mortal(X).
3 rows:
  ("aristotle")
  ("plato")
  ("socrates")
> wise(X) :- mortal(X).
3 rows:
  ("aristotle")
  ("plato")
  ("socrates")
(session: 2 rule(s))
> ?- wise(X).
3 rows:
  ("aristotle")
  ("plato")
  ("socrates")
> .session clear
Cleared 3 session fact(s), 2 session rule(s).
> .session
No session data defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_rules_facts_n04t03
Knowledge graph 'test_sess_rules_facts_n04t03' dropped.
> .kg list
Knowledge Graphs:
  default *
