Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_persist_n04t04
Knowledge graph 'test_sess_persist_n04t04' created.
Switched to knowledge graph: test_sess_persist_n04t04
> .kg use test_sess_persist_n04t04
Switched to knowledge graph: test_sess_persist_n04t04
> +base[(1), (2), (3)].
Inserted 3 fact(s) into 'base'.
> +persistent_rule(X) :- base(X), X > 1.
Rule 'persistent_rule' registered.
> ?- persistent_rule(X).
2 rows:
  (2)
  (3)
> session_combo(X) :- persistent_rule(X), X < 3.
1 rows:
  (2)
(session: 1 rule(s))
> ?- session_combo(X).
1 rows:
  (2)
> .session clear
Cleared 0 session fact(s), 1 session rule(s).
> ?- persistent_rule(X).
2 rows:
  (2)
  (3)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_persist_n04t04
Knowledge graph 'test_sess_persist_n04t04' dropped.
