Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_iso1_n04t05
Knowledge graph 'test_sess_iso1_n04t05' created.
Switched to knowledge graph: test_sess_iso1_n04t05
> .kg use test_sess_iso1_n04t05
Switched to knowledge graph: test_sess_iso1_n04t05
> +data1[(1), (2)]
Inserted 2 fact(s) into 'data1'.
> sess_rule1(X) <- data1(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
└──────┘
2 rows
(session: 1 rule(s))
> ?sess_rule1(X)
┌──────┐
│ col0 │
├──────┤
│    1 │
│    2 │
└──────┘
2 rows
> .kg create test_sess_iso2_n04t05
Knowledge graph 'test_sess_iso2_n04t05' created.
Switched to knowledge graph: test_sess_iso2_n04t05
(Cleared 1 session rule(s), 0 session fact(s))
> .kg use test_sess_iso2_n04t05
Switched to knowledge graph: test_sess_iso2_n04t05
> +data2[(3), (4)]
Inserted 2 fact(s) into 'data2'.
> ?sess_rule1(X)
No results.
> sess_rule2(X) <- data2(X)
┌──────┐
│ col0 │
├──────┤
│    3 │
│    4 │
└──────┘
2 rows
(session: 1 rule(s))
> ?sess_rule2(X)
┌──────┐
│ col0 │
├──────┤
│    3 │
│    4 │
└──────┘
2 rows
> .kg use test_sess_iso1_n04t05
Switched to knowledge graph: test_sess_iso1_n04t05
(Cleared 1 session rule(s), 0 session fact(s))
> .session
No session data defined.
> ?sess_rule1(X)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_iso1_n04t05
Knowledge graph 'test_sess_iso1_n04t05' dropped.
> .kg drop test_sess_iso2_n04t05
Knowledge graph 'test_sess_iso2_n04t05' dropped.
