Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_shadow_n04t07
Knowledge graph 'test_shadow_n04t07' created.
Switched to knowledge graph: test_shadow_n04t07
> .kg use test_shadow_n04t07
Switched to knowledge graph: test_shadow_n04t07
> +items[(1, "a"), (2, "b"), (3, "c")]
Inserted 3 fact(s) into 'items'.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │ "a" │
│  2 │ "b" │
│  3 │ "c" │
└────┴─────┘
3 rows
> filtered(Id, Val) <- items(Id, Val), Id > 1
┌───┬─────┐
│ X │ Y   │
├───┼─────┤
│ 2 │ "b" │
│ 3 │ "c" │
└───┴─────┘
2 rows
(session: 1 rule(s))
> ?filtered(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  2 │ "b" │
│  3 │ "c" │
└────┴─────┘
2 rows
> +persistent_filtered(Id, Val) <- items(Id, Val), Id > 2
Rule 'persistent_filtered' registered.
> ?persistent_filtered(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  3 │ "c" │
└────┴─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_shadow_n04t07
Knowledge graph 'test_shadow_n04t07' dropped.
