Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_session_persist_n04t09
Knowledge graph 'test_session_persist_n04t09' created.
Switched to knowledge graph: test_session_persist_n04t09
> .kg use test_session_persist_n04t09
Switched to knowledge graph: test_session_persist_n04t09
> +base_data[(1,), (2,), (3,)]
Inserted 3 fact(s) into 'base_data'.
> session_fact(100)
Session fact added for 'session_fact'. (Use +session_fact(...) to persist)
> ?base_data(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
> ?session_fact(X)
┌─────┐
│ X   │
├─────┤
│ 100 │
└─────┘
1 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 0 session rule(s), 1 session fact(s))
> .kg use test_session_persist_n04t09
Switched to knowledge graph: test_session_persist_n04t09
> ?base_data(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
> ?session_fact(X)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_session_persist_n04t09
Knowledge graph 'test_session_persist_n04t09' dropped.
