Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_session_clear
Knowledge graph 'test_session_clear' created.
Switched to knowledge graph: test_session_clear
> .kg use test_session_clear
Switched to knowledge graph: test_session_clear
> +edge[(1, 2), (2, 3), (3, 4)].
Inserted 3 fact(s) into 'edge'.
> path(X, Y) :- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
(session: 1 rule(s))
> path(X, Z) :- edge(X, Y), path(Y, Z).
6 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (2, 3)
  (2, 4)
  (3, 4)
(session: 2 rule(s))
> node(1).
Session fact added for 'node'. (Use +node(...) to persist)
> node(2).
Session fact added for 'node'. (Use +node(...) to persist)
> .session
Session facts (2):
  1. node(1).
  2. node(2).
Session rules (2):
  1. path(X, Y) :- edge(X, Y).
  2. path(X, Z) :- edge(X, Y), path(Y, Z).
> ?- path(1, X).
3 rows:
  (1, 2)
  (1, 3)
  (1, 4)
> .session clear
Cleared 2 session fact(s), 2 session rule(s).
> .session
No session data defined.
> ?- path(1, X).
No results.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_session_clear
Knowledge graph 'test_session_clear' dropped.
