Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_session_overwrite_n04t11
Knowledge graph 'test_session_overwrite_n04t11' created.
Switched to knowledge graph: test_session_overwrite_n04t11
> .kg use test_session_overwrite_n04t11
Switched to knowledge graph: test_session_overwrite_n04t11
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> +special[(2,)]
Inserted 1 fact(s) into 'special'.
> connected(X, Y) <- edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
(session: 1 rule(s))
> .session
Session rules (1):
  1. connected(X, Y) <- edge(X, Y)
> ?connected(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> connected(X, Z) <- edge(X, Y), edge(Y, Z)
┌──────┬──────┬──────┐
│ col0 │ col1 │ col2 │
├──────┼──────┼──────┤
│    2 │    3 │    1 │
│    3 │    4 │    2 │
└──────┴──────┴──────┘
2 rows
(session: 2 rule(s))
> .session
Session rules (2):
  1. connected(X, Y) <- edge(X, Y)
  2. connected(X, Z) <- edge(X, Y), edge(Y, Z)
> ?connected(1, X)
No results.
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_session_overwrite_n04t11
Knowledge graph 'test_session_overwrite_n04t11' dropped.
