Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_remat_n04t21
Knowledge graph 'test_remat_n04t21' created.
Switched to knowledge graph: test_remat_n04t21
> .kg use test_remat_n04t21
Switched to knowledge graph: test_remat_n04t21
> +edge(1, 2)
Inserted 1 fact(s) into 'edge'.
> +edge(2, 3)
Inserted 1 fact(s) into 'edge'.
> +path(X, Y) <- edge(X, Y)
Rule 'path' registered.
> +path(X, Z) <- path(X, Y), edge(Y, Z)
Rule 'path' registered.
> from_one(Y) <- path(1, Y)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
└───┘
2 rows
(session: 1 rule(s))
> ?from_one(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
└───┘
2 rows
> +edge(3, 4)
Inserted 1 fact(s) into 'edge'.
> +edge(4, 5)
Inserted 1 fact(s) into 'edge'.
> from_one_updated(Y) <- path(1, Y)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
│ 4 │
│ 5 │
└───┘
4 rows
(session: 2 rule(s))
> ?from_one_updated(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 3 │
│ 4 │
│ 5 │
└───┘
4 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_remat_n04t21
Knowledge graph 'test_remat_n04t21' dropped.
