Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_session_rank_n04t24
Knowledge graph 'test_session_rank_n04t24' created.
Switched to knowledge graph: test_session_rank_n04t24
> .kg use test_session_rank_n04t24
Switched to knowledge graph: test_session_rank_n04t24
> +data[(1, 0.5), (2, 1.5), (3, 2.5)]
Inserted 3 fact(s) into 'data'.
> result(top_k<2, X, Y:desc>) <- data(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    2 │  1.5 │
│    3 │  2.5 │
└──────┴──────┘
2 rows
(session: 1 rule(s))
> result(within_radius<2.0, X, Y:asc>) <- data(X, Y)
Conflicting aggregation: cannot add clause with 'within_radius<2, X, Y:asc>' to session rule 'result' which already has a clause with 'top_k<2, X, Y:desc>'. Use '.session drop result' to remove the existing rule first.
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_session_rank_n04t24
Knowledge graph 'test_session_rank_n04t24' dropped.
