Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_neg_pr_n04t31
Knowledge graph 'test_sess_neg_pr_n04t31' created.
Switched to knowledge graph: test_sess_neg_pr_n04t31
> .kg use test_sess_neg_pr_n04t31
Switched to knowledge graph: test_sess_neg_pr_n04t31
> +item[(10,), (20,), (30,)]
Inserted 3 fact(s) into 'item'.
> +excluded[(10,)]
Inserted 1 fact(s) into 'excluded'.
> +not_excluded(X) <- item(X), !excluded(X)
Rule 'not_excluded' registered.
> ?not_excluded(X)
┌──────┐
│ col0 │
├──────┤
│   20 │
│   30 │
└──────┘
2 rows
> excluded(20)
Session fact added for 'excluded'. (Use +excluded(...) to persist)
> ?not_excluded(X)
┌──────┐
│ col0 │
├──────┤
│   30 │
└──────┘
1 rows
> .session clear
Cleared 1 session fact(s), 0 session rule(s).
> ?not_excluded(X)
┌──────┐
│ col0 │
├──────┤
│   20 │
│   30 │
└──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_neg_pr_n04t31
Knowledge graph 'test_sess_neg_pr_n04t31' dropped.
