Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_rec_n04t33
Knowledge graph 'test_sess_rec_n04t33' created.
Switched to knowledge graph: test_sess_rec_n04t33
> .kg use test_sess_rec_n04t33
Switched to knowledge graph: test_sess_rec_n04t33
> +edge[(1, 2), (2, 3)]
Inserted 2 fact(s) into 'edge'.
> reachable(X, Y) <- edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
└──────┴──────┘
2 rows
(session: 1 rule(s))
> reachable(X, Y) <- reachable(X, Z), edge(Z, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    2 │    3 │
└──────┴──────┘
3 rows
(session: 2 rule(s))
> ?reachable(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    2 │    3 │
└──────┴──────┘
3 rows
> edge(3, 4)
Session fact added for 'edge'. (Use +edge(...) to persist)
> ?reachable(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
│    2 │    3 │
│    2 │    4 │
│    3 │    4 │
└──────┴──────┘
6 rows
> .session clear
Cleared 1 session fact(s), 2 session rule(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_rec_n04t33
Knowledge graph 'test_sess_rec_n04t33' dropped.
