Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_chain_n04t34
Knowledge graph 'test_sess_chain_n04t34' created.
Switched to knowledge graph: test_sess_chain_n04t34
> .kg use test_sess_chain_n04t34
Switched to knowledge graph: test_sess_chain_n04t34
> +employee[(1, 50000), (2, 75000), (3, 90000)]
Inserted 3 fact(s) into 'employee'.
> high_earner(Id, Salary) <- employee(Id, Salary), Salary > 60000
┌──────┬───────┐
│ col0 │ col1  │
├──────┼───────┤
│    2 │ 75000 │
│    3 │ 90000 │
└──────┴───────┘
2 rows
(session: 1 rule(s))
> bonus(Id, Bonus) <- high_earner(Id, Salary), Bonus = Salary * 10 / 100
┌──────┬────────┐
│ col0 │ col1   │
├──────┼────────┤
│    2 │ 7500.0 │
│    3 │ 9000.0 │
└──────┴────────┘
2 rows
(session: 2 rule(s))
> ?bonus(Id, Bonus)
┌──────┬────────┐
│ col0 │ col1   │
├──────┼────────┤
│    2 │ 7500.0 │
│    3 │ 9000.0 │
└──────┴────────┘
2 rows
> .session clear
Cleared 0 session fact(s), 2 session rule(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_chain_n04t34
Knowledge graph 'test_sess_chain_n04t34' dropped.
