Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_mixed_n04t36
Knowledge graph 'test_sess_mixed_n04t36' created.
Switched to knowledge graph: test_sess_mixed_n04t36
> .kg use test_sess_mixed_n04t36
Switched to knowledge graph: test_sess_mixed_n04t36
> +base[(100,), (200,)]
Inserted 2 fact(s) into 'base'.
> base(300)
Session fact added for 'base'. (Use +base(...) to persist)
> ?base(X)
┌─────┐
│ X   │
├─────┤
│ 100 │
│ 200 │
│ 300 │
└─────┘
3 rows
> .session clear
Cleared 1 session fact(s), 0 session rule(s).
> ?base(X)
┌─────┐
│ X   │
├─────┤
│ 100 │
│ 200 │
└─────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_mixed_n04t36
Knowledge graph 'test_sess_mixed_n04t36' dropped.
