Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_multi_n04t38
Knowledge graph 'test_sess_multi_n04t38' created.
Switched to knowledge graph: test_sess_multi_n04t38
> .kg use test_sess_multi_n04t38
Switched to knowledge graph: test_sess_multi_n04t38
> +num[(1,), (2,), (3,), (4,), (5,)]
Inserted 5 fact(s) into 'num'.
> even(X) <- num(X), X % 2 = 0
┌───┐
│ X │
├───┤
│ 2 │
│ 4 │
└───┘
2 rows
(session: 1 rule(s))
> odd(X) <- num(X), X % 2 = 1
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
│ 5 │
└───┘
3 rows
(session: 2 rule(s))
> even_plus_one(X, Y) <- even(X), Y = X + 1
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 2 │ 3 │
│ 4 │ 5 │
└───┴───┘
2 rows
(session: 3 rule(s))
> ?even(X)
┌───┐
│ X │
├───┤
│ 2 │
│ 4 │
└───┘
2 rows
> ?odd(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 3 │
│ 5 │
└───┘
3 rows
> ?even_plus_one(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 2 │ 3 │
│ 4 │ 5 │
└───┴───┘
2 rows
> .session clear
Cleared 0 session fact(s), 3 session rule(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_multi_n04t38
Knowledge graph 'test_sess_multi_n04t38' dropped.
