Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_dup_n04t40
Knowledge graph 'test_sess_dup_n04t40' created.
Switched to knowledge graph: test_sess_dup_n04t40
> .kg use test_sess_dup_n04t40
Switched to knowledge graph: test_sess_dup_n04t40
> +base[(1,)]
Inserted 1 fact(s) into 'base'.
> base(2)
Session fact added for 'base'. (Use +base(...) to persist)
> base(2)
Session fact added for 'base'. (Use +base(...) to persist)
> base(3)
Session fact added for 'base'. (Use +base(...) to persist)
> ?base(X)
┌───┐
│ X │
├───┤
│ 1 │
│ 2 │
│ 3 │
└───┘
3 rows
> .session clear
Cleared 2 session fact(s), 0 session rule(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_dup_n04t40
Knowledge graph 'test_sess_dup_n04t40' dropped.
