Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_dup_pers_n04t41
Knowledge graph 'test_sess_dup_pers_n04t41' created.
Switched to knowledge graph: test_sess_dup_pers_n04t41
> .kg use test_sess_dup_pers_n04t41
Switched to knowledge graph: test_sess_dup_pers_n04t41
> +val[(10,), (20,)]
Inserted 2 fact(s) into 'val'.
> val(10)
Session fact added for 'val'. (Use +val(...) to persist)
> val(30)
Session fact added for 'val'. (Use +val(...) to persist)
> ?val(X)
┌──────┐
│ col0 │
├──────┤
│   10 │
│   20 │
│   30 │
└──────┘
3 rows
> .session clear
Cleared 2 session fact(s), 0 session rule(s).
> ?val(X)
┌──────┐
│ col0 │
├──────┤
│   10 │
│   20 │
└──────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_dup_pers_n04t41
Knowledge graph 'test_sess_dup_pers_n04t41' dropped.
