Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_pers_ins_n04t43
Knowledge graph 'test_sess_pers_ins_n04t43' created.
Switched to knowledge graph: test_sess_pers_ins_n04t43
> .kg use test_sess_pers_ins_n04t43
Switched to knowledge graph: test_sess_pers_ins_n04t43
> +data[(1,)]
Inserted 1 fact(s) into 'data'.
> doubled(X, Y) <- data(X), Y = X * 2
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
└───┴───┘
1 rows
(session: 1 rule(s))
> ?doubled(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
└───┴───┘
1 rows
> +data[(5,)]
Inserted 1 fact(s) into 'data'.
> ?doubled(X, Y)
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 1 │  2 │
│ 5 │ 10 │
└───┴────┘
2 rows
> .session clear
Cleared 0 session fact(s), 1 session rule(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_pers_ins_n04t43
Knowledge graph 'test_sess_pers_ins_n04t43' dropped.
