Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_selfjoin_n04t44
Knowledge graph 'test_sess_selfjoin_n04t44' created.
Switched to knowledge graph: test_sess_selfjoin_n04t44
> .kg use test_sess_selfjoin_n04t44
Switched to knowledge graph: test_sess_selfjoin_n04t44
> +friend[(1, 2), (2, 3), (3, 1), (1, 3)]
Inserted 4 fact(s) into 'friend'.
> mutual(A, B) <- friend(A, B), friend(B, A), A < B
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
└──────┴──────┘
1 rows
(session: 1 rule(s))
> ?mutual(A, B)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    3 │
└──────┴──────┘
1 rows
> .session clear
Cleared 0 session fact(s), 1 session rule(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_selfjoin_n04t44
Knowledge graph 'test_sess_selfjoin_n04t44' dropped.
