Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_sess_neg_filt_n04t45
Knowledge graph 'test_sess_neg_filt_n04t45' created.
Switched to knowledge graph: test_sess_neg_filt_n04t45
> .kg use test_sess_neg_filt_n04t45
Switched to knowledge graph: test_sess_neg_filt_n04t45
> +student[(1, 85), (2, 70), (3, 95), (4, 60), (5, 45)]
Inserted 5 fact(s) into 'student'.
> +honor_roll[(1,), (3,)]
Inserted 2 fact(s) into 'honor_roll'.
> needs_improvement(Id, Grade) <- student(Id, Grade), !honor_roll(Id), Grade > 50
┌───┬────┐
│ X │ Y  │
├───┼────┤
│ 2 │ 70 │
│ 4 │ 60 │
└───┴────┘
2 rows
(session: 1 rule(s))
> ?needs_improvement(Id, Grade)
┌────┬───────┐
│ Id │ Grade │
├────┼───────┤
│  2 │    70 │
│  4 │    60 │
└────┴───────┘
2 rows
> .session clear
Cleared 0 session fact(s), 1 session rule(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_neg_filt_n04t45
Knowledge graph 'test_sess_neg_filt_n04t45' dropped.
