Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_groupby_n04t46
Knowledge graph 'test_sess_groupby_n04t46' created.
Switched to knowledge graph: test_sess_groupby_n04t46
> .kg use test_sess_groupby_n04t46
Switched to knowledge graph: test_sess_groupby_n04t46
> +sale[("alice", 100), ("bob", 200), ("alice", 150)]
Inserted 3 fact(s) into 'sale'.
> total_by_person(Name, sum<Amount>) <- sale(Name, Amount)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "alice" │  250 │
│ "bob"   │  200 │
└─────────┴──────┘
2 rows
(session: 1 rule(s))
> ?total_by_person(Name, Total)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "alice" │  250 │
│ "bob"   │  200 │
└─────────┴──────┘
2 rows
> sale("bob", 300)
Session fact added for 'sale'. (Use +sale(...) to persist)
> total_by_person2(Name, sum<Amount>) <- sale(Name, Amount)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "alice" │  250 │
│ "bob"   │  500 │
└─────────┴──────┘
2 rows
(session: 2 rule(s))
> ?total_by_person2(Name, Total)
┌─────────┬──────┐
│ col0    │ col1 │
├─────────┼──────┤
│ "alice" │  250 │
│ "bob"   │  500 │
└─────────┴──────┘
2 rows
> .session clear
Cleared 1 session fact(s), 2 session rule(s).
> .kg use default
Switched to knowledge graph: default
> .kg drop test_sess_groupby_n04t46
Knowledge graph 'test_sess_groupby_n04t46' dropped.
