Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_insert_n02t01
Knowledge graph 'test_insert_n02t01' created.
Switched to knowledge graph: test_insert_n02t01
> .kg use test_insert_n02t01
Switched to knowledge graph: test_insert_n02t01
> +edge(1, 2).
Inserted 1 fact(s) into 'edge'.
> +edge(3, 4).
Inserted 1 fact(s) into 'edge'.
> +edge(5, 6).
Inserted 1 fact(s) into 'edge'.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (3, 4)
  (5, 6)
> .rel
Relations:
  edge (arity: 2)
> .rel edge
Relation: edge
  Columns: ["col0", "col1"]
  Total rows: 3
  Preview (first 3):
    (1, 2)
    (3, 4)
    (5, 6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_insert_n02t01
Knowledge graph 'test_insert_n02t01' dropped.
