Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_bulk_n02t02
Knowledge graph 'test_bulk_n02t02' created.
Switched to knowledge graph: test_bulk_n02t02
> .kg use test_bulk_n02t02
Switched to knowledge graph: test_bulk_n02t02
> +edge[(1,2), (2,3), (3,4), (4,5), (5,6)]
Inserted 5 fact(s) into 'edge'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
│ 4 │ 5 │
│ 5 │ 6 │
└───┴───┘
5 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_bulk_n02t02
Knowledge graph 'test_bulk_n02t02' dropped.
