Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_del
Knowledge graph 'test_del' created.
Switched to knowledge graph: test_del
> .kg use test_del
Switched to knowledge graph: test_del
> +edge[(1,2), (2,3), (3,4), (4,5), (5,6)].
Inserted 5 fact(s) into 'edge'.
> ?- edge(X, Y).
5 rows:
  (1, 2)
  (2, 3)
  (3, 4)
  (4, 5)
  (5, 6)
> -edge(3, 4).
Deleted 1 facts from 'edge'.
> ?- edge(X, Y).
4 rows:
  (1, 2)
  (2, 3)
  (4, 5)
  (5, 6)
> -edge(X, Y) :- edge(X, Y), X > 3.
Conditional delete not yet supported over HTTP. Use query API.
> ?- edge(X, Y).
4 rows:
  (1, 2)
  (2, 3)
  (4, 5)
  (5, 6)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del
Knowledge graph 'test_del' dropped.
