Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_del_nonexist
Knowledge graph 'test_del_nonexist' created.
Switched to knowledge graph: test_del_nonexist
> .kg use test_del_nonexist
Switched to knowledge graph: test_del_nonexist
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> -edge(99, 100).
Deleted 1 facts from 'edge'.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> -edge(X, Y) :- edge(X, Y), X > 100.
Conditional delete not yet supported over HTTP. Use query API.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del_nonexist
Knowledge graph 'test_del_nonexist' dropped.
