Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_del_nonexist_n02t04
Knowledge graph 'test_del_nonexist_n02t04' created.
Switched to knowledge graph: test_del_nonexist_n02t04
> .kg use test_del_nonexist_n02t04
Switched to knowledge graph: test_del_nonexist_n02t04
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> -edge(99, 100)
Deleted 0 facts from 'edge'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> -edge(X, Y) <- edge(X, Y), X > 100
Conditional delete: 0 fact(s) deleted from 'edge'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del_nonexist_n02t04
Knowledge graph 'test_del_nonexist_n02t04' dropped.
