Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_del_all_n02t05
Knowledge graph 'test_del_all_n02t05' created.
Switched to knowledge graph: test_del_all_n02t05
> .kg use test_del_all_n02t05
Switched to knowledge graph: test_del_all_n02t05
> +edge[(1,2), (2,3), (3,4)]
Inserted 3 fact(s) into 'edge'.
> ?edge(X, Y)
┌───┬───┐
│ X │ Y │
├───┼───┤
│ 1 │ 2 │
│ 2 │ 3 │
│ 3 │ 4 │
└───┴───┘
3 rows
> -edge(X, Y) <- edge(X, Y)
Conditional delete: 3 fact(s) deleted from 'edge'.
> ?edge(X, Y)
No results.
> +edge[(10,20), (20,30)]
Inserted 2 fact(s) into 'edge'.
> ?edge(X, Y)
┌────┬────┐
│ X  │ Y  │
├────┼────┤
│ 10 │ 20 │
│ 20 │ 30 │
└────┴────┘
2 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del_all_n02t05
Knowledge graph 'test_del_all_n02t05' dropped.
