Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_del_all
Knowledge graph 'test_del_all' created.
Switched to knowledge graph: test_del_all
> .kg use test_del_all
Switched to knowledge graph: test_del_all
> +edge[(1,2), (2,3), (3,4)].
Inserted 3 fact(s) into 'edge'.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> -edge(X, Y) :- edge(X, Y).
Conditional delete not yet supported over HTTP. Use query API.
> ?- edge(X, Y).
3 rows:
  (1, 2)
  (2, 3)
  (3, 4)
> +edge[(10,20), (20,30)].
Inserted 2 fact(s) into 'edge'.
> ?- edge(X, Y).
5 rows:
  (1, 2)
  (2, 3)
  (3, 4)
  (10, 20)
  (20, 30)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_del_all
Knowledge graph 'test_del_all' dropped.
