Executing script: examples/datalog/02_relations/06_delete_during_view.dl

> .db create test_del_view
Database 'test_del_view' created.
Switched to database: test_del_view
> .db use test_del_view
Switched to database: test_del_view
> +edge[(1,2), (2,3), (3,4), (4,5)].
Inserted 4 facts into 'edge'.
> path(X, Y) :- edge(X, Y).
4 rows:
  (1, 2)
  (2, 3)
  (3, 4)
  (4, 5)
(session: 1 rule(s))
> path(X, Z) :- edge(X, Y), path(Y, Z).
10 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 4)
  (3, 5)
  (4, 5)
(session: 2 rule(s))
> ?- path(X, Y).
10 rows:
  (1, 2)
  (1, 3)
  (1, 4)
  (1, 5)
  (2, 3)
  (2, 4)
  (2, 5)
  (3, 4)
  (3, 5)
  (4, 5)
> -edge(2, 3).
Deleted fact from 'edge'.
> ?- path(X, Y).
4 rows:
  (1, 2)
  (3, 4)
  (3, 5)
  (4, 5)
> -edge(3, 4).
Deleted fact from 'edge'.
> ?- path(X, Y).
2 rows:
  (1, 2)
  (4, 5)
> .db use default
Switched to database: default
(Cleared 2 session rule(s))
> .db drop test_del_view
Database 'test_del_view' dropped.
