Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_list_rel_n02t08
Knowledge graph 'test_list_rel_n02t08' created.
Switched to knowledge graph: test_list_rel_n02t08
> .kg use test_list_rel_n02t08
Switched to knowledge graph: test_list_rel_n02t08
> .rel
No relations in current knowledge graph.
> +users[(1, "alice"), (2, "bob")]
Inserted 2 fact(s) into 'users'.
> +products[(100, "widget"), (200, "gadget")]
Inserted 2 fact(s) into 'products'.
> +orders[(1, 100, 5), (2, 200, 3)]
Inserted 2 fact(s) into 'orders'.
> .rel
Relations:
  orders (arity: 3, columns: [col0: any, col1: any, col2: any], tuples: 2)
  products (arity: 2, columns: [col0: any, col1: any], tuples: 2)
  users (arity: 2, columns: [col0: any, col1: any], tuples: 2)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_list_rel_n02t08
Knowledge graph 'test_list_rel_n02t08' dropped.
