Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_bulk_ops_n02t10
Knowledge graph 'test_bulk_ops_n02t10' created.
Switched to knowledge graph: test_bulk_ops_n02t10
> .kg use test_bulk_ops_n02t10
Switched to knowledge graph: test_bulk_ops_n02t10
> +items[(1, "a"), (2, "b"), (3, "c"), (4, "d"), (5, "e")]
Inserted 5 fact(s) into 'items'.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │ "a" │
│  2 │ "b" │
│  3 │ "c" │
│  4 │ "d" │
│  5 │ "e" │
└────┴─────┘
5 rows
> -items[(2, "b"), (4, "d")]
Deleted 2 fact(s) from 'items'.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │ "a" │
│  3 │ "c" │
│  5 │ "e" │
└────┴─────┘
3 rows
> +items[(6, "f"), (7, "g")]
Inserted 2 fact(s) into 'items'.
> ?items(Id, Val)
┌────┬─────┐
│ Id │ Val │
├────┼─────┤
│  1 │ "a" │
│  3 │ "c" │
│  5 │ "e" │
│  6 │ "f" │
│  7 │ "g" │
└────┴─────┘
5 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_bulk_ops_n02t10
Knowledge graph 'test_bulk_ops_n02t10' dropped.
