Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_delete_wildcard_n02t12
Knowledge graph 'test_delete_wildcard_n02t12' created.
Switched to knowledge graph: test_delete_wildcard_n02t12
> .kg use test_delete_wildcard_n02t12
Switched to knowledge graph: test_delete_wildcard_n02t12
> +items[(1, "a", 100), (2, "b", 200), (3, "a", 300), (4, "c", 400)].
Inserted 4 fact(s) into 'items'.
> ?- items(Id, Cat, Val).
4 rows:
  (1, "a", 100)
  (2, "b", 200)
  (3, "a", 300)
  (4, "c", 400)
> -items(Id, "a", Val).
Deleted 0 facts from 'items'.
> ?- items(Id, Cat, Val).
4 rows:
  (1, "a", 100)
  (2, "b", 200)
  (3, "a", 300)
  (4, "c", 400)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_delete_wildcard_n02t12
Knowledge graph 'test_delete_wildcard_n02t12' dropped.
