Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_session_list_n33t05
Knowledge graph 'test_session_list_n33t05' created.
Switched to knowledge graph: test_session_list_n33t05
> .kg use test_session_list_n33t05
Switched to knowledge graph: test_session_list_n33t05
> +edge[(1, 2), (2, 3), (3, 4)]
Inserted 3 fact(s) into 'edge'.
> connected(X, Y) <- edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
│    3 │    4 │
└──────┴──────┘
3 rows
(session: 1 rule(s))
> path(X, Y) <- edge(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    2 │    3 │
│    3 │    4 │
└──────┴──────┘
3 rows
(session: 2 rule(s))
> path(X, Z) <- edge(X, Y), path(Y, Z)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
│    2 │    3 │
│    2 │    4 │
│    3 │    4 │
└──────┴──────┘
6 rows
(session: 3 rule(s))
> .session
Session rules (3):
  1. connected(X, Y) <- edge(X, Y)
  2. path(X, Y) <- edge(X, Y)
  3. path(X, Z) <- edge(X, Y), path(Y, Z)
> ?path(1, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
│    1 │    3 │
│    1 │    4 │
└──────┴──────┘
3 rows
> .kg use default
Switched to knowledge graph: default
(Cleared 3 session rule(s), 0 session fact(s))
> .kg drop test_session_list_n33t05
Knowledge graph 'test_session_list_n33t05' dropped.
