Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_session_drop_n33t06
Knowledge graph 'test_session_drop_n33t06' created.
Switched to knowledge graph: test_session_drop_n33t06
> .kg use test_session_drop_n33t06
Switched to knowledge graph: test_session_drop_n33t06
> +edge[(1, 2), (2, 3)].
Inserted 2 fact(s) into 'edge'.
> rule1(X, Y) :- edge(X, Y).
2 rows:
  (1, 2)
  (2, 3)
(session: 1 rule(s))
> rule2(X, Y) :- edge(X, Y), X > 1.
1 rows:
  (2, 3)
(session: 2 rule(s))
> rule3(X, Y) :- edge(X, Y), Y > 2.
1 rows:
  (2, 3)
(session: 3 rule(s))
> .session
Session rules (3):
  1. rule1(X, Y) :- edge(X, Y).
  2. rule2(X, Y) :- edge(X, Y), X > 1.
  3. rule3(X, Y) :- edge(X, Y), Y > 2.
> .session drop 2
Removed rule 2: rule2(X, Y) :- edge(X, Y), X > 1.
> .session
Session rules (2):
  1. rule1(X, Y) :- edge(X, Y).
  2. rule3(X, Y) :- edge(X, Y), Y > 2.
> .kg use default
Switched to knowledge graph: default
(Cleared 2 session rule(s), 0 session fact(s))
> .kg drop test_session_drop_n33t06
Knowledge graph 'test_session_drop_n33t06' dropped.
