Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_sess_invalid_n33t08
Knowledge graph 'test_sess_invalid_n33t08' created.
Switched to knowledge graph: test_sess_invalid_n33t08
> .kg use test_sess_invalid_n33t08
Switched to knowledge graph: test_sess_invalid_n33t08
> test_rule(X) <- items(X)
No results.
(session: 1 rule(s))
> .session
Session rules (1):
  1. test_rule(X) <- items(X)
> .session drop 99
Rule index 99 out of bounds.
> .session drop 0
Parse error: Index must be 1 or greater (1-based indexing)
> .kg use default
Switched to knowledge graph: default
(Cleared 1 session rule(s), 0 session fact(s))
> .kg drop test_sess_invalid_n33t08
Knowledge graph 'test_sess_invalid_n33t08' dropped.
