Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_session_invalid_n33t09
Knowledge graph 'test_session_invalid_n33t09' created.
Switched to knowledge graph: test_session_invalid_n33t09
> .kg use test_session_invalid_n33t09
Switched to knowledge graph: test_session_invalid_n33t09
> +base[(1, 2)]
Inserted 1 fact(s) into 'base'.
> computed(X, Y) <- base(X, Y)
┌──────┬──────┐
│ col0 │ col1 │
├──────┼──────┤
│    1 │    2 │
└──────┴──────┘
1 rows
(session: 1 rule(s))
> .session
Session rules (1):
  1. computed(X, Y) <- base(X, Y)
> .session drop 999
Script error: Rule index 999 out of bounds.
