Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_insert_n33t10
Knowledge graph 'test_rel_insert_n33t10' created.
Switched to knowledge graph: test_rel_insert_n33t10
> .kg use test_rel_insert_n33t10
Switched to knowledge graph: test_rel_insert_n33t10
> +data[(1, "a"), (2, "b"), (3, "c")]
Inserted 3 fact(s) into 'data'.
> .rel data
Relation: data
┌───┬─────┐
│ A │ B   │
├───┼─────┤
│ 1 │ "a" │
│ 2 │ "b" │
│ 3 │ "c" │
└───┴─────┘
3 of 3 total rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_insert_n33t10
Knowledge graph 'test_rel_insert_n33t10' dropped.
