Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_desc
Knowledge graph 'test_rel_desc' created.
Switched to knowledge graph: test_rel_desc
> .kg use test_rel_desc
Switched to knowledge graph: test_rel_desc
> +users[(1, "Alice", 30), (2, "Bob", 25), (3, "Carol", 35)].
Inserted 3 fact(s) into 'users'.
> .rel
Relations:
  users (arity: 3)
> .rel users
Relation: users
  Columns: ["col0", "col1", "col2"]
  Total rows: 3
  Preview (first 3):
    (1, "Alice", 30)
    (2, "Bob", 25)
    (3, "Carol", 35)
> ?- users(Id, Name, Age).
3 rows:
  (1, "Alice", 30)
  (2, "Bob", 25)
  (3, "Carol", 35)
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_desc
Knowledge graph 'test_rel_desc' dropped.
