Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_kg_current
Knowledge graph 'test_kg_current' created.
Switched to knowledge graph: test_kg_current
> .kg use test_kg_current
Switched to knowledge graph: test_kg_current
> .kg
Current knowledge graph: test_kg_current
> +marker[(1,)].
Inserted 1 fact(s) into 'marker'.
> .kg
Current knowledge graph: test_kg_current
> .kg use default
Switched to knowledge graph: default
> .kg drop test_kg_current
Knowledge graph 'test_kg_current' dropped.
