Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_compact_empty_n33t12
Knowledge graph 'test_compact_empty_n33t12' created.
Switched to knowledge graph: test_compact_empty_n33t12
> .kg use test_compact_empty_n33t12
Switched to knowledge graph: test_compact_empty_n33t12
> .compact
Compaction complete.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_compact_empty_n33t12
Knowledge graph 'test_compact_empty_n33t12' dropped.
