Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rule_empty
Knowledge graph 'test_rule_empty' created.
Switched to knowledge graph: test_rule_empty
> .kg use test_rule_empty
Switched to knowledge graph: test_rule_empty
> .rule
No rules defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_empty
Knowledge graph 'test_rule_empty' dropped.
