Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_rel_noexist_n33t14
Knowledge graph 'test_rel_noexist_n33t14' created.
Switched to knowledge graph: test_rel_noexist_n33t14
> .kg use test_rel_noexist_n33t14
Switched to knowledge graph: test_rel_noexist_n33t14
> .rel nonexistent_relation
Relation 'nonexistent_relation' not found.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_noexist_n33t14
Knowledge graph 'test_rel_noexist_n33t14' dropped.
