Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_prefix_ops_n33t17
Knowledge graph 'test_prefix_ops_n33t17' created.
Switched to knowledge graph: test_prefix_ops_n33t17
> .kg use test_prefix_ops_n33t17
Switched to knowledge graph: test_prefix_ops_n33t17
> +app_users[(1, "alice"), (2, "bob")]
Inserted 2 fact(s) into 'app_users'.
> +app_roles[("admin",), ("user",)]
Inserted 2 fact(s) into 'app_roles'.
> +other_data[(100,)]
Inserted 1 fact(s) into 'other_data'.
> +app_active(X, Name) <- app_users(X, Name)
Rule 'app_active' registered.
> +app_admin(Name) <- app_roles(Name), Name = "admin"
Rule 'app_admin' registered.
> ?app_users(X, Y)
┌───┬─────────┐
│ X │ Y       │
├───┼─────────┤
│ 1 │ "alice" │
│ 2 │ "bob"   │
└───┴─────────┘
2 rows
> .clear prefix app_
Cleared 4 fact(s) from 2 relation(s) with prefix 'app_': app_roles (2), app_users (2)
> ?other_data(X)
┌─────┐
│ X   │
├─────┤
│ 100 │
└─────┘
1 rows
> .rule drop prefix app_
Dropped 2 rule(s) with prefix 'app_': app_active, app_admin
> .rule list
No rules defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_prefix_ops_n33t17
Knowledge graph 'test_prefix_ops_n33t17' dropped.
