Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rel_desc_n33t23
Knowledge graph 'test_rel_desc_n33t23' created.
Switched to knowledge graph: test_rel_desc_n33t23
> .kg use test_rel_desc_n33t23
Switched to knowledge graph: test_rel_desc_n33t23
> +users[(1, "Alice", 30), (2, "Bob", 25), (3, "Carol", 35)]
Inserted 3 fact(s) into 'users'.
> .rel
Relations:
  users (arity: 3, columns: [col0: any, col1: any, col2: any], tuples: 3)
> .rel users
Relation: users
┌───┬─────────┬────┐
│ A │ B       │ C  │
├───┼─────────┼────┤
│ 1 │ "Alice" │ 30 │
│ 2 │ "Bob"   │ 25 │
│ 3 │ "Carol" │ 35 │
└───┴─────────┴────┘
3 of 3 total rows
> ?users(Id, Name, Age)
┌────┬─────────┬─────┐
│ Id │ Name    │ Age │
├────┼─────────┼─────┤
│  1 │ "Alice" │  30 │
│  2 │ "Bob"   │  25 │
│  3 │ "Carol" │  35 │
└────┴─────────┴─────┘
3 rows
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rel_desc_n33t23
Knowledge graph 'test_rel_desc_n33t23' dropped.
