Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_kg_current_n33t24
Knowledge graph 'test_kg_current_n33t24' created.
Switched to knowledge graph: test_kg_current_n33t24
> .kg use test_kg_current_n33t24
Switched to knowledge graph: test_kg_current_n33t24
> .kg
Current knowledge graph: test_kg_current_n33t24
> +marker[(1,)]
Inserted 1 fact(s) into 'marker'.
> .kg
Current knowledge graph: test_kg_current_n33t24
> .kg use default
Switched to knowledge graph: default
> .kg drop test_kg_current_n33t24
Knowledge graph 'test_kg_current_n33t24' dropped.
