Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Authenticated as: admin
Current knowledge graph: default

> .kg create test_rule_empty_n33t25
Knowledge graph 'test_rule_empty_n33t25' created.
Switched to knowledge graph: test_rule_empty_n33t25
> .kg use test_rule_empty_n33t25
Switched to knowledge graph: test_rule_empty_n33t25
> .rule
No rules defined.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_rule_empty_n33t25
Knowledge graph 'test_rule_empty_n33t25' dropped.
