Connecting to server at http://127.0.0.1:8080...
Connected!

Server status: healthy
Current knowledge graph: default

> .kg create test_clear_prefix_all_n33t32
Knowledge graph 'test_clear_prefix_all_n33t32' created.
Switched to knowledge graph: test_clear_prefix_all_n33t32
> .kg use test_clear_prefix_all_n33t32
Switched to knowledge graph: test_clear_prefix_all_n33t32
> +test_a[(1,), (2,)]
Inserted 2 fact(s) into 'test_a'.
> +test_b[(3,)]
Inserted 1 fact(s) into 'test_b'.
> .clear prefix test_
Cleared 3 fact(s) from 2 relation(s) with prefix 'test_': test_a (2), test_b (1)
> ?test_a(X)
No results.
> ?test_b(X)
No results.
> .kg use default
Switched to knowledge graph: default
> .kg drop test_clear_prefix_all_n33t32
Knowledge graph 'test_clear_prefix_all_n33t32' dropped.
